{
  "description": "The Accelerated ICND1 show will present fundamental networking theory and helps prepare viewers not only for the exam but working knowledge of how to configure, verify and connect Cisco equipment in a working network. This show is presented at an accelerated pace and highly focused on exam objectives to help the viewer to review the exam objectives for the 100-105 exam.  It is a great way to check for exam readiness!",
  "descriptionMD": "",
  "length": "43948",
  "name": "Accelerated CCENT",
  "practiceExam": true,
  "subtitle": "Cisco Certified Entry Network Technician",
  "tagUrl": "cisco",
  "topics": [
    {
      "episodes": [
        {
          "description": "The new ICND1 exam 100-105 is considered by Cisco to be the first exam that validates your skills as an entry level networking technician familiar with Cisco products, networking concepts and terminology. This exam tests a potential candidate's knowledge and skills in network fundamentals, Cisco LAN switching technologies, Cisco routing technologies, infrastructure services, and infrastructure administration and maintenance. The show will present fundamental theory and helps prepare viewers not only for the exam but working knowledge of how to configure, verify and connect cisco equipment in a working network.",
          "length": "271",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-1-introduction_to_icnd1-052616-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-1-introduction_to_icnd1-052616-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-1-introduction_to_icnd1-052616-1-sm.jpg",
          "title": "Introduction to ICND1",
          "transcript": "",
          "vimeoId": "170509545"
        },
        {
          "description": "In this episode, Todd Lammle introduces us to the basic networking concepts and components.  These are important concepts that establish the foundational knowledge of internetworking.  The focus is on terminology and basic concepts that must be mastered for the exam.",
          "length": "862",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-0-Internetworking-051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-0-Internetworking-051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-1-0-Internetworking-051816-1-sm.jpg",
          "title": "Internetworking",
          "transcript": "",
          "vimeoId": "167316383"
        },
        {
          "description": "In this episode, Todd introduces the OSI model and explains it’s basic purpose, breakdown and PDU concepts.  The OSI was introduced when networking between disparate networks was more likely, Todd explains and then tells us where it’s particular usefulness may have passed.  Even so, Todd breaks down the 7 layers into the Upper Block and Lower Block introducing why we still use it today.  It’s main use is descriptive, essentially allowing us to understand how data is prepared for networking between endpoints.  He also describes how data is broken into PDUs called segments, packets and frames that help to get data to it’s destination.",
          "length": "963",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-2-0-the_osi_model-051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-2-0-the_osi_model-051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-2-0-the_osi_model-051816-1-sm.jpg",
          "title": "The OSI Model",
          "transcript": "",
          "vimeoId": "167314239"
        },
        {
          "description": "In this episode, Todd Lammle introduces TCP/IP the protocol suite used in internetworking today.  He compares it to OSI model and then focuses in on the transport layer and internet layer of the TCP/IP model. Todd also describes the headers used in TCP and UDP and differentiates between them.  Also he helps differentiate between broadcast, multicast and unicast traffic emphasizing the header information used during data transmission.",
          "length": "1899",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-4-0-tcp_ip-051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-4-0-tcp_ip-051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-4-0-tcp_ip-051816-1-sm.jpg",
          "title": "TCP/IP",
          "transcript": "",
          "vimeoId": "167316460"
        },
        {
          "description": "In this episode, Todd explains and demonstrates his signature method of subnetting quickly.  He emphasizes the importance of being able to do this quickly and accurately.  This skill set according to Todd is indicator of readiness for the ICND1 exam.  He takes us through multiple examples and even some different types of questions that are based on understanding the concept of subnetting. **Errata - at the 46:36 mark, Ronnie incorrectly names 212 as the next number in the sequence. The correct number is 208",
          "length": "3255",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-1-subnetting-051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-1-subnetting-051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-1-subnetting-051816-1-sm.jpg",
          "title": "Easy Subnetting",
          "transcript": "",
          "vimeoId": "167422852"
        },
        {
          "description": "In this episode, Mr. Lammle continues to help prepare for the new exam by demonstrating subnetting on Class B networks.  He points out where confusion and problems occur doing subnetting on larger address space.  Using multiple examples, Todd demonstrates the most like type of subnetting questions that a CCENT candidate will tend to face.  He also emphasizes the necessity of this skill without doing binary conversion or ANDing if you’re pursuing the CCENT.",
          "length": "2529",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-8-1-class_b_subnetting-051916-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-8-1-class_b_subnetting-051916-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-8-1-class_b_subnetting-051916-1-sm.jpg",
          "title": "Class B Subnetting",
          "transcript": "",
          "vimeoId": "167422851"
        },
        {
          "description": "In this episode, Todd Lammle introduces to the IPv6 address characteristics.  Unlike IPv4, there are many different types of addresses: link local addresses, unique-local, unique global addresses.  The address space is a 128 bit in size.  It’s function though is analogous to that of IPv4 addresses but it does it differently, easier and better because of it’s design.  IPv6 addresses are either stateless or stateful.  Stateless addresses are auto configured and stateful addresses will be assigned through DHCPv.6.  In stateful addressing the advertisement is from the dhcp server using imcp 134 on ff02::1,   if stateless then the advertisement is from the client on ff02::2 on ICMP 133",
          "length": "1862",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-ipv6-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-ipv6-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-ipv6-052016-1-sm.jpg",
          "title": "IPv6",
          "transcript": "",
          "vimeoId": "168556226"
        },
        {
          "description": "In this episode, Todd continues to explain more about the use of IPv6 on a Cisco router.  He demonstrates how to configure IPv6 routing using RIPng, static routing and default routing.  Using various techniques, Todd demonstrates how to get an IPv6 address on the interfaces statically as well as using the IPv6 autoconfig commands.  Then he creates a static route and a default route between routers.  Todd also reminds us that without using IPv6 unicast-routing, Cisco routers will not use IPv6 for routing and shows us some of the verification commands such as show ipv6 interface brief.",
          "length": "1265",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-2-ipv6-pt2_052316-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-2-ipv6-pt2_052316-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-15-1-2-ipv6-pt2_052316-1-sm.jpg",
          "title": "IPv6 Part 2",
          "transcript": "",
          "vimeoId": "168821618"
        }
      ],
      "title": "Network Fundamentals"
    },
    {
      "episodes": [
        {
          "description": "In this episode, Mr. Lammle introduces the basic ethernet concepts with a reminder of the internetworking concepts of broadcast domains and collision domains.  He briefly describes the use of CDMA/CD and half-duplex communications.Along with this these concepts breaks down the components of an ethernet frame and describes the components of the ethernet header and explains the process of data encapsulation to successfully transmit data to its destination. He also take a moment to emphasize the need of learning binary to decimal conversion and binary to hexadecimal in preparing for the ICND1 exam.",
          "length": "1407",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-1-ethernet_051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-1-ethernet_051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-1-ethernet_051816-1-sm.jpg",
          "title": "Ethernet",
          "transcript": "",
          "vimeoId": "167315927"
        },
        {
          "description": "In this episode, Todd continues from the previous episodes ethernet focus by describing the different types of cabling standards and specification that a cisco professional is likely to encounter when working in the field.  He shows clearly the differences between straight through, crossover and rolled cables and their uses in context of connecting to networking equipment.  Todd points out that cisco provides a 3 layer model of Core, Distribution and Access layer devices  when designing networks.",
          "length": "1674",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-2-ethernet_pt2-2051816-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-2-ethernet_pt2-2051816-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-3-1-2-ethernet_pt2-2051816-1-sm.jpg",
          "title": "Ethernet Part 2",
          "transcript": "",
          "vimeoId": "167322046"
        },
        {
          "description": "In this episode, Todd Lammle introduces layer 2 switching concepts.  He describes basic switching function of forwarding, filtering and flooding and describes how a switch builds its mac address table using the source mac address of the frame.  Also Todd describes setting up port security in both it’s default mode as well as manual configuration to set the max number of mac addresses allowed and the different actions when the port-security is violated.  He also reminds us that to clear a switch we not only need to erase the startup configuration but also the vlan.dat file from flash.",
          "length": "2032",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-11-1-layer2_switching-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-11-1-layer2_switching-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-11-1-layer2_switching-052016-1-sm.jpg",
          "title": "Layer 2 Switching",
          "transcript": "",
          "vimeoId": "167731974"
        },
        {
          "description": "In this episode, Cisco Expert, Todd Lammle discusses the use of vlans and demonstrates it’s configuration.  Multiple vlans can exist on a single switch and a single vlan can span across multiple switches, according to Mr. Lammle.  He also emphasizes the use of trunking to allow for access to different vlans on different switches.  He also demonstrates how to configure both trunks and vlans.  Todd also shows us how to get data from one vlan to another vlan using IVR, inter-vlan routing.  He demonstrates the IVR configuration using ROAS as well as on a layer 3 switch.  The use of native vlans in 802.1q is also an objective topic emphasized that Todd describes and demonstrates.",
          "length": "3655",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-vlans_and_ivr-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-vlans_and_ivr-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-vlans_and_ivr-052016-1-sm.jpg",
          "title": "VLANs and Inter-VLAN Routing",
          "transcript": "",
          "vimeoId": "168835792"
        }
      ],
      "title": "LAN Switching Technologies"
    },
    {
      "episodes": [
        {
          "description": "In this episode, Todd Lammle introduces basic routing concepts.  He describes the route forwarding concept and explains how a router does a frame rewrite to forward the data to the next device.  Todd demonstrates how to manually configure routing statically.  This configuration shows us that static routing is unidirectional and administratively intensive with multiple routers but creates routes in the routing table with an Administrative Distance of ‘1’.  He also demonstrates the configuration of a default route which is helpful especially on stub networks—networks in which there is only one way in and one way out of it.",
          "length": "2278",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd100-105-10-1-1-ip_routing-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd100-105-10-1-1-ip_routing-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd100-105-10-1-1-ip_routing-052016-1-sm.jpg",
          "title": "IP Routing",
          "transcript": "",
          "vimeoId": "167733931"
        },
        {
          "description": "In this episode, Todd continues with IP routing by describing and demonstrating dynamic routing protocols.  These protocols are Distance Vector based, like RIP, IGRP and even EIGRP and LInk-State protocols like OSPF and IS-IS.  Instead of manually configuring routing, configuring with routing protocols allow you to choose how the routing table will be built according to the administrative distance and metrics.  He demonstrates the configuration of RIPv2 along with passive-interface.",
          "length": "2051",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-2-ip_routing_pt2-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-2-ip_routing_pt2-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-10-1-2-ip_routing_pt2-052016-1-sm.jpg",
          "title": "IP Routing Part 2",
          "transcript": "",
          "vimeoId": "167732060"
        },
        {
          "description": "In this episode, Todd Lammle help the candidate to understand how to do VLSM and why we need to use it.   He demonstrates his method for tackling questions that require an efficient use of the address space.  Mr. Lammle also show the need for route summarization on routers.  Using the summarization commands he demonstrates the configuration needed for route summarization and helps us to understand combine multiple networks together into address blocks for summarization.",
          "length": "2558",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-vlsm_and_summarization-051916-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-vlsm_and_summarization-051916-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-7-1-vlsm_and_summarization-051916-1-sm.jpg",
          "title": "VLSM and Summarization",
          "transcript": "",
          "vimeoId": "167422850"
        },
        {
          "description": "In this episode, Cisco expert, Todd Lammle reviews the basic security concepts and using ACLs to help secure Cisco devices.  He explains the difference between the standard and extended access lists as well as named ACLs.  He discusses the basics of where access lists are applied and how to configure them with the most specific filtering statements first then more generic statements toward the bottom of the list.  He emphasizes that ACLs use inverse masks and not subnet masks.  Todd demonstrates creating and applying the act on a router’s interface and VTY lines using access-list and access-class, respectively.",
          "length": "2446",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-13-1-security_052316-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-13-1-security_052316-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-13-1-security_052316-1-sm.jpg",
          "title": "Security",
          "transcript": "",
          "vimeoId": "168556776"
        }
      ],
      "title": "Routing Technologies"
    },
    {
      "episodes": [
        {
          "description": "In this episode, Todd shows us one of the key technologies that extended the life of IPv4, NAT.  He describes the three types of network address translation: static, dynamic and PAT.  He also demonstrates how to configure each, emphasizing the ip nat inside and ip nat outside ports that must be configured.",
          "length": "1773",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-14-1-network_address_translation-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-14-1-network_address_translation-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-14-1-network_address_translation-052016-1-sm.jpg",
          "title": "Network Address Translation",
          "transcript": "",
          "vimeoId": "168056478"
        }
      ],
      "title": "Infrastructure Services"
    },
    {
      "episodes": [
        {
          "description": "In this episode, Todd focuses in on managing the Cisco IOS. He talks about the configuration register and how to set it.  He also spends some time talking about backing up the IOS and use of ROMMON to help with password recovery as well as setting up remote access to the router through telnet and ssh.",
          "length": "2466",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-1-mangaging_cisco_internetworking-051916-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-1-mangaging_cisco_internetworking-051916-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-1-mangaging_cisco_internetworking-051916-1-sm.jpg",
          "title": "Managing Cisco Internetworking",
          "transcript": "",
          "vimeoId": "167736826"
        },
        {
          "description": "In this episode, Todd Lammle focuses in on two discovery protocols that help to show the physical connections and layer 2 information of those devices.  Configuring both CDP and LLDP, he explains the differences and similarities between them.  DNS and DHCP are two networking topics that are important and every candidate should be able to configure both on the cisco routers.  Remember that if your dhcp server resides on a different network than the DHCP clients an IP helper address must configured on the router interface facing the clients.",
          "length": "2328",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-2-managing_cisco_internetworking_pt2-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-2-managing_cisco_internetworking_pt2-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-2-managing_cisco_internetworking_pt2-052016-1-sm.jpg",
          "title": "Managing Cisco Internetworking Part 2",
          "transcript": "",
          "vimeoId": "167736409"
        },
        {
          "description": "In this episode, Todd shows the common protocol used in troubleshooting interworking.  He emphasizes the importance of setting the correct time for networking devices and it’s use in logging when events happen.  Demonstrating some details of NTP configuration, Todd shows how to verify NTP is working and its stratum levels.  He continues by emphasizing syslog messages and how to get the messages to output to a syslog server and the types of messages.  Other networking tools also was the extended ping command and show commands.  He completes the episode with licensing and how to load the license into the cisco device.",
          "length": "1729",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-3-managing_cisco_internetworking_pt3-052016-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-3-managing_cisco_internetworking_pt3-052016-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-6-1-3-managing_cisco_internetworking_pt3-052016-1-sm.jpg",
          "title": "Managing Cisco Internetworking Part 3",
          "transcript": "",
          "vimeoId": "167733522"
        },
        {
          "description": "In this episode, Todd takes a look into the hardware components of the router showing us the different components but also helping us to understand how the router works it’s boot process.  He demonstrates the most common configurations that we would want to see on a router, including, passwords, usernames, banners, interface descriptions as well as saving the configuration to the NVRAM.",
          "length": "2454",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-cisco_ios-051916-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-cisco_ios-051916-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-cisco_ios-051916-1-sm.jpg",
          "title": "Cisco IOS",
          "transcript": "",
          "vimeoId": "167887148"
        },
        {
          "description": "In this episode,  Mr. Lammle shows the most common commands that allow us to verify that our router is configured and working.   He emphasizes the need for a candidate to see and use these commands as called for without having to guess at what information each of the show commands provides for the technician.",
          "length": "2191",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-2-cisco_ios-pt2-051916-1.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-2-cisco_ios-pt2-051916-1-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/cisco-incd1100105/cisco-icnd1100-105-5-1-2-cisco_ios-pt2-051916-1-sm.jpg",
          "title": "Cisco IOS Part 2",
          "transcript": "",
          "vimeoId": "168057574"
        }
      ],
      "title": "Infrastructure Management"
    }
  ],
  "url": "ccent-updated-2016",
  "vLab": false
}
