{
  "description": "Those looking to complete the initial Mac Management certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive the certification. Besides having a general knowledge of operating a single Macintosh PC, one will learn in this course tactics in managing multiple Macintosh PC's like deploying OS X, deploying software applications, controlling machines with polices, and keeping systems up to date through software management.",
  "descriptionMD": "",
  "length": "20103",
  "name": "Mac Management Basics 10.9",
  "practiceExam": false,
  "subtitle": "Mavericks 10.9",
  "tagUrl": "legacy",
  "topics": [
    {
      "episodes": [
        {
          "description": "The Apple Certified Associate (ACA) certification achieved through Mac Management Basics shows one has a grasp of the basic tasks necessary to administer a network of Macs, which focuses more on managing and operating the software side of Macintosh systems. The ACA certification can be achieved in two versions through either Mac Integration Basics or Mac Management Basics and is an excellent starting point for people working with multiple Macintosh systems in a networked environment. Viewers will hear an overview about the knowledge one needs to attain the ACA certification, about the Mac Management Basics Exam and the content/ topics one should know for the exam.",
          "length": "687",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/001-Mac-Management-Basics.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/001-Mac-Management-Basics-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/001-Mac-Management-Basics-sm.jpg",
          "title": "Mac Management Basics",
          "transcript": "1\r\n00:00:00,000 --> 00:00:08,800\r\n[Music]\r\n\r\n2\r\n00:00:08,800 --> 00:00:16,966\r\nLet's take a moment to look at the Apple Certified Associate Certification.  It's designed to be an entry level certification for you to get \r\n\r\n3\r\n00:00:16,966 --> 00:00:25,199\r\nintroduced into the world of managing Macintosh PCs, and as such, it starts out pretty basic.  We have a couple of different certifications we \r\n\r\n4\r\n00:00:25,200 --> 00:00:33,033\r\ncan go through.  The one I want to look at specifically is the Mac Management Basics, the show that this video is going to be a part of.  \r\n\r\n5\r\n00:00:33,033 --> 00:00:40,499\r\nMac Management Basics is showing, well, kind of like what the name implies, that you have a grasp of the basic tasks necessary to \r\n\r\n6\r\n00:00:40,500 --> 00:00:47,366\r\nadminister a network pack full of Macs.  So, you might be in a school or a business, any kind of environment.  If you've got a lot of Macintosh \r\n\r\n7\r\n00:00:47,366 --> 00:00:55,166\r\nPCs then it is something you're going to have to support, and there are a lot of really cool utilities and features and functions that your average end \r\n\r\n8\r\n00:00:55,166 --> 00:01:02,966\r\nuser just never even sees but that we can really take advantage of to create a smooth networking environment.  So let's start talking about the \r\n\r\n9\r\n00:01:02,966 --> 00:01:10,032\r\ncertification itself.  If you weren't already aware, Apple does have a series of certifications you can pursue to show your knowledge in \r\n\r\n10\r\n00:01:10,033 --> 00:01:18,333\r\nsupporting Macintosh machines.  If you go to training.apple.com/certification, you can learn about them.  They've got their creative side as \r\n\r\n11\r\n00:01:18,333 --> 00:01:26,233\r\nwell as their ITPro side and that's what we want to see, ITPro.  You'll see the Mavericks 10.9 certifications.  That's where I'm going to go.  All \r\n\r\n12\r\n00:01:26,233 --> 00:01:34,766\r\nright, on the OS X side, you'll see several different certs that we can pursue, and let me just zoom in a little bit here.  It basically breaks \r\n\r\n13\r\n00:01:34,766 --> 00:01:42,599\r\ndown like this.  You start off with a couple of lower level Apple Certified Associate certifications, and from there you work up to the \r\n\r\n14\r\n00:01:42,600 --> 00:01:51,166\r\nhigher level Apple Certified Support Professional and the Apple Certified Technical Coordinator, that ACTC being at the highest level of this block \r\n\r\n15\r\n00:01:51,166 --> 00:01:59,132\r\nof certifications.  There are other certifications that are out there for people who are doing Apple warranty work that are actually repairing \r\n\r\n16\r\n00:01:59,133 --> 00:02:05,833\r\ncomputers.  These certifications focus more on the software side. actually managing and operating them, right?  If you get your Apple \r\n\r\n17\r\n00:02:05,833 --> 00:02:12,066\r\nCare warranty, you don't really need to know how to fix the hardware.  They take care of that for you, but managing the software, that's what \r\n\r\n18\r\n00:02:12,066 --> 00:02:19,166\r\nyou have to deal with.  So, we start right here with this one.  Mac Management Basics.  The Mac Management Certification is a great one to \r\n\r\n19\r\n00:02:19,166 --> 00:02:27,499\r\nget started with because it is geared towards people like you and me that have to support these machines, and it is not a very over-the-top \r\n\r\n20\r\n00:02:27,500 --> 00:02:35,400\r\ncertification so it's a pretty easy one to get started with and get your feet wet.  It is expected that you already know how to operate \r\n\r\n21\r\n00:02:35,400 --> 00:02:44,566\r\nat least a single Macintosh PC, that you know how to use the finder and install software, uninstall software, those kind of activities that \r\n\r\n22\r\n00:02:44,566 --> 00:02:51,766\r\nare just day-to-day operations.  So, you are expected to be, well, a Mac user, right, just to have that regular end-user knowledge, but then \r\n\r\n23\r\n00:02:51,766 --> 00:02:59,532\r\nwe add on the server knowledge on top of that to be able to manage these environments.  The certification consists of one course, right,  \r[\r\n\r\n24\r\n00:02:59,533 --> 00:03:06,599\r\ninaudible] knowledge and then one exam, and some of the nice things about it, well, they make the book for it, The Mac Management \r\n\r\n25\r\n00:03:06,600 --> 00:03:13,900\r\nBasics Guide, right there?  It is available for free.  You can download it right from Apple's website.  Every single question on the exam comes right \r\n\r\n26\r\n00:03:13,900 --> 00:03:21,200\r\nout of that book so everything that you need to know is right here.  It is just a .pdf that you can go and download, so if I click on it, it is going to \r\n\r\n27\r\n00:03:21,200 --> 00:03:29,333\r\ndownload here and, I'm not joking, everything you need to know is right here.  The book is not that bad.  It is about 90 pages long, and it goes \r\n\r\n28\r\n00:03:29,333 --> 00:03:36,833\r\nstep by step through all the various activities, and that's what we're going to use as a guideline for this show for our ITProTV Mac Management \r\n\r\n29\r\n00:03:36,833 --> 00:03:43,966\r\nBasic Show.  We're basically going to run right down this list and cover all the content that's in the book.  So, if you're a book reader, grab this.  \r\n\r\n30\r\n00:03:43,966 --> 00:03:50,799\r\nIt's got everything you need, but if you're not a book reader, if you want to see all this done in action, well, that's where we come in.  All right, \r\n\r\n31\r\n00:03:50,800 --> 00:03:58,700\r\nthe exam itself, you can take the exam two different ways.  Notice here it says available online.  You can take it in person at an Apple \r\n\r\n32\r\n00:03:58,700 --> 00:04:08,033\r\nAuthorized Training Center, (AATC).  If there is an AATC near you, then you can find that, jump on over there and take the exam.  The nearest \r\n\r\n33\r\n00:04:08,033 --> 00:04:15,966\r\nAATC for me is about two hours away, so that's not the coolest thing.  I don't like to have to drive two hours just to take an exam, so fortunately, \r\n\r\n34\r\n00:04:15,966 --> 00:04:23,232\r\nthis one is available online, also.  Now, a quick word about that, when you go in here to sign up for the exam, it's going to tell you you need to \r\n\r\n35\r\n00:04:23,233 --> 00:04:32,233\r\nsign up through Pearson VUE.  Pearson VUE is a third-party testing provider.  Here is the link right here to go and sign up for that exam.  Well, \r\n\r\n36\r\n00:04:32,233 --> 00:04:42,099\r\nthe Pearson VUE website defaults to the physically proctored exam, the one that you take at the AATC.  If you want to take it online, \r\n\r\n37\r\n00:04:42,100 --> 00:04:49,166\r\nyou actually have to, pay attention, you have to read what the website says.  It says right here that you get an exam key code, this Mac \r\n\r\n38\r\n00:04:49,166 --> 00:04:57,899\r\nMGMT 109, that's a special code that will let you sign up to take the exam online.  If you don't do that, it's going to assume you want to \r\n\r\n39\r\n00:04:57,900 --> 00:05:07,266\r\ntake it at a physical center.  The exam is $65, so, it's not terribly expensive.  It is 45 questions, although it doesn't say that here.  It's 45 \r\n\r\n40\r\n00:05:07,266 --> 00:05:17,066\r\nquestions long, and you get two hours to take it.  Plenty of time.  You won't be under pressure on this one.  Two hours for 45 questions is pretty \r\n\r\n41\r\n00:05:17,066 --> 00:05:27,432\r\nroomy, as far as time is concerned.  Five of the questions won't count toward your score.  They're like beta questions or things they're \r\n\r\n42\r\n00:05:27,433 --> 00:05:36,033\r\ntesting out just to see how well they work, so really only 40 of the questions are scored, and you need an 80% to pass.  So, an 80% will get \r\n\r\n43\r\n00:05:36,033 --> 00:05:43,999\r\nyou to pass.  Now, the five beta questions I mentioned, you don't know which ones they are, so you might as well just treat all 45 as scored \r\n\r\n44\r\n00:05:44,000 --> 00:05:51,900\r\nquestions.  You don't know which ones are going to be thrown out, but of the 40 remaining, you've got to get 80% right to pass.  To sign up \r\n\r\n45\r\n00:05:51,900 --> 00:05:58,266\r\nfor the exam, we just click on that Pearson VUE link, and it will take us over there to sign up, and you'll see where you can purchase an exam \r\n\r\n46\r\n00:05:58,266 --> 00:06:06,766\r\nfrom here or learn more.  Notice there are Apple Care certs.  Those are for the hardware repair personnel, and then you've got the Apple IT and \r\n\r\n47\r\n00:06:06,766 --> 00:06:14,266\r\nPro Apps.  That's the one that we want, right, where they are doing the IT side, and when you go to purchase the exam, here is where it will \r\n\r\n48\r\n00:06:14,266 --> 00:06:19,699\r\nwant you to sign in with your Pearson VUE account to go that route.  \r\n\r\n49\r\n00:06:19,700 --> 00:06:25,366\r\nNow, I don't want to sign in with my account here, but let me just go to the main \rPearson site, and on the main Pearson site, if \r\n\r\n50\r\n00:06:25,366 --> 00:06:34,266\r\nwe go to sign up for a test, I'm just going to go in here and tell it I'm going to do an IT and I want Apple IT and Pro Apps.   All right.  So, from \r\n\r\n51\r\n00:06:34,266 --> 00:06:42,066\r\nhere, you can go in and you can tell it, like, you want to view available exams, and it is going to list the Apple exams and I'll see Mac \r\n\r\n52\r\n00:06:42,066 --> 00:06:51,999\r\nManagement Basics right there, right, and it says 9L0-418.  That's my exam number!  But the problem is this one is referring to the AATC \r\n\r\n53\r\n00:06:52,000 --> 00:06:59,000\r\nproctored one, the one where you actually have to go to a training center.  But you'll see up here, do you have a private access code, and if \r\n\r\n54\r\n00:06:59,000 --> 00:07:07,366\r\nwe paste in that private access code from the website, that Mac MGMT 109, when you enter that, notice what happens to the exam number \r\n\r\n55\r\n00:07:07,366 --> 00:07:16,699\r\n-418, right, that was the exam, and you'll see here it says 9L0-418NP.  That means nonproctored.  In other words, you're going to \r\n\r\n56\r\n00:07:16,700 --> 00:07:23,900\r\ntake it yourself.  You'll take it via your web browser right here online, so you don't have to go to an AATC to do it.  All right, so that's the \r\n\r\n57\r\n00:07:23,900 --> 00:07:31,700\r\none we want.  You can choose that and now it will take us to the sign-up process.  You pick your language, and you pay your bill.  You know, \r\n\r\n58\r\n00:07:31,700 --> 00:07:38,933\r\nit does cost $65 to sign up for it, so when we purchase it, that's the next step for us is to pay that money.  You'll have 48 hours to take the \r\n\r\n59\r\n00:07:38,933 --> 00:07:44,933\r\nexam, so just because you purchase it right now doesn't mean you have to take the exam right now.  You get 48 hours.  You do have to \r\n\r\n60\r\n00:07:44,933 --> 00:07:52,833\r\ntake it.  If you don't take it at the end of the 48-hour period, you lose your $65, and you'll have to sign up again.  All right?  Once you sign up, \r\n\r\n61\r\n00:07:52,833 --> 00:07:59,999\r\nthough, you sit down and take the exam.  It's not a very bad one.  It's a reasonable exam, I think, compared to some of the other vendors.  \r\n\r\n62\r\n00:08:00,000 --> 00:08:07,166\r\nOnce you pass it, you're certified.  You'll get an email from Apple letting you know that they received your results, and it usually takes a \r\n\r\n63\r\n00:08:07,166 --> 00:08:14,099\r\nweek or two before you actually get your final notification from them letting you know that your certification is now active.  So, you'll be an \r\n\r\n64\r\n00:08:14,100 --> 00:08:21,933\r\nApple Certified Associate.  Keep in mind that every time a new version of OS X comes out, they update these exams.  So, right now we're \r\n\r\n65\r\n00:08:21,933 --> 00:08:28,999\r\ndoing the Mavericks exams, and when the next one comes out, you know, we'll have to update again and do that.  Now the exam really doesn't \r\n\r\n66\r\n00:08:29,000 --> 00:08:37,766\r\nchange all that much from OS to OS, so like if you did the Snow Leopard Exam, comparing it to the Mavericks exam they are almost identical \r\n\r\n67\r\n00:08:37,766 --> 00:08:44,332\r\nbecause the management software we used hasn't changed all that much from time to time.  But you'll get, you know, a couple of things that \r\n\r\n68\r\n00:08:44,333 --> 00:08:53,499\r\nchange, so it is important to recertify to show that you're good to go on the new OSs.  So that's our first leg of the journey.  People who \r\n\r\n69\r\n00:08:53,500 --> 00:09:00,800\r\nare kind of setting out on this course normally don't stop with the Mac Management Basics.  They normally continue on, and let me just go \r\n\r\n70\r\n00:09:00,800 --> 00:09:12,000\r\nback a bit here to...  Oh, did I, I closed the tab.  Let me go back to the Apple Training site.  They will normally continue on to do some of the other \r\n\r\n71\r\n00:09:12,000 --> 00:09:19,833\r\ncertifications, like Mac Integration Basics.  That's when we start integrating our Macs with Windows PCs.  A lot of environments have \r\n\r\n72\r\n00:09:19,833 --> 00:09:27,199\r\nWindows machines, either because they have to or for software they want or something like that and so you might need to mix your Mac and \r\n\r\n73\r\n00:09:27,200 --> 00:09:35,700\r\nyour Windows environment and that is what that exam focuses on.  If you want to continue on and go to do the ACSP or ACTC, well, for those \r\n\r\n74\r\n00:09:35,700 --> 00:09:44,066\r\nyou can read the book, you can do the training, whatever, but the exam has to be proctored.  You have to take that at an Apple Authorized \r\n\r\n75\r\n00:09:44,066 --> 00:09:52,999\r\nTraining Center (AATC).  So, it's a little bit different there, but that's kind of the progression we go through as we get certified.  All right, so \r\n\r\n76\r\n00:09:53,000 --> 00:10:02,233\r\nfor this show, we're going to be tackling that Mac Management Basics, and, basically, we're going to use that .pdf that they've got, that book, \r\n\r\n77\r\n00:10:02,233 --> 00:10:08,899\r\nthat's going to be our guide as we go through, and we're just going to kind of move right through it, and it covers some really cool stuff.  \r\n\r\n78\r\n00:10:08,900 --> 00:10:18,000\r\nIt starts out showing how to create images of PCs, of Mac machines, and be able to deploy those to other systems, so if you have 100 \r\n\r\n79\r\n00:10:18,000 --> 00:10:25,133\r\nMacs and you want them all to have the same software and same configuration, that's where we start out.  We image one.  We deploy it out \r\n\r\n80\r\n00:10:25,133 --> 00:10:31,933\r\nacross as many as we need.  So, that's the first two sections that we do, creating images and deploying them.  From there, we cover things \r\n\r\n81\r\n00:10:31,933 --> 00:10:40,199\r\nlike Apple Remote Desktop, which is a really cool software package that lets you remotely deploy software, do screen control, do all sorts \r\n\r\n82\r\n00:10:40,200 --> 00:10:47,100\r\nof desktop management functionality.  We do policy management where we can get the configurations across Macs to be the same.  \r\n\r\n83\r\n00:10:47,100 --> 00:10:53,666\r\nWe will see software updates and keeping our systems up to date.  We'll talk about caching software downloads so that you're not having to \r\n\r\n84\r\n00:10:53,666 --> 00:10:58,999\r\ndownload over and over again on all of your individual machines.  You can download once and cache it and then distribute that out to your \r\n\r\n85\r\n00:10:59,000 --> 00:11:07,000\r\nmachines.  So, all of these are really cool things, things that your average home user has no need to do, but if your managing a school or \r\n\r\n86\r\n00:11:07,000 --> 00:11:13,500\r\na business, these are things you'll do all the time, so they're really important tasks and it's all stuff that we're going to cover in this show.  So, \r\n\r\n87\r\n00:11:13,500 --> 00:11:21,566\r\nif that sounds interesting to you, you're in the right place.  Stay tuned.  We've got Mac Management Basics episodes coming up soon.  \r\n\r\n88\r\n00:11:21,566 --> 00:11:27,699\r\n[Music] \r\n\r\n",
          "url": "mac-management-basics",
          "vimeoId": "100816669"
        }
      ],
      "title": "Overview of Mac Management Basics"
    },
    {
      "episodes": [
        {
          "description": "Creating System Images is a useful function in which a default image of one console's software, configuration settings, and etc., are copied across a wide span of computers. Viewers will hear about the different Mac OS system images: NetBoot, NetInstall, and NetRestore and see demonstrations in creating system images to help in the process of anyone tasked with managing multiple Macintosh PCs.",
          "length": "3815",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/002-Creating-System-Images.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/002-Creating-System-Images-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/002-Creating-System-Images-sm.jpg",
          "title": "Creating System Images",
          "transcript": "",
          "url": "creating-system-images",
          "vimeoId": "100816670"
        }
      ],
      "title": "Creating System Images"
    },
    {
      "episodes": [
        {
          "description": "Deployment is the sequential step following the creation of a system image, which a system image is deployed on different consoles either through a smaller scale/ single use approach using USB bootable media or through a network for deployment on a wider scale. Viewers will be shown methods for deploying a system image, in particular, Mac OS X Mavericks by a USB bootable media installer and how to deploy NetInstall and NetRestore images over the network using the OS X Server App.",
          "length": "3450",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/003-Deployment.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/003-Deployment-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/003-Deployment-sm.jpg",
          "title": "Deployment",
          "transcript": "",
          "url": "deployment1",
          "vimeoId": "100910226"
        }
      ],
      "title": "Deployment"
    },
    {
      "episodes": [
        {
          "description": "The Apple Remote Desktop (ARD) software is an alternative option to the process of deploying a system image that transmits much smaller packages of information and can manage a much greater amount of machines at once, so that one doesn't have to deploy a full image or format a whole machine and redo it. Apple Remote Desktop benefits those managing a large quantity of Macs. Viewers will be shown how to set up clients and copy over files and install software on client profiles, as well as hear some of the ways ARD can be used to control the Macintosh system in a network, including: software distribution, remote assistance and administration, asset management and reporting, and automation.",
          "length": "2724",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/004-Remote-Desktop.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/004-Remote-Desktop-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/004-Remote-Desktop-sm.jpg",
          "title": "Remote Desktop",
          "transcript": "",
          "url": "remote-desktop",
          "vimeoId": "100910446"
        }
      ],
      "title": "Managing Computers with Apple Remote Desktop"
    },
    {
      "episodes": [
        {
          "description": "Policy management is the basic concept that when clients check in with servers, certain restrictions are implemented and then applied to them. Through the Profile Manager, one is able to configure policies to maintain how a system was first deployed. Viewers will see demonstrations for implementing policies to users and how to use other features of the Profile Manager, including how to remotely wipe or lock a device.",
          "length": "5417",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/005-Policy-Management.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/005-Policy-Management-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/005-Policy-Management-sm.jpg",
          "title": "Policy Management",
          "transcript": "",
          "url": "policy-management",
          "vimeoId": "100987451"
        }
      ],
      "title": "Policy Management"
    },
    {
      "episodes": [
        {
          "description": "Managing software updates across a wide span of computers can help to efficiently optimize your performance on a network and preserve bandwidth. Viewers will be shown how to configure a software update server to control updates on a network and how to set up a caching server, so that anything downloaded from Apple can be downloaded once and have a copy stored in a cache for other clients to download over a server, as opposed to a large quantity of clients each downloading copies of the same file over the internet.",
          "length": "4010",
          "thumbnail": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/006-Software-Updates-and-Caching.png",
          "thumbnailMed": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/006-Software-Updates-and-Caching-med.jpg",
          "thumbnailSm": "https://itprotv-image-bucket.s3.amazonaws.com/acamacbasics/006-Software-Updates-and-Caching-sm.jpg",
          "title": "Software Updates and Caching",
          "transcript": "",
          "url": "software-updates-caching",
          "vimeoId": "101079999"
        }
      ],
      "title": "Software Updates and Caching Software Downloads"
    }
  ],
  "url": "mac-management-basics",
  "vLab": false
}
