{
	"id": "55df18c9bcd0710700b4f464",
	"tagname": "CCNP",
	"contentFull": "",
	"contentShort": "",
	"url": "ccnp",
	"courses": [
		{
			"id": "54c2920ae108051570000025",
			"name": "CCNP Routing and Switching - ROUTE",
			"subtitle": "Implementing Cisco IP Routing",
			"description": "Those looking to complete the Cisco Certified Network Professional (CCNP) Routing and Switching certification will find in this course an overview of the process in achieving the certification and details about the 300-101 Route exam for implementing Cisco IP routing, which is one of three exams required to pass in order to receive the certification. The exam focuses on Cisco router implementation in medium and large environments and the exam objectives cover a wide range of topics including Layer 3 technologies, Infrastructure services and security, and others, which can also benefit those continuing to pursue the CCIE certification.",
			"descriptionMD": "",
			"courseLength": 130340,
			"hidden": false,
			"url": "ccnp-routing-switching",
			"productionStart": "2015-08-24T04:00:00Z",
			"productionEnd": "2015-09-04T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "560b3bd20e55600700ee2943",
			"name": "CCNP Routing and Switching - SWITCH",
			"subtitle": "Implementing Cisco IP Switched Networks",
			"description": "The Implementing Cisco IP Switched Networks exam is the second of three exams required to obtain the Cisco Certified Network Professional certification. This exam focuses on Cisco switch implementation in medium and large environment. The topics covered range from HSRP, STP, VTP to Etherchannel and how and why we use them.. The typical viewer would be anyone responsible for the maintenance and implementation of Cisco Switches in a large or enterprise organization. This SWITCH  emphasizes planning, configuring, and verifying the implementation of complex enterprise switching solutions that use the Cisco Enterprise Campus Architecture.",
			"descriptionMD": "",
			"courseLength": 43691,
			"hidden": false,
			"url": "ccnp-routing-switching1",
			"productionStart": "2015-09-28T04:00:00Z",
			"productionEnd": "2015-10-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "562a2d0fc3ef850700eae4f6",
			"name": "CCNP Routing and Switching - TSHOOT",
			"subtitle": "Troubleshooting and Maintaining Cisco IP Networks",
			"description": "Troubleshooting and Maintaining Cisco IP Networks exam is one of three exams required to obtain the Cisco Certified Network Professional - Routing and Switching certification. This exam focuses on troubleshooting Layer 2 and Layer 3 devices, planning regular maintenance, and troubleshooting methodology  in complex medium and large environments. The topics include Systematic Troubleshooting Principles, Layer 2 and Layer 3 technology, Infrastructure Services and Security, and VPN technologies. The typical viewer would be anyone responsible for the maintenance and implementation and administration of Cisco Layer 2 and Layer 3 technologies in complex organizations.",
			"descriptionMD": "",
			"courseLength": 68243,
			"hidden": false,
			"url": "ccnp-routing-switching2",
			"productionStart": "2015-10-19T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}