{
	"id": "560d76090e968e07003c95b7",
	"tagname": "CEH",
	"contentFull": "",
	"contentShort": "",
	"url": "ceh",
	"courses": [
		{
			"id": "54cbee94cdda3005004f04db",
			"name": "CEH v8",
			"subtitle": "Certified Ethical Hacker",
			"description": "EC-Council's Certified Ethical Hacker (CEH) certification covers concepts and tools related to exploiting systems, networks, devices and operating platforms. It is designed to get an individual into the world of pen testing to learn techniques of how to test a network or infrastructure. This includes hacking concepts such as vulnerability assessment, network intrusion, reverse engineering, defacing websites, damaging network appliances, launching distributed denial-of-service attacks, massive worm propagation, breaking passwords, brute-forcing authentication systems, cracking encryption, exploiting systems, advance viruses, Trojans, and other malware. This certificate is targeted at site administrators, security professionals, auditors and anyone who is concerned about the integrity of the network infrastructure that has practical real world experience to support this type of equipment.",
			"descriptionMD": "",
			"length": 102258,
			"hidden": false,
			"url": "ceh",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-05-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "576049e75f26ce0700591308",
			"name": "CEH v9",
			"subtitle": "Certified Ethical Hacker",
			"description": "EC-Council's Ethical Hacking and Countermeasures (CEH) covers concepts and tools related to exploiting systems, networks, devices and operating platforms. This includes hacking concepts such as vulnerability assessment, network intrusion, reverse engineering, defacing websites, damaging network appliances, launching distributed denial-of-service attacks, massive worm propagation, breaking passwords, brute-forcing authentication systems, cracking encryption, exploiting systems, advance viruses, Trojans, and other malware. This certificate is targeted at site administrators, security professionals, auditors and anyone who is concerned about the integrity of the network infrastructure.",
			"descriptionMD": "",
			"length": 121291,
			"hidden": false,
			"url": "ceh-v9",
			"productionStart": "2016-06-15T04:00:00Z",
			"productionEnd": "2016-08-31T04:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}