{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 137087,
      "description": "The CCENT show is built around the exam objectives for the Cisco certification bearing the same name.  The episodes are meant for the entry level technician working in a small branch environment where he is expected to install, configure, operate and troubleshoot Cisco routers and switches.  Each episode will focus on the technology, why we use it and how to configure and or operate them for a small enterprise environment.",
      "descriptionMD": "The CCENT show is built around the exam objectives for the Cisco certification bearing the same name.  The episodes are meant for the entry level technician working in a small branch environment where he is expected to install, configure, operate and troubleshoot Cisco routers and switches.  Each episode will focus on the technology, why we use it and how to configure and or operate them for a small enterprise environment.",
      "hidden": false,
      "name": "CCENT (2018)",
      "productionEnd": "2018-03-23T04:00:00Z",
      "productionStart": "2018-02-19T05:00:00Z",
      "subtitle": "Cisco Certified Entry Networking Technician",
      "url": "ccent-updated-2018"
    },
    {
      "courseLength": 43948,
      "description": "The Accelerated ICND1 show will present fundamental networking theory and helps prepare viewers not only for the exam but working knowledge of how to configure, verify and connect Cisco equipment in a working network. This show is presented at an accelerated pace and highly focused on exam objectives to help the viewer to review the exam objectives for the 100-105 exam.  It is a great way to check for exam readiness!",
      "descriptionMD": "",
      "hidden": false,
      "name": "Accelerated CCENT",
      "productionEnd": "2016-05-21T04:00:00Z",
      "productionStart": "2016-05-15T04:00:00Z",
      "subtitle": "Cisco Certified Entry Network Technician",
      "url": "ccent-updated-2016"
    },
    {
      "courseLength": 100544,
      "description": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
      "descriptionMD": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
      "hidden": false,
      "name": "CCNA Routing and Switching (2018)",
      "productionEnd": "2018-04-18T04:00:00Z",
      "productionStart": "2018-03-26T04:00:00Z",
      "subtitle": "Cisco Certified Network Associate",
      "url": "ccna-routingswitching-updated-2018"
    },
    {
      "courseLength": 33069,
      "description": "This Accelerated Cisco CCNA Routing + Switching show helps candidate review their exam readiness for 200-105 exam.  It’s a fast paced and hard hitting review of every exam objective for latest CCNA 200-105 exam. The accelerated pace is helpful for those that are ready for the exam and give an in-depth review of each objective you may encounter for CCNA R+S.\nThe episodes can be used as part of building a candidate's knowledge and skills in LAN switching technologies such as trunking, VLAN trunking protocol and dealing with Switching loops along with troubleshooting. IPv4 and IPv6 routing technologies in RIPng, EIGRP and OSPF are also discussed and configured helping the candidate to understand and troubleshoot configuration and routing issues. WAN technologies, infrastructure services, and infrastructure maintenance technologies are also described and configured to help the CCNA candidate not only for the exam but also for business and production use.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Accelerated CCNA Routing and Switching",
      "productionEnd": "2016-05-26T04:00:00Z",
      "productionStart": "2016-05-23T04:00:00Z",
      "subtitle": "Cisco Certified Network Associate",
      "url": "ccna-routing-switching2"
    },
    {
      "courseLength": 67769,
      "description": "The Implementing Cisco Network Security Show will help prepare the viewer for IINS Exam 210-260 exam by describing, discussing and demonstrating security principles and practices used by the CCNA Security professional.  This show will feature episodes with secure network infrastructure, understanding core security concepts, managing secure access, VPN encryption, firewalls, intrusion prevention, web and email content security, and endpoint security.  It will also include troubleshooting and monitoring of secure cisco networks devices.  If you're already a CCENT or CCNA R+S and want to specialize in security, the CCNA Security show help you to get started!",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNA Security",
      "productionEnd": "2016-06-17T23:00:00Z",
      "productionStart": "2016-05-31T23:00:00Z",
      "subtitle": "Cisco Certified Network Associate Security",
      "url": "ccna-security-updated-2016"
    },
    {
      "courseLength": 100811,
      "description": "The CCNA Security show will build knowledge of network infrastructure security, increase understanding core security concepts, show how to configure and manage secure access, VPN encryption, firewalls, intrusion prevention, web and email content security, and endpoint security using different security technologies.  Also demonstrates how install, troubleshoot, and monitor these technologies to achieve business defined security goals.",
      "descriptionMD": "The CCNA Security show will build knowledge of network infrastructure security, increase understanding core security concepts, show how to configure and manage secure access, VPN encryption, firewalls, intrusion prevention, web and email content security, and endpoint security using different security technologies.  Also demonstrates how install, troubleshoot, and monitor these technologies to achieve business defined security goals.",
      "hidden": false,
      "name": "CCNA Security (2018)",
      "productionEnd": "2018-05-08T04:00:00Z",
      "productionStart": "2018-05-06T04:00:00Z",
      "subtitle": "Cisco Certified Network Associate Security",
      "url": "ccna-security-2018"
    },
    {
      "courseLength": 92086,
      "description": "The Cisco Cybersecurity Fundamentals show is based around the released exam objectives for SECFND Exam 210-250. The show will cover every exam objective to help prepare those interested in becoming CCNA CyberOps certified.  The show aids those preparing for the first of two exams leading to that certification by helping understand cybersecurity basics, foundational networking and security knowledge and develop skills needed in preparation for the second (SECOPS) exam.",
      "descriptionMD": "The Cisco Cybersecurity Fundamentals show is based around the released exam objectives for SECFND Exam 210-250. The show will cover every exam objective to help prepare those interested in becoming CCNA CyberOps certified.  The show aids those preparing for the first of two exams leading to that certification by helping understand cybersecurity basics, foundational networking and security knowledge and develop skills needed in preparation for the second (SECOPS) exam.",
      "hidden": false,
      "name": "CCNA Cyber Ops (210-250 SECFND)",
      "productionEnd": "2017-01-22T17:40:17.945Z",
      "productionStart": "2017-01-22T17:40:17.945Z",
      "subtitle": "Cisco Cybersecurity Fundamentals",
      "url": "ccna-cyber-ops"
    },
    {
      "courseLength": 82211,
      "description": "The Cisco Cybersecurity Operations show (Exam 210-255) will help prepare someone preparing for the 2 exams of the CCNA Cyber Ops Certification.  It also aids them to get ready to begin working as an associate level analyst within a Security Operations Center (SOC) and help the candidate handle the tasks, duties and responsibilities working as an analyst in the SOC.  The show will focus on introductory-level skills of basic threat analysis, event correlation, identifying malicious activities and using a playbook for incident response.",
      "descriptionMD": "The Cisco Cybersecurity Operations show (Exam 210-255) will help prepare someone preparing for the 2 exams of the CCNA Cyber Ops Certification.  It also aids them to get ready to begin working as an associate level analyst within a Security Operations Center (SOC) and help the candidate handle the tasks, duties and responsibilities working as an analyst in the SOC.  The show will focus on introductory-level skills of basic threat analysis, event correlation, identifying malicious activities and using a playbook for incident response.",
      "hidden": false,
      "name": "CCNA Cyber Ops (210-255 SECOPS)",
      "productionEnd": "2017-08-25T04:00:00Z",
      "productionStart": "2017-08-21T04:00:00Z",
      "subtitle": "Cisco Cybersecurity Operations",
      "url": "ccna-cyber-ops-210255-secops"
    },
    {
      "courseLength": 130340,
      "description": "Those looking to complete the Cisco Certified Network Professional (CCNP) Routing and Switching certification will find in this course an overview of the process in achieving the certification and details about the 300-101 Route exam for implementing Cisco IP routing, which is one of three exams required to pass in order to receive the certification. The exam focuses on Cisco router implementation in medium and large environments and the exam objectives cover a wide range of topics including Layer 3 technologies, Infrastructure services and security, and others, which can also benefit those continuing to pursue the CCIE certification.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNP Routing and Switching - ROUTE",
      "productionEnd": "2015-09-04T04:00:00Z",
      "productionStart": "2015-08-24T04:00:00Z",
      "subtitle": "Implementing Cisco IP Routing",
      "url": "ccnp-routing-switching"
    },
    {
      "courseLength": 43691,
      "description": "The Implementing Cisco IP Switched Networks exam is the second of three exams required to obtain the Cisco Certified Network Professional certification. This exam focuses on Cisco switch implementation in medium and large environment. The topics covered range from HSRP, STP, VTP to Etherchannel and how and why we use them.. The typical viewer would be anyone responsible for the maintenance and implementation of Cisco Switches in a large or enterprise organization. This SWITCH  emphasizes planning, configuring, and verifying the implementation of complex enterprise switching solutions that use the Cisco Enterprise Campus Architecture.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNP Routing and Switching - SWITCH",
      "productionEnd": "2015-10-15T04:00:00Z",
      "productionStart": "2015-09-28T04:00:00Z",
      "subtitle": "Implementing Cisco IP Switched Networks",
      "url": "ccnp-routing-switching1"
    },
    {
      "courseLength": 68120,
      "description": "Troubleshooting and Maintaining Cisco IP Networks exam is one of three exams required to obtain the Cisco Certified Network Professional - Routing and Switching certification. This exam focuses on troubleshooting Layer 2 and Layer 3 devices, planning regular maintenance, and troubleshooting methodology  in complex medium and large environments. The topics include Systematic Troubleshooting Principles, Layer 2 and Layer 3 technology, Infrastructure Services and Security, and VPN technologies. The typical viewer would be anyone responsible for the maintenance and implementation and administration of Cisco Layer 2 and Layer 3 technologies in complex organizations.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNP Routing and Switching - TSHOOT",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-10-19T04:00:00Z",
      "subtitle": "Troubleshooting and Maintaining Cisco IP Networks",
      "url": "ccnp-routing-switching2"
    },
    {
      "courseLength": 28216,
      "description": "FirePOWER is the power of the next generation IPS/ firewall that runs on one’s managed devices and defense center and FireSIGHT is a passive technology that scans a network and gathers information about users, hosts and applications. Viewers will learn about Cisco FirePOWER (formerly SourceFIRE) and how it can be employed to secure a network. Upon completion of this series, you will be able to identify the various features of Cisco FirePOWER, the FireSIGHT Management Center and FirePOWER AMP. You will also be able to configure FireSIGHT policies to enforce your company's security policy to all traffic on your network.",
      "descriptionMD": "",
      "hidden": false,
      "name": "FirePOWER with Advanced FireSIGHT Administration",
      "productionEnd": "2015-11-13T05:00:00Z",
      "productionStart": "2015-11-09T05:00:00Z",
      "subtitle": "SSFIPS",
      "url": "firepower-advanced-firesight-administration"
    },
    {
      "courseLength": 13020,
      "description": "The Cisco ASA (Adaptive Security Appliance) is one of the most implemented security solutions found in enterprise networks.  Cisco offers an entire series of firewalls that range from small office solutions to very large enterprise solutions. It is because of its commonality that in many businesses an IT Professional would do well to be familiar with the product and some of the most essential configurations.  This series is designed to help an IT Professional to see how to configure many of the features in the ASA through the GUI interface, the ASDM.  This will provide an introduction to the appliance and guidance on some of most used features for any environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Cisco ASA Firewalls",
      "productionEnd": "2015-07-15T04:00:00Z",
      "productionStart": null,
      "subtitle": "Configuration of Cisco ASA Firewalls",
      "url": "cisco-asa-firewalls"
    },
    {
      "courseLength": 21749,
      "description": "Cisco ASA Express Security refers to the firewall product line that comes from Cisco. This course prepares the viewers for the Cisco ASA Express Security exam (500-260), which covers basic firewall configuration as well as the new features found in Cisco FirePOWER (formerly FireSIGHT) and is commonly required for Cisco Channel Partners that are selling and promoting Cisco Adaptive Security Appliances (ASA). One should attain the knowledge to at least be able to take an ASA out of the box, configure it to a network, get it filtering traffic and successfully get FirePOWER enabled and running. The knowledge one can attain in the CCENT and CCNA can serve as a great foundation base when learning about Cisco ASA.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Cisco ASA Express Security",
      "productionEnd": "2016-01-29T05:00:00Z",
      "productionStart": "2016-01-25T05:00:00Z",
      "subtitle": "Next Generation Firewall",
      "url": "cisco-asa-express-security"
    }
  ],
  "tagname": "Cisco",
  "url": "cisco"
}
