{
	"id": "55df16669b5b2d0700065d9e",
	"tagname": "Cisco",
	"contentFull": "",
	"contentShort": "",
	"url": "cisco",
	"courses": [
		{
			"id": "54c2920ae108051570000022",
			"name": "CCENT",
			"subtitle": "Cisco Certified Entry Networking Technician",
			"description": "August 20, 2016  is the last day for this exam. Those looking to complete the Cisco Certified Entry Networking Technician (CCENT) certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive it. The CCENT involves networking fundamentals, basic security, wireless concepts and other topics and is designed for entry level IT professionals getting ready for help desk and support type positions. Some of the exam objectives include Operation of IP Data Networks, LAN Switching Technologies, IP Addressing, Network Device Security, troubleshooting and others which provide good foundational knowledge for achieving further related certifications.",
			"descriptionMD": "",
			"courseLength": 63799,
			"hidden": false,
			"url": "ccent",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000023",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "September 24, 2016 is the last day for this exam. CCNA Overview The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"courseLength": 71087,
			"hidden": false,
			"url": "ccna-routing-switching",
			"productionStart": "2016-08-01T04:00:00Z",
			"productionEnd": "2016-09-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000024",
			"name": "CCNA Security 640-554",
			"subtitle": "Cisco Certified Network Associate Security",
			"description": "Those looking to complete the Cisco Certified Network Associate (CCNA) Security certification will find in this course an overview of the process in achieving the certification and details about the Implementing Cisco IOS Network Security (IINS) exam required to pass in order to receive the certification. CCNA Security addresses how to properly secure Cisco devices and security on Cisco routers and switches and is designed not just for IT professionals, but also for any kind of network administrator that supports Cisco equipment. The exam objectives cover a wide range of topics including common security threats, iOS ACLs, Cisco firewall technologies and others, which can provide foundational knowledge for achieving further related certifications like the CCNP.",
			"descriptionMD": "",
			"courseLength": 60986,
			"hidden": false,
			"url": "ccna-security",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000025",
			"name": "CCNP Routing and Switching - ROUTE",
			"subtitle": "Implementing Cisco IP Routing",
			"description": "Those looking to complete the Cisco Certified Network Professional (CCNP) Routing and Switching certification will find in this course an overview of the process in achieving the certification and details about the 300-101 Route exam for implementing Cisco IP routing, which is one of three exams required to pass in order to receive the certification. The exam focuses on Cisco router implementation in medium and large environments and the exam objectives cover a wide range of topics including Layer 3 technologies, Infrastructure services and security, and others, which can also benefit those continuing to pursue the CCIE certification.",
			"descriptionMD": "",
			"courseLength": 130340,
			"hidden": false,
			"url": "ccnp-routing-switching",
			"productionStart": "2015-08-24T04:00:00Z",
			"productionEnd": "2015-09-04T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5595a25086d76e1f00e0689e",
			"name": "Cisco ASA Firewalls",
			"subtitle": "Configuration of Cisco ASA Firewalls",
			"description": "The Cisco ASA (Adaptive Security Appliance) is one of the most implemented security solutions found in enterprise networks.  Cisco offers an entire series of firewalls that range from small office solutions to very large enterprise solutions. It is because of its commonality that in many businesses an IT Professional would do well to be familiar with the product and some of the most essential configurations.  This series is designed to help an IT Professional to see how to configure many of the features in the ASA through the GUI interface, the ASDM.  This will provide an introduction to the appliance and guidance on some of most used features for any environment.",
			"descriptionMD": "",
			"courseLength": 13020,
			"hidden": false,
			"url": "cisco-asa-firewalls",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-07-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "560b3bd20e55600700ee2943",
			"name": "CCNP Routing and Switching - SWITCH",
			"subtitle": "Implementing Cisco IP Switched Networks",
			"description": "The Implementing Cisco IP Switched Networks exam is the second of three exams required to obtain the Cisco Certified Network Professional certification. This exam focuses on Cisco switch implementation in medium and large environment. The topics covered range from HSRP, STP, VTP to Etherchannel and how and why we use them.. The typical viewer would be anyone responsible for the maintenance and implementation of Cisco Switches in a large or enterprise organization. This SWITCH  emphasizes planning, configuring, and verifying the implementation of complex enterprise switching solutions that use the Cisco Enterprise Campus Architecture.",
			"descriptionMD": "",
			"courseLength": 43691,
			"hidden": false,
			"url": "ccnp-routing-switching1",
			"productionStart": "2015-09-28T04:00:00Z",
			"productionEnd": "2015-10-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "562a2d0fc3ef850700eae4f6",
			"name": "CCNP Routing and Switching - TSHOOT",
			"subtitle": "Troubleshooting and Maintaining Cisco IP Networks",
			"description": "Troubleshooting and Maintaining Cisco IP Networks exam is one of three exams required to obtain the Cisco Certified Network Professional - Routing and Switching certification. This exam focuses on troubleshooting Layer 2 and Layer 3 devices, planning regular maintenance, and troubleshooting methodology  in complex medium and large environments. The topics include Systematic Troubleshooting Principles, Layer 2 and Layer 3 technology, Infrastructure Services and Security, and VPN technologies. The typical viewer would be anyone responsible for the maintenance and implementation and administration of Cisco Layer 2 and Layer 3 technologies in complex organizations.",
			"descriptionMD": "",
			"courseLength": 68243,
			"hidden": false,
			"url": "ccnp-routing-switching2",
			"productionStart": "2015-10-19T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5644e9fe597c030700e7ace5",
			"name": "FirePOWER with Advanced FireSIGHT Administration",
			"subtitle": "SSFIPS",
			"description": "FirePOWER is the power of the next generation IPS/ firewall that runs on one’s managed devices and defense center and FireSIGHT is a passive technology that scans a network and gathers information about users, hosts and applications. Viewers will learn about Cisco FirePOWER (formerly SourceFIRE) and how it can be employed to secure a network. Upon completion of this series, you will be able to identify the various features of Cisco FirePOWER, the FireSIGHT Management Center and FirePOWER AMP. You will also be able to configure FireSIGHT policies to enforce your company's security policy to all traffic on your network.",
			"descriptionMD": "",
			"courseLength": 28216,
			"hidden": false,
			"url": "firepower-advanced-firesight-administration",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-13T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56a693ea819ee0070038559f",
			"name": "Cisco ASA Express Security",
			"subtitle": "Next Generation Firewall",
			"description": "Cisco ASA Express Security refers to the firewall product line that comes from Cisco. This course prepares the viewers for the Cisco ASA Express Security exam (500-260), which covers basic firewall configuration as well as the new features found in Cisco FirePOWER (formerly FireSIGHT) and is commonly required for Cisco Channel Partners that are selling and promoting Cisco Adaptive Security Appliances (ASA). One should attain the knowledge to at least be able to take an ASA out of the box, configure it to a network, get it filtering traffic and successfully get FirePOWER enabled and running. The knowledge one can attain in the CCENT and CCNA can serve as a great foundation base when learning about Cisco ASA.",
			"descriptionMD": "",
			"courseLength": 21749,
			"hidden": false,
			"url": "cisco-asa-express-security",
			"productionStart": "2016-01-25T05:00:00Z",
			"productionEnd": "2016-01-29T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56eff4d659ecba0700e53dc7",
			"name": "CCNP Security - SENSS",
			"subtitle": "SENSS",
			"description": "The show covers knowledge needed and implementation skills to configure and place into production standard security on Cisco edge devices like a Cisco Switch, Router, as well as the Cisco ASA firewall. The show cover Threat Defense, Security Device GUIs and CLI Management, Management Services, Troubleshooting and Reporting Tools, Threat Defense Architects and Security Components and Considerations. The topics will focus on technology to enhance the security on the network perimeter: NAT (Network Address Translation), ASA policy and application inspection and Cisco Router Zone-Based firewall.",
			"descriptionMD": "",
			"courseLength": 17607,
			"hidden": true,
			"url": "ccnp-security-senss",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "572ba407f8bf200700b26a36",
			"name": "Cisco",
			"subtitle": "Demos covering Cisco technologies",
			"description": "Demos covering Cisco technologies",
			"descriptionMD": "",
			"courseLength": 1818,
			"hidden": true,
			"url": "cisco",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "573cd07888342b0700ed8998",
			"name": "Accelerated CCENT",
			"subtitle": "Cisco Certified Entry Network Technician",
			"description": "The Accelerated ICND1 show will present fundamental networking theory and helps prepare viewers not only for the exam but working knowledge of how to configure, verify and connect Cisco equipment in a working network. This show is presented at an accelerated pace and highly focused on exam objectives to help the viewer to review the exam objectives for the 100-105 exam.  It is a great way to check for exam readiness!",
			"descriptionMD": "",
			"courseLength": 43948,
			"hidden": false,
			"url": "ccent-updated-2016",
			"productionStart": "2016-05-15T04:00:00Z",
			"productionEnd": "2016-05-21T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5745ed56c9441f0700b44117",
			"name": "Accelerated CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "This Accelerated Cisco CCNA Routing + Switching show helps candidate review their exam readiness for 200-105 exam.  It’s a fast paced and hard hitting review of every exam objective for latest CCNA 200-105 exam. The accelerated pace is helpful for those that are ready for the exam and give an in-depth review of each objective you may encounter for CCNA R+S.\nThe episodes can be used as part of building a candidate's knowledge and skills in LAN switching technologies such as trunking, VLAN trunking protocol and dealing with Switching loops along with troubleshooting. IPv4 and IPv6 routing technologies in RIPng, EIGRP and OSPF are also discussed and configured helping the candidate to understand and troubleshoot configuration and routing issues. WAN technologies, infrastructure services, and infrastructure maintenance technologies are also described and configured to help the CCNA candidate not only for the exam but also for business and production use.",
			"descriptionMD": "",
			"courseLength": 33069,
			"hidden": false,
			"url": "ccna-routing-switching2",
			"productionStart": "2016-05-23T04:00:00Z",
			"productionEnd": "2016-05-26T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "574d8ae01454090700550689",
			"name": "CCNA Security",
			"subtitle": "Cisco Certified Network Associate Security",
			"description": "The Implementing Cisco Network Security Show will help prepare the viewer for IINS Exam 210-260 exam by describing, discussing and demonstrating security principles and practices used by the CCNA Security professional.  This show will feature episodes with secure network infrastructure, understanding core security concepts, managing secure access, VPN encryption, firewalls, intrusion prevention, web and email content security, and endpoint security.  It will also include troubleshooting and monitoring of secure cisco networks devices.  If you're already a CCENT or CCNA R+S and want to specialize in security, the CCNA Security show help you to get started!",
			"descriptionMD": "",
			"courseLength": 67769,
			"hidden": false,
			"url": "ccna-security-updated-2016",
			"productionStart": "2016-05-31T23:00:00Z",
			"productionEnd": "2016-06-17T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "574df0084cb65b07004c69e1",
			"name": "CCNA X Routing and Switching",
			"subtitle": "Cisco Certified Network Associate Routing and Switching",
			"description": "The CCNAX show delivers a combined content of CCENT and CCNA R+S into a single show but at a highly accelerated pace.  The show is meant for someone who is ready to take either the 200-125 exam or the 100-105 and 200-105. This show will help students to prepare for the exam by demonstrating how to implement, configure, verify and troubleshoot an existing IPv4 and IPv6 networks.  It includes topics like LAN switching, IP configuration of routers, connecting to WAN environments and identifying security threats to IP networks.  This show will help those that are ready for the 200-125 or the separate exams 100-105 and 200-105 to review every exam objective before the exam.  Before this show, you should be familiar with IP addressing and subnetting, internetworking concepts, security issues and troubleshooting cisco equipment and networking issues.",
			"descriptionMD": "",
			"courseLength": 76492,
			"hidden": true,
			"url": "ccna-routing-switching3",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "577d4c27b8bdb1070007e724",
			"name": "CCENT",
			"subtitle": "Cisco Certified Entry Networking Technician",
			"description": "The Cisco Certified Entry Networking Technician (CCENT) certification is targeted towards IT workers interested in becoming Network Administrators. The certification covers foundational networking topics required of anyone working with IPv4 and IPv6 networks. The series also covers configuring and maintaining Cisco routers and switches in small to medium sized networks. Topics covered in this series include routing protocols, VLANs, device security and more.",
			"descriptionMD": "",
			"courseLength": 77640,
			"hidden": false,
			"url": "ccent2017",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2016-05-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57a493bc1f2a8d07003b199e",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"courseLength": 70965,
			"hidden": false,
			"url": "ccna-routing-switching4",
			"productionStart": "2016-08-04T04:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "587d2a4952d4833d00a32bf0",
			"name": "CCNA Cyber Ops (210-250 SECFND)",
			"subtitle": "Cisco Cybersecurity Fundamentals",
			"description": "The Cisco Cybersecurity Fundamentals show is based around the released exam objectives for SECFND Exam 210-250. The show will cover every exam objective to help prepare those interested in becoming CCNA CyberOps certified.  The show aids those preparing for the first of two exams leading to that certification by helping understand cybersecurity basics, foundational networking and security knowledge and develop skills needed in preparation for the second (SECOPS) exam.",
			"descriptionMD": "The Cisco Cybersecurity Fundamentals show is based around the released exam objectives for SECFND Exam 210-250. The show will cover every exam objective to help prepare those interested in becoming CCNA CyberOps certified.  The show aids those preparing for the first of two exams leading to that certification by helping understand cybersecurity basics, foundational networking and security knowledge and develop skills needed in preparation for the second (SECOPS) exam.",
			"courseLength": 92086,
			"hidden": false,
			"url": "ccna-cyber-ops",
			"productionStart": "2017-01-22T17:40:17.945Z",
			"productionEnd": "2017-01-22T17:40:17.945Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "599ef6961690ea0b008548c6",
			"name": "CCNA Cyber Ops (210-255 SECOPS)",
			"subtitle": "Cisco Cybersecurity Operations",
			"description": "The Cisco Cybersecurity Operations show (Exam 210-255) will help prepare someone preparing for the 2 exams of the CCNA Cyber Ops Certification.  It also aids them to get ready to begin working as an associate level analyst within a Security Operations Center (SOC) and help the candidate handle the tasks, duties and responsibilities working as an analyst in the SOC.  The show will focus on introductory-level skills of basic threat analysis, event correlation, identifying malicious activities and using a playbook for incident response.",
			"descriptionMD": "The Cisco Cybersecurity Operations show (Exam 210-255) will help prepare someone preparing for the 2 exams of the CCNA Cyber Ops Certification.  It also aids them to get ready to begin working as an associate level analyst within a Security Operations Center (SOC) and help the candidate handle the tasks, duties and responsibilities working as an analyst in the SOC.  The show will focus on introductory-level skills of basic threat analysis, event correlation, identifying malicious activities and using a playbook for incident response.",
			"courseLength": 82211,
			"hidden": false,
			"url": "ccna-cyber-ops-210255-secops",
			"productionStart": "2017-08-21T04:00:00Z",
			"productionEnd": "2017-08-25T04:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}