{
  "contentFull": "Everything is moving to the cloud. Get the training you need to be a cloud computing pro with ITProTV – the fun and engaging way to learn. Azure, AWS, and MCSE Private Cloud are all included in the ITProTV course library.",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 70352,
      "description": "The CompTIA Cloud+ Certification is designed for IT professionals tasked with supporting private and public cloud infrastructures that have at least a few years of experience in IT networking. More and more companies are deploying cloud services in addition to, or in place of, traditional server infrastructure. The Cloud+ certification covers all the underlying hardware technologies, software, and logistics of deploying the technology, is designed to provide a well-rounded foundational knowledge of cloud and virtualization technologies and works to certify and validate one’s knowledge in the area of cloud computing.",
      "descriptionMD": "The CompTIA Cloud+ Certification is designed for IT professionals tasked with supporting private and public cloud infrastructures that have at least a few years of experience in IT networking. More and more companies are deploying cloud services in addition to, or in place of, traditional server infrastructure. The Cloud+ certification covers all the underlying hardware technologies, software, and logistics of deploying the technology, is designed to provide a well-rounded foundational knowledge of cloud and virtualization technologies and works to certify and validate one’s knowledge in the area of cloud computing. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
      "hidden": false,
      "name": "CompTIA Cloud+",
      "productionEnd": "2016-12-13T18:53:13.939Z",
      "productionStart": "2016-12-13T18:53:13.939Z",
      "subtitle": "Vendor-neutral cloud management",
      "url": "cloud"
    },
    {
      "courseLength": 30809,
      "description": "The Cloud Fundamentals video series is designed to introduce the viewer to cloud computing, which works from providers that can have thousands of servers and have more than enough hardware and CPU resources to support their systems and they rent out the extra capacity to users so the potential is not wasted. Positions like system administrators, developers and CIOs all benefit from implementing cloud technology. Cloud concepts and theory are discussed and then actual deployment examples of practical applications are demonstrated using Amazon Web Services and Microsoft Azure.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Cloud Fundamentals",
      "productionEnd": "2015-06-01T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Introduction to cloud computing",
      "url": "cloud-fundamentals"
    }
  ],
  "tagname": "Cloud Technology Skills",
  "url": "cloud-technology-skills"
}
