{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 68776,
      "description": "The CompTIA IT Fundamentals Certification is an entry level certification designed to introduce users to basic computer principles. It covers basic IT literacy and ensures one understands the different terminology and the various concepts involved In the IT industry. It also serves as a great starting point if you are just getting started in computers and is designed to be the first step on your way to pursuing the CompTIA A+ certification or others similar. Topics covered include hardware basics, troubleshooting, software installation, security and also networking.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CompTIA IT Fundamentals",
      "productionEnd": "2015-03-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "IT Fundamentals",
      "url": "fundamentals"
    },
    {
      "courseLength": 20825,
      "description": "The Apple Certified Associate certification is an excellent starting point for people working with Apple Mac systems in a networked environment. The certification covers topics like integrating Mac and Windows PCs as well as connecting to numerous network services. This certification course was previously titled Mac Integration Basics.",
      "descriptionMD": "The Apple Certified Associate certification is an excellent starting point for people working with Apple Mac systems in a networked environment. The certification covers topics like integrating Mac and Windows PCs as well as connecting to numerous network services. This certification course was previously titled Mac Integration Basics.",
      "hidden": false,
      "name": "ACA Mac Integration Basics 10.13",
      "productionEnd": "2018-04-18T04:00:00Z",
      "productionStart": "2018-04-10T04:00:00Z",
      "subtitle": "Apple Certified Associate",
      "url": "apple-certified-associate-1013"
    },
    {
      "courseLength": 40349,
      "description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-366: MTA Networking Fundamentals Exam.  This exam tests your knowledge about networking basics and the configuration of network settings and also covers the basic hardware one will find as network technicians in the field, terminology one is likely to encounter, and about the OSI model and different internet protocols which are foundational to all of networking. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-366: MTA Networking Fundamentals Exam.  This exam tests your knowledge about networking basics and the configuration of network settings and also covers the basic hardware one will find as network technicians in the field, terminology one is likely to encounter, and about the OSI model and different internet protocols which are foundational to all of networking. To gain an MTA certification, you must pass only one MTA exam.",
      "hidden": false,
      "name": "MTA - Networking Fundamentals - 98-366 (UPDATE 2018)",
      "productionEnd": "2018-06-19T04:00:00Z",
      "productionStart": "2018-06-04T04:00:00Z",
      "subtitle": "Networking Fundamentals",
      "url": "mta-networking-fundamentals-98366-update-2018"
    },
    {
      "courseLength": 46164,
      "description": "Microsoft Technology Associate (MTA) is an introductory Microsoft certification for individuals considering a career in technology. The Windows Server Administration Fundamentals exam is designed to provide an assessment of knowledge of fundamental server administration concepts. It covers a wide range of topics, such as Windows Server, Windows-based networking, Active Directory, and system recovery. Upon completing the 98-365 exam, you will earn a Microsoft Technology Associate certification, which helps prove your knowledge of fundamental technology concepts. It can also serve as a stepping stone to the Microsoft Certified Technology Specialist exams.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Server Fundamentals - 98-365",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Windows Server Administration Fundamentals",
      "url": "mta-server1"
    },
    {
      "courseLength": 62804,
      "description": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of macOS's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users with essential macOS capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports macOS users, manages networks, or provides technical support for the Mac.",
      "descriptionMD": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of macOS's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users with essential macOS capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports macOS users, manages networks, or provides technical support for the Mac.",
      "hidden": false,
      "name": "ACSP macOS Support Essentials 10.13",
      "productionEnd": "2018-03-29T04:00:00Z",
      "productionStart": "2018-01-29T05:00:00Z",
      "subtitle": "Apple Certified Support Professional",
      "url": "certified-support-professional-1013"
    },
    {
      "courseLength": 39508,
      "description": "This series is for anyone wanting a better understanding of the common malware types and related concepts needed to make informed decisions on which antivirus is right for their environment. We look at the consumer class antivirus software, some of the major components inside it and demonstrate some of the common antivirus software one might encounter in a home network or small home business. We will also venture into antivirus software that scales to large businesses via enterprise-class software. This series will help a technician or newcomer understand why they might need anti-malware and antivirus solutions and the difference between consumer class and enterprise class antivirus software.",
      "descriptionMD": "",
      "hidden": false,
      "name": "AntiVirus / AntiMalware",
      "productionEnd": "2015-11-30T05:00:00Z",
      "productionStart": "2015-11-15T05:00:00Z",
      "subtitle": "Detection and solutions",
      "url": "antivirus-antimalware"
    },
    {
      "courseLength": 51385,
      "description": "This show provides the very basic computer literacy skills by providing a comprehensive and full range of entry-level computing skills by Dr. Tonny Omwansa. It is foundational for anyone looking to move any profession using computers on a daily basis because entry-level computing skills have become a compulsory requirement in business today.\nDr. Omwansa helps the learner to come up to speed on computing basics, and helps them achieve competency and skills on a computer easily. The show  covers everything from computer hardware and software to the underlying functionality of a computer, and helps readers gain the skills and knowledge they need to move forward in their careers, or to successfully prepare for any of the IC3 Exams.  The show covers the following objectives\n•              Learn about computer hardware, software and other basic functions\n•              Get a full introduction to Windows and Microsoft Office\n•              Create polished documents and presentations in Microsoft Excel, PowerPoint and Word 2010\nGain an understanding of web basics, connectivity, security and privacy",
      "descriptionMD": "",
      "hidden": false,
      "name": "IC3-I Choose Life",
      "productionEnd": "2016-08-15T23:00:00Z",
      "productionStart": "2016-08-11T23:00:00Z",
      "subtitle": "Computing Fundamentals",
      "url": "ic3i-choose-life"
    },
    {
      "courseLength": 39383,
      "description": "Welcome to the Microsoft MTA Security Fundamentals series. This series is intended to explore the topics necessary to prepare for the 98-367 exam. Here we cover many computer security related concepts such as exploring their best practices and practical application. This includes important topics like security layers, operating system security, network security, and security software.",
      "descriptionMD": "Welcome to the Microsoft MTA Security Fundamentals series. This series is intended to explore the topics necessary to prepare for the 98-367 exam. Here we cover many computer security related concepts such as exploring their best practices and practical application. This includes important topics like security layers, operating system security, network security, and security software.",
      "hidden": false,
      "name": "MTA - Security Fundamentals  - 98-367 (2018)",
      "productionEnd": "2018-07-05T04:00:00Z",
      "productionStart": "2018-07-02T04:00:00Z",
      "subtitle": "Security Fundamentals",
      "url": "mta-security-fundamentals-98367-2018"
    },
    {
      "courseLength": 37499,
      "description": "The Microsoft Technology Associate (MTA) Cloud Fundamentals course is for anyone looking to learn foundational cloud computing knowledge as well as basic skills inside of Office 365 and Microsoft Intune. This is a great course for someone wanting to learn basic Office 365, Exchange Online, SharePoint Online and Skype for Business tasks. Content wise, one will hear about the different technologies one would use when it comes to utilizing the cloud, securing the data in the cloud, and even connect different services to things like the Office 365 interface as well as focus on the knowledge required for the 98-369: MTA Cloud Fundamental Exam. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Cloud Fundamentals - 98-369",
      "productionEnd": "2016-01-15T05:00:00Z",
      "productionStart": "2016-01-05T05:00:00Z",
      "subtitle": "Cloud Fundamentals",
      "url": "mta-cloud-fundamentals-98369"
    },
    {
      "courseLength": 137195,
      "description": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.",
      "descriptionMD": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration. __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
      "hidden": false,
      "name": "CompTIA Network+ 2016",
      "productionEnd": "2017-04-13T23:00:00Z",
      "productionStart": "2017-01-23T05:00:00Z",
      "subtitle": "Vendor-neutral networking",
      "url": "network-2016"
    },
    {
      "courseLength": 62889,
      "description": "Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate (MCSA) is one of the first steps for those seeking to start a technical career. The MCSA: Windows 7 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSA Windows 7 - 70-680",
      "productionEnd": "2014-05-30T04:00:00Z",
      "productionStart": null,
      "subtitle": "Windows 7, Configuring",
      "url": "mcsa-windows-7"
    },
    {
      "courseLength": 75789,
      "description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The 70-697 Configuring Windows Devices exam covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops and other devices in a corporate or enterprise environment. Most people know how to use Windows in a home environment, but there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives into those and gives the viewer a whole new toolbox for ensuring their computing environment is functional and stable.",
      "descriptionMD": "_This show is complete.  We are updating the recording to reflect new features and interface.  This one will be moved to Legacy when the updated version is complete._Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The 70-697 Configuring Windows Devices exam covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops and other devices in a corporate or enterprise environment. Most people know how to use Windows in a home environment, but there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives into those and gives the viewer a whole new toolbox for ensuring their computing environment is functional and stable.",
      "hidden": false,
      "name": "MCSA Windows 10 - 70-697",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-10-15T04:00:00Z",
      "subtitle": "Configuring Windows Devices",
      "url": "mcsa-windows-10"
    },
    {
      "courseLength": 108547,
      "description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The 70-697 Configuring Windows Devices exam covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops and other devices in a corporate or enterprise environment. Most people know how to use Windows in a home environment, but there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives into those and gives the viewer a whole new toolbox for ensuring their computing environment is functional and stable.",
      "descriptionMD": "_This show is still in production.  We are updating the recording to reflect new features and interface.  The previously recorded one will be moved to Legacy when this updated version is complete._Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The 70-697 Configuring Windows Devices exam covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops and other devices in a corporate or enterprise environment. Most people know how to use Windows in a home environment, but there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives into those and gives the viewer a whole new toolbox for ensuring their computing environment is functional and stable.",
      "hidden": false,
      "name": "MCSA Windows 10 - 70-697 (UPDATED 2018)",
      "productionEnd": "2018-02-28T05:00:00Z",
      "productionStart": "2018-02-26T05:00:00Z",
      "subtitle": "Configuring Windows Devices",
      "url": "mcsa-windows-10-70697-updated-2018"
    },
    {
      "courseLength": 42335,
      "description": "Unix and Unix-like operating systems(Linux/BSD), known for their speed and reliability, are becoming an ever increasing presence in many data centers and server closets. That being the case, systems administrators that are new to the command-line driven nature of these systems will need to get up to speed on how to interact with the CLI shell environment found as the default on the majority of those systems. In this series, we introduce you to that shell environment known as the Bourne Again Shell or bash, for short. The series starts with an introduction to the bash environment, showing and explaining to you how to navigate through the system using text-based commands. This includes file system navigation, setting file permissions, manipulating output, etc. Then, building upon that foundation, we show you how to automate repetitive tasks by creating customized scripts. All the main bash scripting abilities are covered; from basic repetitive command execution, to more complex functionality like arithmetic, arrays, conditional statements(if-then/elif/case-esac), program loops(for/while/until), and functions/libraries.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Bash and Scripting",
      "productionEnd": "2015-11-13T05:00:00Z",
      "productionStart": "2015-11-09T05:00:00Z",
      "subtitle": "CLI",
      "url": "bash-scripting"
    },
    {
      "courseLength": 8382,
      "description": "Dan and Wes walk you through the step-by-steps to build a personal computer. They demonstrate the installation of components like a motherboard, CPU, cooling systems, fans hard drives and power supplies.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Building a PC",
      "productionEnd": "2015-10-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Assembly and configuration",
      "url": "building-pc"
    },
    {
      "courseLength": 129538,
      "description": "In this series we will dive into the second exam that is required for a viewer to achieve an MCSA in Windows 10. The topics will range from installation of Windows 10, post-installation configurations, applying images, various deployment tools as well as monitoring and servicing Windows 10 and more. Exam candidates are encouraged to watch both Windows 10 series for the MCSA exams.",
      "descriptionMD": "_This show is still in production.  We are updating the recording to reflect new features and interface.  The previously recorded one will be moved to Legacy when this updated version is complete._ In this series we will dive into the second exam that is required for a viewer to achieve an MCSA in Windows 10. The topics will range from installation of Windows 10, post-installation configurations, applying images, various deployment tools as well as monitoring and servicing Windows 10 and more. Exam candidates are encouraged to watch both Windows 10 series for the MCSA exams.",
      "hidden": false,
      "name": "MCSA Windows 10 - 70-698 (UPDATED 2018)",
      "productionEnd": "2018-02-28T05:00:00Z",
      "productionStart": "2018-02-26T05:00:00Z",
      "subtitle": "Installing and Configuring Windows 10",
      "url": "mcsa-windows-10-70698-updated-2018"
    },
    {
      "courseLength": 17407,
      "description": "Citrix XenServer is the free virtualization software from Citrix. It is a commercially backed implementation of the open source Xen virtualization platform. The low cost of entry makes XenServer an attractive option for small and medium businesses looking for advanced hypervisor functions (clustering, live migration, centralized management) without the large price tag associated with competing products. ",
      "descriptionMD": "",
      "hidden": false,
      "name": "Citrix XenServer 6.2",
      "productionEnd": "2014-07-10T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Open-Source Virtualization",
      "url": "citrix-xenserver"
    },
    {
      "courseLength": 30809,
      "description": "The Cloud Fundamentals video series is designed to introduce the viewer to cloud computing, which works from providers that can have thousands of servers and have more than enough hardware and CPU resources to support their systems and they rent out the extra capacity to users so the potential is not wasted. Positions like system administrators, developers and CIOs all benefit from implementing cloud technology. Cloud concepts and theory are discussed and then actual deployment examples of practical applications are demonstrated using Amazon Web Services and Microsoft Azure.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Cloud Fundamentals",
      "productionEnd": "2015-06-01T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Introduction to cloud computing",
      "url": "cloud-fundamentals"
    },
    {
      "courseLength": 25843,
      "description": "In this series, Daniel and Justin endeavor to demonstrate some ways in which you might employ your scripting knowledge to practical, real-world uses. They will do this by creating a User Account Management system that will call upon many key scripting concepts and practices to reach its end goal.",
      "descriptionMD": "In this series, Daniel and Justin endeavor to demonstrate some ways in which you might employ your scripting knowledge to practical, real-world uses. They will do this by creating a User Account Management system that will call upon many key scripting concepts and practices to reach its end goal.",
      "hidden": false,
      "name": "Creating Practical Scripts",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2017-10-15T04:00:00Z",
      "subtitle": "Applying your scripting knowledge to everyday tasks",
      "url": "creating-practical-scripts"
    },
    {
      "courseLength": 39085,
      "description": "As one of the cornerstones of the Office suite, Word is a powerful word processor that allows users to create both simple and sophisticated documents. This series explores the essentials to getting started with Word 2016 on a Macintosh operating system. We begin with basic skills such as navigating a document, selecting text, inputting basic text, and proofing a document. The series also explores all aspects of character and paragraph formatting as well as page formatting and layout. While this series is designed for beginner users, it has lots of great tips and tricks for experienced users as well.",
      "descriptionMD": "As one of the cornerstones of the Office suite, Word is a powerful word processor that allows users to create both simple and sophisticated documents. This series explores the essentials to getting started with Word 2016 on a Macintosh operating system. We begin with basic skills such as navigating a document, selecting text, inputting basic text, and proofing a document. The series also explores all aspects of character and paragraph formatting as well as page formatting and layout. While this series is designed for beginner users, it has lots of great tips and tricks for experienced users as well.",
      "hidden": false,
      "name": "Word 2016 Essentials for Mac",
      "productionEnd": "2017-10-30T23:00:00Z",
      "productionStart": "2017-10-09T04:00:00Z",
      "subtitle": "Document and word processing software",
      "url": "word-2016-essentialsmac"
    },
    {
      "courseLength": 40917,
      "description": "CyberPatriot is an amazing free program. It is a  National Youth Cyber Education Program with emphasis on the national competition. In this course you will be introduced to the program, competition and basic skills needed to compete. This course should be used as a supplement to tools provided by your Coach, Technical Mentor, and resources covered in these videos. There are a great deal resources available to prepare you. Please take advantage of them.",
      "descriptionMD": "CyberPatriot is an amazing free program. It is a  National Youth Cyber Education Program with emphasis on the national competition. In this course you will be introduced to the program, competition and basic skills needed to compete. This course should be used as a supplement to tools provided by your Coach, Technical Mentor, and resources covered in these videos. There are a great deal resources available to prepare you. Please take advantage of them.For registration and more information please visit [their website.](https://www.uscyberpatriot.org/)",
      "hidden": false,
      "name": "CyberPatriot",
      "productionEnd": "2016-11-20T00:00:00Z",
      "productionStart": "2016-11-14T05:00:00Z",
      "subtitle": "National Youth Cyber Education Program",
      "url": "cyberpatriot"
    },
    {
      "courseLength": 3745,
      "description": "Malware is ever present in today’s computing systems whether home, office or enterprise and its important to be prepared. We will explore the world of malware elimination and take a look at various technologies to help quarantine, remediation and eliminate with common techniques.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Eliminating Malware",
      "productionEnd": "2016-03-18T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Tools and Techniques for Malware Removal/Prevention",
      "url": "eliminating-malware"
    },
    {
      "courseLength": 2666,
      "description": "This video series examines using encrypted email communications. Many email servers store and transmit emails in a non-secure manner. This series covers how to use OpenPGP to encrypt email prior to sending it which provides for end-to-end encryption. This is a critical component in guaranteeing the confidentiality of any email communication.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Email Encryption",
      "productionEnd": "2014-12-31T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "with OpenPGP",
      "url": "email-encryption"
    },
    {
      "courseLength": 11071,
      "description": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "descriptionMD": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "hidden": false,
      "name": "Security Awareness",
      "productionEnd": "2017-06-16T04:00:00Z",
      "productionStart": "2017-04-24T04:00:00Z",
      "subtitle": "Best security practices for the end user",
      "url": "user-security-awareness-2"
    },
    {
      "courseLength": 11071,
      "description": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "descriptionMD": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "hidden": false,
      "name": "End User Security Awareness",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2017-04-24T04:00:00Z",
      "subtitle": "Best Security Practices for the End User",
      "url": "user-security-awareness"
    },
    {
      "courseLength": 2621,
      "description": "In this series Daniel and Wes take a look at how to setup a wireless router in your home network. They talk about some of the considerations when it comes to implementing a wireless network like what standards, utilities, access point placement as well as interference and vendor documentation. They take you through the basic configurations to get your home router up and running.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Home Router Configuration",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Home Router Setup",
      "url": "home-router-configuration"
    },
    {
      "courseLength": 12036,
      "description": "This course introduces basic concepts for building web pages using HTML which gives structure to the content such as defining paragraphs and images and CSS which defines the appearance of the content such as colors and fonts. It also introduces bootstrap which is a collection of tools and templates for use with HTML and CSS.",
      "descriptionMD": "",
      "hidden": false,
      "name": "HTML, CSS and Bootstrap",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Responsive Web Design",
      "url": "html-css-bootstrap"
    },
    {
      "courseLength": 31634,
      "description": "In this series viewers will be introduced to the basics of the interworking of a computer’s system hardware and the individual components. The series will also tackle the basics of a computer operating system, applications, utilities and navigation. Finally the viewer will be guided through the basics of networking. This series is intended to give an introductory demonstration of the computing environment that most will encounter in todays world.",
      "descriptionMD": "",
      "hidden": false,
      "name": "IC3 Computing Fundamentals",
      "productionEnd": "2016-08-19T04:00:00Z",
      "productionStart": "2016-08-17T04:00:00Z",
      "subtitle": "Global Standard 5",
      "url": "ic3-computing-fundamentals"
    },
    {
      "courseLength": 19656,
      "description": "The IC3 Key Applications exam and certification is designed to demonstrate a candidate’s basic skill with the most common features found in business productivity programs such as Microsoft Office Word 2010, Excel 2010, PowerPoint 2010 and even Access 2010.  The show is to help the candidate, regardless of computing skills to gain an understanding and a basic working knowledge of these applications.  Other goals you’ll see in the show includes obtaining apps and understanding the terminology surrounding the use of these applications regardless of whether you’re using a desktop computer, tablet or a smart phone.",
      "descriptionMD": "",
      "hidden": false,
      "name": "IC3 Key Applications",
      "productionEnd": "2016-08-20T04:00:00Z",
      "productionStart": "2016-08-15T04:00:00Z",
      "subtitle": "Global Standard 5",
      "url": "ic3-key-applications"
    },
    {
      "courseLength": 11455,
      "description": "In this series the viewer will be introduced to terms and the concepts related to one digital presence today on the Internet. The viewer will learn about online concepts such as WiFi, email, web browsers and how to utilize them, digital ethics, citizenship and more.",
      "descriptionMD": "",
      "hidden": false,
      "name": "IC3 Living Online",
      "productionEnd": "2016-08-26T04:00:00Z",
      "productionStart": "2016-08-22T04:00:00Z",
      "subtitle": "Global Standard 5",
      "url": "ic3-living-online"
    },
    {
      "courseLength": 7249,
      "description": "Linux for Beginners is a technical skills course designed to introduce new users to the Linux operating system. This course is intended for users who are interested in learning about Linux, but have no previous exposure to the operating system. The series starts with a description of Linux and its history and then moves on to cover the graphical user interface and basic operations of the OS.",
      "descriptionMD": "Linux for Beginners is a technical skills course designed to introduce new users to the Linux operating system. This course is intended for users who are interested in learning about Linux, but have no previous exposure to the operating system. The series starts with a description of Linux and its history and then moves on to cover the graphical user interface and basic operations of the OS.",
      "hidden": false,
      "name": "Linux for Beginners",
      "productionEnd": "2017-06-14T04:00:00Z",
      "productionStart": "2017-06-12T04:00:00Z",
      "subtitle": "Getting started in Linux for new users",
      "url": "linuxbeginners"
    },
    {
      "courseLength": 33155,
      "description": "The Linux Command Line show is designed to introduce viewers to working on Linux based computers using only the command line interface. This is considered the first step in learning BASH scripting as most scripts are made up of a series of CLI commands.",
      "descriptionMD": "The Linux Command Line show is designed to introduce viewers to working on Linux based computers using only the command line interface. This is considered the first step in learning BASH scripting as most scripts are made up of a series of CLI commands.",
      "hidden": false,
      "name": "Linux Command Line",
      "productionEnd": "2017-09-27T04:00:00Z",
      "productionStart": "2017-09-20T04:00:00Z",
      "subtitle": "Getting started in the Linux command line",
      "url": "linux-command-line"
    },
    {
      "courseLength": 21188,
      "description": "Technicians and administrators alike need tools to diagnose computer problems, centrally manage encryption and recovery keys, provide consistency in user settings, provide application co-existence and more. These are some of the topics that we will tackle in our series on MDOP.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Microsoft Desktop Optimization Pack",
      "productionEnd": "2016-05-15T04:00:00Z",
      "productionStart": "2016-04-15T04:00:00Z",
      "subtitle": "MDOP",
      "url": "microsoft-desktop-optimization-pack"
    },
    {
      "courseLength": 12079,
      "description": "This series examines the challenges companies face while supporting a bring your own device (BYOD) model. Each episode explores a potential mobile vulnerability and then explores methods to mitigate attacks exploiting that vulnerability. The series uses a hands-on approach actually demonstrating how each compromise works to help better inform systems administrators as to how these compromises occur.",
      "descriptionMD": "This series examines the challenges companies face while supporting a bring your own device (BYOD) model. Each episode explores a potential mobile vulnerability and then explores methods to mitigate attacks exploiting that vulnerability. The series uses a hands-on approach actually demonstrating how each compromise works to help better inform systems administrators as to how these compromises occur.",
      "hidden": false,
      "name": "Mobile Security",
      "productionEnd": "2017-04-07T04:00:00Z",
      "productionStart": "2017-03-29T04:00:00Z",
      "subtitle": "Mobile device risks and mitigation",
      "url": "mobile-security"
    },
    {
      "courseLength": 7844,
      "description": "PC maintenance procedures and tips",
      "descriptionMD": "PC maintenance procedures and tips",
      "hidden": false,
      "name": "PC Maintenance",
      "productionEnd": "2017-10-26T04:00:00Z",
      "productionStart": "2017-10-26T04:00:00Z",
      "subtitle": "PC Maintenance",
      "url": "pc-maintenance"
    },
    {
      "courseLength": 45533,
      "description": "The Microsoft PowerShell is a secondary command line interface found in most Microsoft operating systems. The purpose of the PowerShell is to provide a much more feature rich scripting and automation environment than was previously possible in the base command shell. This series introduces the viewer to the PowerShell and its basic functions. It then moves in to specific areas like managing DNS, DHCP and Active Directory along with their typical commands. ",
      "descriptionMD": "",
      "hidden": false,
      "name": "PowerShell",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "for Administrators",
      "url": "powershell"
    },
    {
      "courseLength": 28200,
      "description": "Built on the .NET Framework, Windows PowerShell is a task-based command-line shell and scripting language. In this series, you will learn how to get started using PowerShell, mastering the basic skills, in preparation for more advanced topics.",
      "descriptionMD": "Built on the .NET Framework, Windows PowerShell is a task-based command-line shell and scripting language. In this series, you will learn how to get started using PowerShell, mastering the basic skills, in preparation for more advanced topics.",
      "hidden": false,
      "name": "PowerShell Basics",
      "productionEnd": "2017-10-16T23:00:00Z",
      "productionStart": "2017-10-09T04:00:00Z",
      "subtitle": "for Administrators",
      "url": "powershell-2017"
    },
    {
      "courseLength": 62194,
      "description": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
      "descriptionMD": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
      "hidden": false,
      "name": "Practical IT Security",
      "productionEnd": "2017-11-16T05:00:00Z",
      "productionStart": "2017-11-14T05:00:00Z",
      "subtitle": "Hands-On answers to security questions",
      "url": "practicalsecurity"
    },
    {
      "courseLength": 28938,
      "description": "These episodes will provide the foundational knowledge needed get you started in the world of IT security, which covers a wide range of topics from password policies to risk assessment to the three main areas of information security, which address the confidentiality, integrity and availability of data and keeping it secure. This course provides great starting point for those that are new to the world of IT security.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Security Fundamentals",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Core security concepts",
      "url": "security-fundamentals"
    },
    {
      "courseLength": 28647,
      "description": "In this series, Daniel and Tom take you through the \"DNA\" of Social Engineering. They will look into the history of Social Engineering to see where it began and how it has evolved. They will also discuss the tactics, concepts, and tools used by Social Engineers to elicit information from their targets. They also dive into the psychological component of both the attackers as well as the targets and point to documented examples for illustrative purposes.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Social Engineering",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "The art of hacking humans",
      "url": "social-engineering"
    },
    {
      "courseLength": 48447,
      "description": "Windows 7 is still a viable option out in the IT world and is one of the most commonly used desktop operating systems today. This series covers routine administrative tasks that any Desktop Support Technician or Help Desk Technician would be expected to handle on a regular basis including installation and deployment, managing and maintaining, and operational issues one may encounter supporting Windows 7 as an enterprise level technician.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Supporting Windows 7",
      "productionEnd": "2015-09-30T04:00:00Z",
      "productionStart": "2015-09-12T04:00:00Z",
      "subtitle": "Configuring and maintaining Windows 7",
      "url": "supporting-windows-7"
    },
    {
      "courseLength": 34434,
      "description": "There are a lot of different technologies that can be used to keep data more secure in Windows 10 including NTFS permissions, which controls the level of access someone has and the kind of actions one can perform on different files. The topics that are covered range from data security, host security, application management to recovery of the operating system. This is designed for a broad range of individuals including help-desk technicians to the average end-user seeking to implement a more secure Windows 10 environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Windows 10 Security",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-11-01T04:00:00Z",
      "subtitle": "Security in Windows 10",
      "url": "windows-10-security"
    },
    {
      "courseLength": 34024,
      "description": "Active Directory Domain Services (AD DS) allows you to create a scalable, secure, and manageable infrastructure for user and resource management, and you can provide support for directory-enabled applications. In these episodes, you will learn how to deploy and maintain Active Directory in both traditional networks and cloud-based solutions.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Working with Active Directory",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-11-01T04:00:00Z",
      "subtitle": "Deploy and maintain Active Directory",
      "url": "active-directory"
    },
    {
      "courseLength": 31670,
      "description": "Group Policy is an infrastructure that allows you to implement specific configurations for users and computers in a centralized manner. In these episodes, you will learn about configuring and maintaining a Group Policy infrastructure. You will also learn how to specify managed configurations for users and computers through Group Policy settings and Group Policy Preferences. Group Policy will allow you to provide the standardized functionality, security, and management control that your organization needs.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Working with Group Policy",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-11-09T05:00:00Z",
      "subtitle": "Group Policy",
      "url": "policy"
    }
  ],
  "tagname": "Help Desk/Support",
  "url": "help-desk"
}
