{
  "contentFull": "Looking for security certs? Get started on your Certified Information Systems Auditor (CISA) and Certified Information Systems Manager (CISM) right here. ITProTV is your partner is security training that’s current, engaging, and effective.",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 39324,
      "description": "The Certified Information Systems Auditor (CISA) designation is a globally recognized certification for IS audit control, assurance and security professionals. Being CISA-certified showcases your audit experience, skills and knowledge, and demonstrates you are capable to assess vulnerabilities, report on compliance and institute controls within the enterprise. One should have a minimum of 5 years of experience and be able to demonstrate proficiency and understanding across the 5 domains areas, which include auditing information systems, protection of information assets and others.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CISA",
      "productionEnd": "2017-01-13T16:00:15.547Z",
      "productionStart": "2017-01-13T16:00:15.547Z",
      "subtitle": "Certified Information Systems Auditor",
      "url": "cisa"
    },
    {
      "courseLength": 45921,
      "description": "The Certified Information Security Manager certification course is designed for those individuals seeking to enhance their skills, and be recognized for their expertise in Information Security Management. The course promotes the best in security practices from around the world and identifies the individual’s knowledge and expertise in this area. \n \nThe course is intended for individuals seeking to demonstrate mastery of security management skills in a global environment and prepare them for roles in advanced security management. The material contained covers all four of the Domains and associated Task and Knowledge Statements to adequately prepare the individual for passing the CISM exam.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CISM",
      "productionEnd": "2016-08-05T23:00:00Z",
      "productionStart": "2016-08-01T04:00:00Z",
      "subtitle": "Certified Information Security Manager",
      "url": "cism"
    }
  ],
  "tagname": "ISACA",
  "url": "isaca"
}
