{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 470,
      "description": "You’ve heard the terms “service management” and “project management”, but do you really understand what they are? In this episode Jo briefly explains the concepts to Justin and they explore the difference between the two.",
      "descriptionMD": "You’ve heard the terms “service management” and “project management”, but do you really understand what they are? In this episode Jo briefly explains the concepts to Justin and they explore the difference between the two.",
      "hidden": false,
      "name": "Project Management VS Service Management",
      "productionEnd": "2018-03-09T05:00:00Z",
      "productionStart": "2018-03-09T05:00:00Z",
      "subtitle": "Project Management VS Service Management",
      "url": "project-management-vs-service-management"
    },
    {
      "courseLength": 21847,
      "description": "** Look for our partner PassionIT Group's information in the Episode Files section of the first episode for curriculum, exam offers Codes for offers are available to members and in the download in the second episode** The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com). The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
      "hidden": false,
      "name": "Accredited ITIL Foundation",
      "productionEnd": "2017-01-13T18:05:17.298Z",
      "productionStart": "2017-01-13T18:05:17.298Z",
      "subtitle": "Foundation",
      "url": "itil-foundation-2016"
    },
    {
      "courseLength": 18136,
      "description": "ITIL Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
      "hidden": false,
      "name": "Accredited ITIL - Practitioner",
      "productionEnd": "2017-08-02T04:00:00Z",
      "productionStart": "2017-08-02T04:00:00Z",
      "subtitle": "ITIL Practitioner",
      "url": "itil-practitioner"
    },
    {
      "courseLength": 35010,
      "description": "The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - CSI",
      "productionEnd": "2017-06-27T04:00:00Z",
      "productionStart": "2017-06-16T04:00:00Z",
      "subtitle": "Continual Service Improvement",
      "url": "accredited-itil-intermediate-csi"
    },
    {
      "courseLength": 19397,
      "description": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - OSA",
      "productionEnd": "2017-01-23T14:04:56.388Z",
      "productionStart": "2017-01-23T14:04:56.388Z",
      "subtitle": "Operational Support and Analysis",
      "url": "accredited-itil-intermediate-OSA"
    },
    {
      "courseLength": 25100,
      "description": "The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - PPO",
      "productionEnd": "2017-05-19T04:00:00Z",
      "productionStart": "2017-05-09T04:00:00Z",
      "subtitle": "Planning, Protection and Optimization",
      "url": "itil-pro-planning-protectionoptimization"
    },
    {
      "courseLength": 29485,
      "description": "The ITIL:Release, Control, & Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release & deploy the required service management lifecycle for an organization.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The ITIL:Release, Control, & Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release & deploy the required service management lifecycle for an organization. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - RCV",
      "productionEnd": "2017-01-23T14:04:08.114Z",
      "productionStart": "2017-01-23T14:04:08.114Z",
      "subtitle": "Release Control and Validation",
      "url": "itil-intermediate"
    },
    {
      "courseLength": 58619,
      "description": "Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Design",
      "productionEnd": "2017-07-20T04:00:00Z",
      "productionStart": "2017-07-19T04:00:00Z",
      "subtitle": "Service Design",
      "url": "accredited-itil-intermediate-service-design"
    },
    {
      "courseLength": 48432,
      "description": "The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Operation",
      "productionEnd": "2017-06-16T04:00:00Z",
      "productionStart": "2017-06-12T04:00:00Z",
      "subtitle": "Service Operation",
      "url": "accredited-itil-intermediate-service-operation"
    },
    {
      "courseLength": 44307,
      "description": "The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Strategy",
      "productionEnd": "2017-06-30T04:00:00Z",
      "productionStart": "2017-06-28T04:00:00Z",
      "subtitle": "Service Strategy",
      "url": "accredited-itil-intermediate-service-strategy"
    },
    {
      "courseLength": 45685,
      "description": "In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset & Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset & Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Transition",
      "productionEnd": "2017-07-19T04:00:00Z",
      "productionStart": "2017-07-17T04:00:00Z",
      "subtitle": "Service Transition",
      "url": "accredited-itil-intermediate-service-transition"
    },
    {
      "courseLength": 28397,
      "description": "The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - SOA",
      "productionEnd": "2017-04-28T04:00:00Z",
      "productionStart": "2017-04-25T04:00:00Z",
      "subtitle": "Service Offerings and Agreements",
      "url": "accredited-itil-intermediate-soa"
    },
    {
      "courseLength": 32674,
      "description": "The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Expert - MALC",
      "productionEnd": "2017-06-13T23:00:00Z",
      "productionStart": "2017-06-06T04:00:00Z",
      "subtitle": "Managing Across the Lifecycle",
      "url": "accredited-itil-expert-malc"
    },
    {
      "courseLength": 2804,
      "description": "ITIL Master is the most prestigious of the ITIL qualifications. In this show Jo outlines the requirements, format, and timescale of the qualification to prepare you for the work ahead.",
      "descriptionMD": "ITIL Master is the most prestigious of the ITIL qualifications. In this show Jo outlines the requirements, format, and timescale of the qualification to prepare you for the work ahead.",
      "hidden": false,
      "name": "How To Become an ITIL Master",
      "productionEnd": "2017-08-25T04:00:00Z",
      "productionStart": "2017-08-25T04:00:00Z",
      "subtitle": "The most prestigious of the ITIL qualifications",
      "url": "itil-master"
    }
  ],
  "tagname": "ITIL",
  "url": "itil"
}
