{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 33681,
      "description": "In this series, we will show you how to extend an on-premises Active Directory to Microsoft Azure. Extending Active Directory in Azure can be used for disaster recovery and supporting branch offices, to name a few. We will start at the beginning, by setting up our on-premises network, including Active Directory, DNS, and Routing and Remote Access. We will use the RRAS server as our VPN endpoint, which we will use to establish a site-to-site VPN tunnel to Azure. Then we will create our virtual network in Azure, including defining subnets, creating a gateway, and provisioning public IP addresses. Then we will create our Azure resources, including a virtual domain controller, storage accounts, and availability sets. Then we will verify that Active Directory is replicating properly. We will demonstrate using three different methods, with the classic portal, with the new portal and with Azure PowerShell.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Active Directory in Azure",
      "productionEnd": "2016-02-28T05:00:00Z",
      "productionStart": "2016-02-15T05:00:00Z",
      "subtitle": "Cloud based directory and identity management",
      "url": "active-directory-azure"
    },
    {
      "courseLength": 211403,
      "description": "Those looking to complete the CompTIA A+ 900 Series certification will find in this course an overview of the process in achieving the certification and details about the two exams required to pass in order to receive the certification. The certification is designed for entry level IT professionals with about a year of experience. Some of the exam objectives include hardware, networking, mobile devices, operating systems, security, and troubleshooting, making it a valuable certification to have especially for one just getting in to the IT career field with no documented experience.",
      "descriptionMD": "Those looking to complete the _CompTIA A+ 900 Series_ certification will find in this course an overview of the process in achieving the certification and details about the two exams required to pass in order to receive the certification. The certification is designed for entry level IT professionals with about a year of experience. Some of the exam objectives include hardware, networking, mobile devices, operating systems, security, and troubleshooting, making it a valuable certification to have especially for one just getting in to the IT career field with no documented experience. __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
      "hidden": false,
      "name": "A+ 900 Series",
      "productionEnd": "2016-12-13T18:43:32.524Z",
      "productionStart": "2016-12-13T18:43:32.524Z",
      "subtitle": "Vendor-neutral hardware and software technologies",
      "url": "a1"
    },
    {
      "courseLength": 48412,
      "description": "MTA Overview The Microsoft Technology Associate (MTA) IT Infrastructure is designed to be an entry level certification for people getting started in the IT career field. The Windows Operating System Fundamentals exam covers general topics related to the day-to-day operation of a Windows 7 workstation and some of the administrative tasks required to keep the machine running smoothly. Upon completing the 98-349 exam, you will be awarded the MTA IT Infrastructure certification which demonstrates to employers that you have the basic skills required to provide IT support in a help desk or field technician role.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Windows Operating System Fundamentals -  98-349",
      "productionEnd": "2014-11-30T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Windows Operating System Fundamentals",
      "url": "mta"
    },
    {
      "courseLength": 77640,
      "description": "The Cisco Certified Entry Networking Technician (CCENT) certification is targeted towards IT workers interested in becoming Network Administrators. The certification covers foundational networking topics required of anyone working with IPv4 and IPv6 networks. The series also covers configuring and maintaining Cisco routers and switches in small to medium sized networks. Topics covered in this series include routing protocols, VLANs, device security and more.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCENT",
      "productionEnd": "2016-05-30T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Cisco Certified Entry Networking Technician",
      "url": "ccent2017"
    },
    {
      "courseLength": 20103,
      "description": "Those looking to complete the initial Mac Management certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive the certification. Besides having a general knowledge of operating a single Macintosh PC, one will learn in this course tactics in managing multiple Macintosh PC's like deploying OS X, deploying software applications, controlling machines with polices, and keeping systems up to date through software management.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Mac Management Basics 10.9",
      "productionEnd": "2014-11-24T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Mavericks 10.9",
      "url": "mac-management-basics"
    },
    {
      "courseLength": 33302,
      "description": "The Microsoft Excel 2016 episodes will give you a fundamental understanding of the Excel environment, and demonstrate the correct application of the principal features of Excel 2016. These episodes cover how to create and edit worksheets and workbooks with multiple sheets, working with cells and ranges, creating tables, applying formulas and functions, and creating charts and objects.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Excel 2016 - Level 1",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Spreadsheet application",
      "url": "excel-2016"
    },
    {
      "courseLength": 29251,
      "description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-366: MTA Networking Fundamentals Exam.  This exam tests your knowledge about networking basics and the configuration of network settings and also covers the basic hardware one will find as network technicians in the field, terminology one is likely to encounter, and about the OSI model and different internet protocols which are foundational to all of networking. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Networking Fundamentals - 98-366",
      "productionEnd": "2015-09-15T04:00:00Z",
      "productionStart": "2015-09-05T04:00:00Z",
      "subtitle": "Networking Fundamentals",
      "url": "mta1"
    },
    {
      "courseLength": 21996,
      "description": "Those looking to complete the initial Mac Integration Basics exam to obtain the Apple Certified Associates (ACA) Certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive the certification. One will learn in this course how to use Mac OS in a corporate/ enterprise environment, integrate it with other systems, and learn how to perform actions such as sharing files, printers, and other things that run between multiple systems running Mac OS.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Mac Integration Basics 10.9",
      "productionEnd": "2014-11-24T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Mavericks 10.9",
      "url": "mac-integration-basics"
    },
    {
      "courseLength": 78188,
      "description": "Those looking to complete the Apple Certified Support Professional (ACSP) certification will find in this course an overview of the process involved in achieving the certification and details about the exam required to pass in order to receive the certification. The certification is designed for technicians working in business environments supporting Apple computers and confirms one understands OS X's core functionality. Viewers will learn in this course tactics like basic installation and configuration of OS X Yosemite, managing user accounts, file systems used by Mac OS, enforcing policy across a network, data management, applications and processes, network configurations, and system management and security.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Certified Support Professional 10.10",
      "productionEnd": "2015-02-28T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "OS X Support Essentials 10.10",
      "url": "certified-support-professional"
    },
    {
      "courseLength": 68118,
      "description": "The Apple Certified Technical Coordinator certification is designed for anyone responsible for managing Apple computers and devices in a business environment. The exam is made up of content from the Support Essentials ACSP course, as well as content from the Server Essentials course which is covered in this show. Technologies covered include topics like network deployment, policy management, troubleshooting and using Open Directory for centralized user management.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Certified Technical Coordinator 10.10",
      "productionEnd": "2015-05-01T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "OS X Server Essentials 10.10",
      "url": "certified-technical-coordinator"
    },
    {
      "courseLength": 70965,
      "description": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNA Routing and Switching",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2016-08-04T04:00:00Z",
      "subtitle": "Cisco Certified Network Associate",
      "url": "ccna-routing-switching4"
    },
    {
      "courseLength": 51228,
      "description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on basic terminology, and concepts like CIA Triad, which is a set of core security principles that can provide as the foundation for security. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on basic terminology, and concepts like CIA Triad, which is a set of core security principles that can provide as the foundation for security. To gain an MTA certification, you must pass only one MTA exam.",
      "hidden": false,
      "name": "MTA - Security Fundamentals  - 98-367 (2017)",
      "productionEnd": "2017-06-02T23:00:00Z",
      "productionStart": "2017-05-22T23:00:00Z",
      "subtitle": "Security Fundamentals",
      "url": "mta-security-fundamentals-98367-2017"
    },
    {
      "courseLength": 37763,
      "description": "This show explores the foundational concepts and workings of Azure SQL. We start by defining why you might decide to implement a hosted database in Azure SQL vs an on-premise solution; detailing some of the benefits of moving to Azure SQL. We then describe some of the more advanced benefits of using Azure SQL like using Resource Groups, Geo-Restore, Point-In-Time Restore, and Self-Service Restore. Finally they take a look at the performance tiers as well as Database Throughput Units or DTUs.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Azure SQL",
      "productionEnd": "2016-01-31T05:00:00Z",
      "productionStart": "2016-01-15T05:00:00Z",
      "subtitle": "Relational Database-as-a-Service",
      "url": "azure-sql"
    },
    {
      "courseLength": 33247,
      "description": "The Microsoft Azure Virtual Machine course covers the foundational knowledge you need to implement an Azure Virtual Machine. The course is geared toward system administrators, who currently have systems in Azure or support local servers and want to transition over to Azure. One should expect to learn how to deploy virtual machines into Windows Azure, different configurations of those servers and how to manage them, the process of how to back up and restore a server and other features in Azure that can be used to supplement a virtual machine.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Azure Virtual Machine",
      "productionEnd": "2015-12-15T05:00:00Z",
      "productionStart": "2015-12-01T05:00:00Z",
      "subtitle": "Azure VM",
      "url": "azure-virtual-machine"
    },
    {
      "courseLength": 23292,
      "description": "Mac Integration Basics is an excellent starting point for people working with Macintosh systems in a networked environment. The certification covers topics like integrating Mac and Windows PCs as well as connecting to numerous network services. Viewers who pass the Mac Integration Basics exam will be awarded the Apple Certified Associate certification.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Mac Integration Basics 10.11",
      "productionEnd": "2016-03-31T04:00:00Z",
      "productionStart": "2016-03-15T04:00:00Z",
      "subtitle": "El Capitan 10.11",
      "url": "mac-integration-basics-1011"
    },
    {
      "courseLength": 72604,
      "description": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of OS X's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users  with essential OS X capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports OS X users, manages networks, or provides technical support for the Mac.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Certified Support Professional 10.11",
      "productionEnd": "2016-04-15T04:00:00Z",
      "productionStart": "2016-03-28T04:00:00Z",
      "subtitle": "OS X Support Essentials 10.11",
      "url": "certified-support-professional-1011"
    },
    {
      "courseLength": 23560,
      "description": "Mac Integration Basics is an excellent starting point for people working with Macintosh systems in a networked environment. The certification covers topics like integrating Mac and Windows PCs as well as connecting to numerous network services. Viewers who pass the Mac Integration Basics exam will be awarded the Apple Certified Associate certification.",
      "descriptionMD": "Mac Integration Basics is an excellent starting point for people working with Macintosh systems in a networked environment. The certification covers topics like integrating Mac and Windows PCs as well as connecting to numerous network services. Viewers who pass the Mac Integration Basics exam will be awarded the Apple Certified Associate certification.",
      "hidden": false,
      "name": "Mac Integration Basics 10.12",
      "productionEnd": "2017-04-25T23:00:00Z",
      "productionStart": "2017-04-10T04:00:00Z",
      "subtitle": "Sierra 10.12",
      "url": "mac-integration-basics-1012"
    },
    {
      "courseLength": 65228,
      "description": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of macOS's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users with essential macOS capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports macOS users, manages networks, or provides technical support for the Mac.",
      "descriptionMD": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of macOS's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users with essential macOS capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports macOS users, manages networks, or provides technical support for the Mac.",
      "hidden": false,
      "name": "Certified Support Professional 10.12",
      "productionEnd": "2017-05-25T04:00:00Z",
      "productionStart": "2017-04-25T04:00:00Z",
      "subtitle": "macOS Support Essentials 10.12",
      "url": "certified-support-professional-1012"
    },
    {
      "courseLength": 80864,
      "description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-410 Installing and Configuring Windows Server 2012 exam covers topics like how to install Windows server 2012, how to add roles to it so that your server can perform customized functions and other areas that will help the viewer to ensure their computing environment is functional and stable.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSA Windows Server 2012 - 70-410",
      "productionEnd": "2015-07-31T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Installing and Configuring Windows Server 2012",
      "url": "mcsa-windows-server-2012-reshoot"
    },
    {
      "courseLength": 72852,
      "description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-412 Configuring Advanced Windows Server 2012 Services exam covers advanced configurations, Active Directory Federated Services and other areas that will help in your pursuit of the MCSA and also help in an after pursuit of the MCSE certification.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSA Windows Server 2012 - 70-412",
      "productionEnd": "2014-07-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Configuring Advanced Windows Server 2012 Services",
      "url": "mcsa-windows-server-2014"
    },
    {
      "courseLength": 21262,
      "description": "The Microsoft Word 2016 show helps a viewer to have a fundamental understanding of the Word 2016 environment and the ability to complete tasks independently.  The show demonstrates the correct application of the principal features of Word 2016.  Viewing all the episodes should help viewers to create and edit basic documents  for a variety of purposes and situations.  This should help someone who might be a student, clerical worker, IT support staff as well as someone seeking the Microsoft Office Specialist Certification.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Word 2016 - Level 1",
      "productionEnd": "2015-12-15T05:00:00Z",
      "productionStart": "2015-12-01T05:00:00Z",
      "subtitle": "Word Processing Application",
      "url": "word-2016"
    },
    {
      "courseLength": 38627,
      "description": "The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
      "descriptionMD": "",
      "hidden": false,
      "name": "ITIL",
      "productionEnd": "2015-03-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Foundation",
      "url": "itil"
    },
    {
      "courseLength": 96478,
      "description": "The Certified Information Systems Security Professional (CISSP) certification is the gold standard in the IT Security field. Security professionals that have achieved their CISSP designation are regarded as some of the most talented and knowledgeable people in their field. The certification is demonstrates that the holder has been working in IT Security for over five years and has a broad range of knowledge in ten domains related to creating, supporting and maintaining a secure IT infrastructure.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Certified Information Systems Security Professional",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "CISSP",
      "url": "certified-information-systems-security-professional"
    },
    {
      "courseLength": 29311,
      "description": "The Microsoft Technology Associate (MTA) is designed to be an entry point into the world of Microsoft certifications, validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-368: MTA Mobility and Devices Fundamentals Exam. One will also focus on desktops, laptops, tablets, cell phones and other devices typically used by an end user because when one first transitions over to IT, one will typically be starting in a role as help desk or desktop support and will need to identify and resolve the issues of such devices. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Mobility and Devices Fundamentals - 98-368",
      "productionEnd": "2015-09-18T04:00:00Z",
      "productionStart": "2015-09-08T04:00:00Z",
      "subtitle": "Mobility and Devices Fundamentals",
      "url": "mta-mobility-devices-fundamentals"
    },
    {
      "courseLength": 118500,
      "description": "*** Updated to reflect changes to the exam effective Jan 2016 *** The Project Management Professional (PMP) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams.",
      "descriptionMD": "Updated to reflect changes to the exam effective Jan 2016. The Project Management Professional (PMP&reg; ) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM&reg;) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams. PMP&reg; and CAPM&reg; are registered trademarks of the Project Management Institute.",
      "hidden": false,
      "name": "Project Management Professional",
      "productionEnd": "2016-02-15T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Project Management Certification",
      "url": "project-management-professional"
    },
    {
      "courseLength": 102258,
      "description": "EC-Council's Certified Ethical Hacker (CEH) certification covers concepts and tools related to exploiting systems, networks, devices and operating platforms. It is designed to get an individual into the world of pen testing to learn techniques of how to test a network or infrastructure. This includes hacking concepts such as vulnerability assessment, network intrusion, reverse engineering, defacing websites, damaging network appliances, launching distributed denial-of-service attacks, massive worm propagation, breaking passwords, brute-forcing authentication systems, cracking encryption, exploiting systems, advance viruses, Trojans, and other malware. This certificate is targeted at site administrators, security professionals, auditors and anyone who is concerned about the integrity of the network infrastructure that has practical real world experience to support this type of equipment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CEH v8",
      "productionEnd": "2015-05-30T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Certified Ethical Hacker",
      "url": "ceh"
    },
    {
      "courseLength": 87197,
      "description": "In the CHFI series, Daniel and Adam will take you through all the concepts, tools, and best-practices you'll need to know for the CHFI exam. You'll be introduced to many different digital forensic techniques and duties like safely copying hard drives, how to perform as a \"First Responder\", searching for and recovering deleted files, steganographic techniques, common attack avenues, acting as an expert witness, and much more.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CHFI v8",
      "productionEnd": "2016-12-16T14:46:13.055Z",
      "productionStart": "2016-12-16T14:46:13.055Z",
      "subtitle": "Computer Hacking Forensic Investigator",
      "url": "chfi-v8"
    },
    {
      "courseLength": 269509,
      "description": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.",
      "descriptionMD": "The _Network+ certification_ was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.  __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
      "hidden": false,
      "name": "Network+",
      "productionEnd": "2016-12-13T18:51:47.697Z",
      "productionStart": "2016-12-13T18:51:47.697Z",
      "subtitle": "Vendor-neutral Networking",
      "url": "network1"
    },
    {
      "courseLength": 150803,
      "description": "This exam has been retired. The Network+ certification was introduced by CompTIA in 1999. It was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining the Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) to provide the learner with a broad, vendor neutral perspective on the topics required to work in the field",
      "descriptionMD": "",
      "hidden": false,
      "name": "Network+",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": null,
      "url": "network"
    },
    {
      "courseLength": 43246,
      "description": "As powerful as cloud computing is for the organization, understanding its information security risks and mitigation strategies is critical. Legacy approaches are inadequate, and organizations need competent, experienced professionals equipped with the right cloud security knowledge and skills to be successful. They need CCSPs.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Certified Cloud Security Professional",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "CCSP",
      "url": "certified-cloud-security-professional"
    },
    {
      "courseLength": 63799,
      "description": "August 20, 2016  is the last day for this exam. Those looking to complete the Cisco Certified Entry Networking Technician (CCENT) certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive it. The CCENT involves networking fundamentals, basic security, wireless concepts and other topics and is designed for entry level IT professionals getting ready for help desk and support type positions. Some of the exam objectives include Operation of IP Data Networks, LAN Switching Technologies, IP Addressing, Network Device Security, troubleshooting and others which provide good foundational knowledge for achieving further related certifications.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCENT",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Cisco Certified Entry Networking Technician",
      "url": "ccent"
    },
    {
      "courseLength": 71087,
      "description": "September 24, 2016 is the last day for this exam. CCNA Overview The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNA Routing and Switching",
      "productionEnd": "2016-09-15T04:00:00Z",
      "productionStart": "2016-08-01T04:00:00Z",
      "subtitle": "Cisco Certified Network Associate",
      "url": "ccna-routing-switching"
    },
    {
      "courseLength": 29646,
      "description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on basic terminology, and concepts like CIA Triad, which is a set of core security principles that can provide as the foundation for security. To gain an MTA certification, you must pass only one MTA exam.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MTA - Security Fundamentals - 98-367",
      "productionEnd": "2015-10-31T04:00:00Z",
      "productionStart": "2015-10-15T04:00:00Z",
      "subtitle": "Security Fundamentals",
      "url": "mta2"
    },
    {
      "courseLength": 60986,
      "description": "Those looking to complete the Cisco Certified Network Associate (CCNA) Security certification will find in this course an overview of the process in achieving the certification and details about the Implementing Cisco IOS Network Security (IINS) exam required to pass in order to receive the certification. CCNA Security addresses how to properly secure Cisco devices and security on Cisco routers and switches and is designed not just for IT professionals, but also for any kind of network administrator that supports Cisco equipment. The exam objectives cover a wide range of topics including common security threats, iOS ACLs, Cisco firewall technologies and others, which can provide foundational knowledge for achieving further related certifications like the CCNP.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CCNA Security 640-554",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Cisco Certified Network Associate Security",
      "url": "ccna-security"
    },
    {
      "courseLength": 55781,
      "description": "Office 365 is a cloud based productivity suite for individuals, companies and even government agencies.  It is designed to deliver software as service to any and every user regardless of location. The Office 365 solution is designed to relieve the technical challenge of software management and delivery, regardless of location from the local IT personnel.  This allows the IT professional to focus in implementing, deploying and operating Office 365 services and administrating supporting technologies, like email, collaboration and storage.  If you’re an IT professional who takes part in evaluating, planning, deploying, and operating the Office 365 services, including its dependencies, requirements, and supporting technologies this series will demonstrate and help you to see what is involved in setting up Office 365 for your organization.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Microsoft Office 365 - 70-346",
      "productionEnd": "2016-01-31T05:00:00Z",
      "productionStart": "2016-01-05T05:00:00Z",
      "subtitle": "Managing Office 365 Identities and Requirements",
      "url": "microsoft-office-365"
    },
    {
      "courseLength": 59667,
      "description": "The VMware Certified Professional certification is the most highly recognized certification dealing specifically with virtualization technologies. VMware vSphere is the leading virtualization technology available today and is in use at most large organizations. The VMware Certified Professional – Data Center Virtualization (VCP5-DCV) certification is tailored towards IT System Administrators who are looking to deploy and maintain VMware vSphere and its associated products (ESXi, VDP, vCOP, VMware Converter, etc) in their environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "VMware Certified Professional 5 VCP5-DCV",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Data Center Virtualization",
      "url": "vmware-certified-professional-5-vcp5dcv"
    },
    {
      "courseLength": 88593,
      "description": "This exam has been retired. CompTIA and the Linux Professional Institute (LPI) have worked in conjunction to create the CompTIA Linux+ certification. The certification covers the basic knowledge required of a junior level Linux administrator. Candidates are expected to be able to work competently across a wide array of environments and skill sets. Unlike many certifications, candidates who complete the Linux+ exams (LX0-101 and LX0-102) are awarded with not one, but two certifications: the CompTIA Linux+ certification and the LPI LPIC-1 certification. That makes this an excellent starting point for people interested in working with Linux as you gain essential base knowledge as well as fill out your resume.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Linux+",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": null,
      "url": "linux-plus"
    },
    {
      "courseLength": 7723,
      "description": "Helping you better understand people's differing communication and decision making styles. Over the past 36 years the Management By Strengths (MBS) program has helped companies increase productivity, improve customer satisfaction and employee morale through an improved understanding of how to work more effectively together.\nUnderstanding the diversity of temperament helps to improve communication and teamwork with both employees and customers. When you understand an individual's temperament you can communicate and motivate both as a team leader or team player.",
      "descriptionMD": "Helping you better understand people's differing communication and decision making styles. Over the past 36 years the Management By Strengths (MBS) program has helped companies increase productivity, improve customer satisfaction and employee morale through an improved understanding of how to work more effectively together.\nUnderstanding the diversity of temperament helps to improve communication and teamwork with both employees and customers. When you understand an individual's temperament you can communicate and motivate both as a team leader or team player.",
      "hidden": false,
      "name": "Management by Strengths",
      "productionEnd": "2017-06-08T04:00:00Z",
      "productionStart": "2017-06-08T04:00:00Z",
      "subtitle": "Management By Strengths Teambuilder / Customer Relationship",
      "url": "managementstrengths"
    },
    {
      "courseLength": 125374,
      "description": "Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows 8 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSA Windows 8.1 - 70-687",
      "productionEnd": "2014-11-30T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Configuring Windows 8.1",
      "url": "mcsa-windows-8"
    },
    {
      "courseLength": 76976,
      "description": "MCSA Windows 8 (70-688) Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows 8 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSA Windows 8.1 - 70-688",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Supporting Windows 8.1",
      "url": "mcsa-windows-9"
    },
    {
      "courseLength": 324004,
      "description": "These exams retire June 2016. The CompTIA A+ certification is one of the oldest and well-known certifications in the IT world. Obtaining the A+ certification demonstrates that you possess the knowledge and skills of someone who has one year of experience working in a help desk or support role. This is a very valuable certification to have on your résumé, especially for someone just getting in to the IT career field with no documented experience.",
      "descriptionMD": "",
      "hidden": false,
      "name": "A+ 800 Series",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "800 series",
      "url": "a"
    },
    {
      "courseLength": 79105,
      "description": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional.",
      "descriptionMD": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
      "hidden": false,
      "name": "Project+",
      "productionEnd": "2016-12-13T18:53:32.104Z",
      "productionStart": "2016-12-13T18:53:32.104Z",
      "subtitle": "Project Management",
      "url": "project"
    },
    {
      "courseLength": 21807,
      "description": "The Google Apps for Work Certified Administrator certification is designed to cover the day-to-day skills required to manage Google Apps in a business environment. Testers are expected to be proficient in managing the cloud-based software suite via the centrally managed web-based portal. Topics covered include user and identity management, access control, data storage management and many others. The typical viewer would be anyone responsible for the deployment and maintenance of Google Apps for Work. ",
      "descriptionMD": "",
      "hidden": false,
      "name": "Google Apps for Work",
      "productionEnd": "2015-01-15T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Certified Administrator",
      "url": "google-apps"
    },
    {
      "courseLength": 51589,
      "description": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Kali Linux",
      "productionEnd": "2015-07-03T04:00:00Z",
      "productionStart": "2015-06-29T04:00:00Z",
      "subtitle": "Configuration of Kali Linux",
      "url": "kali-linux"
    },
    {
      "courseLength": 39822,
      "description": "In this series, Sean and Mike explore several tools that are commonly used for Penetration Testing. They show how the tools work, and explore their functionality. They also demonstrate how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Security Tech Skills",
      "productionEnd": "2015-09-18T04:00:00Z",
      "productionStart": "2015-09-14T04:00:00Z",
      "subtitle": "Commonly used penetration tools",
      "url": "security-tech-skills"
    },
    {
      "courseLength": 95324,
      "description": "The CompTIA Advanced Security Practitioner (CASP) certification designates IT professionals with advanced-level security skills and knowledge. CASP covers the technical knowledge and skills required to conceptualize, design, and engineer secure solutions across complex enterprise environments. CASP is approved by U.S. Dept. of Defense to meet IA technical and management certification requirements.",
      "descriptionMD": "",
      "hidden": false,
      "name": "CompTIA Advanced Security Practitioner",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "CASP",
      "url": "comptia-advanced-security-practitioner"
    },
    {
      "courseLength": 11162,
      "description": "Hyper-V is the advanced virtualization platform created by Microsoft. It is a fully featured Type 1 hypervisor capable of supporting environments ranging from small businesses with a single server to massive datacenters containing thousands of servers. This skills series covers installing, managing and maintaining Hyper-V. ",
      "descriptionMD": "",
      "hidden": false,
      "name": "Microsoft Hyper-V",
      "productionEnd": "2014-06-06T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Microsoft Virtualization",
      "url": "microsoft-hyperv"
    }
  ],
  "tagname": "Legacy",
  "url": "legacy"
}
