{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 31310,
      "description": "Becoming a Linux Power User is a technical skills course designed to elevate viewers to \"Power User\" status. Linux provides a very robust and powerful platform that enables users to achieve great things. Unfortunately, most users only scratch the surface of what Linux is capable of. This series explores some of the more powerful functions hidden away behind the graphical user interface. Topics cover using terminals and shells, managing processes and files, and writing simple shell scripts.",
      "descriptionMD": "Becoming a Linux Power User is a technical skills course designed to elevate viewers to \"Power User\" status. Linux provides a very robust and powerful platform that enables users to acheive great things. Unfortunately, most users only scratch the surface of what Linux is capable of. This series explores some of the more powerful functions hidden away behind the graphical user interface. Topics cover using terminals and shells, managing processes and files, and writing simple shell scripts.",
      "hidden": false,
      "name": "Becoming a Linux Power User",
      "productionEnd": "2017-06-23T23:00:00Z",
      "productionStart": "2017-06-13T04:00:00Z",
      "subtitle": "Becoming a Linux Power User",
      "url": "becominglinux-power-user"
    },
    {
      "courseLength": 43784,
      "description": "The Becoming a Linux Server Administrator covers managing Linux servers in a business environment. Topics covered include installing Linux as a server, managing networking and troubleshooting the OS. Other episodes demonstrate how to configure a web server, a file server, and other common servers. The primary goal of the course is to help system administrators learn to deploy and support the Linux operating system as a server platform.",
      "descriptionMD": "The *Becoming a Linux Server Administrator* covers managing Linux servers in a business environment. Topics covered include installing Linux as a server, managing networking and troubleshooting the OS. Other episodes demonstrate how to configure a web server, a file server, and other common servers. The primary goal of the course is to help system administrators learn to deploy and support the Linux operating system as a server platform.",
      "hidden": false,
      "name": "Becoming a Linux Server Admin",
      "productionEnd": "2017-07-25T04:00:00Z",
      "productionStart": "2017-07-17T04:00:00Z",
      "subtitle": "Becoming a Linux Server Admin",
      "url": "becominglinux-server-admin"
    },
    {
      "courseLength": 39214,
      "description": "The Becoming a Linux System Administrator covers managing Linux systems in a business environment. Topics covered include installing Linux, managing software and using centralized user directories among others. The primary goal of the course is to highlight the differences in managing Linux machines in a business environment versus stand-alone or home systems.",
      "descriptionMD": "The *Becoming a Linux System Administrator* covers managing Linux systems in a business environment. Topics covered include installing Linux, managing software and using centralized user directories among others. The primary goal of the course is to highlight the differences in managing Linux machines in a business environment versus stand-alone or home systems.",
      "hidden": false,
      "name": "Becoming a Linux System Admin",
      "productionEnd": "2017-06-22T04:00:00Z",
      "productionStart": "2017-06-22T04:00:00Z",
      "subtitle": "Becoming a Linux System Admin",
      "url": "becominglinux-admin"
    },
    {
      "courseLength": 7249,
      "description": "Linux for Beginners is a technical skills course designed to introduce new users to the Linux operating system. This course is intended for users who are interested in learning about Linux, but have no previous exposure to the operating system. The series starts with a description of Linux and its history and then moves on to cover the graphical user interface and basic operations of the OS.",
      "descriptionMD": "Linux for Beginners is a technical skills course designed to introduce new users to the Linux operating system. This course is intended for users who are interested in learning about Linux, but have no previous exposure to the operating system. The series starts with a description of Linux and its history and then moves on to cover the graphical user interface and basic operations of the OS.",
      "hidden": false,
      "name": "Linux for Beginners",
      "productionEnd": "2017-06-14T04:00:00Z",
      "productionStart": "2017-06-12T04:00:00Z",
      "subtitle": "Getting started in Linux for new users",
      "url": "linuxbeginners"
    },
    {
      "courseLength": 33155,
      "description": "The Linux Command Line show is designed to introduce viewers to working on Linux based computers using only the command line interface. This is considered the first step in learning BASH scripting as most scripts are made up of a series of CLI commands.",
      "descriptionMD": "The Linux Command Line show is designed to introduce viewers to working on Linux based computers using only the command line interface. This is considered the first step in learning BASH scripting as most scripts are made up of a series of CLI commands.",
      "hidden": false,
      "name": "Linux Command Line",
      "productionEnd": "2017-09-27T04:00:00Z",
      "productionStart": "2017-09-20T04:00:00Z",
      "subtitle": "Getting started in the Linux command line",
      "url": "linux-command-line"
    },
    {
      "courseLength": 19139,
      "description": "The Linux in the Cloud series focuses on implementing the Linux operating system in a virtualized environment. Companies are relying less and less on dedicated hardware and are instead turning to shared hardware to optimize resource utilization and increase deployment flexibility. The hosts demonstrate virtualizing Linux using technologies like KVM and Docker as well as public cloud deployments using Amazon EC2 and Microsoft Azure.",
      "descriptionMD": "The *Linux in the Cloud series* focuses on implementing the Linux operating system in a virtualized environment. Companies are relying less and less on dedicated hardware and are instead turning to shared hardware to optimize resource utilization and increase deployment flexibility. The hosts demonstrate virtualizing Linux using technologies like KVM and Docker as well as public cloud deployments using Amazon EC2 and Microsoft Azure.",
      "hidden": false,
      "name": "Linux in the Cloud",
      "productionEnd": "2017-08-30T04:00:00Z",
      "productionStart": "2017-08-25T04:00:00Z",
      "subtitle": "Configuring Linux in a cloud environment",
      "url": "linuxthe-cloud"
    },
    {
      "courseLength": 38833,
      "description": "The Linux Security Techniques series introduces the viewers to the various security features found in modern Linux distributions. Topics covered include data encryption, auditing access, SELinux and firewall configuration among others. The series also lightly covers penetration testing to ensure that each security technique is implemented properly.",
      "descriptionMD": "The *Linux Security Techniques* series introduces the viewers to the various security features found in modern Linux distributions. Topics covered include data encryption, auditing access, SELinux and firewall configuration among others. The series also *lightly* covers penetration testing to ensure that each security technique is implemented properly.",
      "hidden": false,
      "name": "Linux Security Techniques",
      "productionEnd": "2017-08-22T04:00:00Z",
      "productionStart": "2017-08-14T04:00:00Z",
      "subtitle": "Security features found in modern Linux distributions",
      "url": "linux-security-techniques"
    },
    {
      "courseLength": 31526,
      "description": "In this series, Daniel and Don walk you through the fundamentals of bash scripting in the Linux operating system. Watch here as they take you through the fundamentals like: Script file formats, running scripts, working with variables, performing arithmetic, conditional statements, loops, presenting data, taking user input, and script control.",
      "descriptionMD": "In this series, Daniel and Don walk you through the fundamentals of bash scripting in the Linux operating system. Watch here as they take you through the fundamentals like: Script file formats, running scripts, working with variables, performing arithmetic, conditional statements, loops, presenting data, taking user input, and script control.",
      "hidden": false,
      "name": "Linux Shell Scripting - Basics",
      "productionEnd": "2017-10-10T04:00:00Z",
      "productionStart": "2017-10-02T04:00:00Z",
      "subtitle": "From zero to scripting",
      "url": "linux-shell-scripting-basics"
    },
    {
      "courseLength": 29610,
      "description": "In this series, Daniel and Justin take a look at some of the more advanced scripting practices. Here they will empower your scripts by taking advantage of things like Functions, Libraries, creating graphical elements, sed (Stream EDitor), gawk, and Regular Expression.",
      "descriptionMD": "In this series, Daniel and Justin take a look at some of the more advanced scripting practices. Here they will empower your scripts by taking advantage of things like Functions, Libraries, creating graphical elements, sed (Stream EDitor), gawk, and Regular Expression.",
      "hidden": false,
      "name": "Linux Shell Scripting - Advanced",
      "productionEnd": "2017-10-20T23:00:00Z",
      "productionStart": "2017-10-11T04:00:00Z",
      "subtitle": "Advanced scripting",
      "url": "linux-she-scripting-advanced"
    },
    {
      "courseLength": 59624,
      "description": "This series covers implementing and managing Red Hat Enterprise Linux (RHEL) v7.  RHEL v7 is the leading commercial Linux server software used by corporations around the world.  Topics covered by this series include installation, configuration, troubleshooting, and backup and recovery.  The goal of this series is to prepare any systems administrator to be able to support RHEL v7 in a production environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Red Hat Enterprise Linux",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2016-11-14T05:00:00Z",
      "subtitle": "World's leading enterprise Linux platform",
      "url": "red-hat-linux"
    }
  ],
  "tagname": "Linux",
  "url": "linux"
}
