{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 57612,
      "description": "The Designing and Implementing a Server Infrastructure exam is the first of two exams required to obtain the Microsoft Certified Solutions Expert (MCSE) certification. This exam departs from the traditional pattern of \"how\" to perform tasks and instead focuses on \"why\" these things are done and “why” one would want to make certain decisions like use IPsec instead of PPTP or have four active directory domain controllers instead of one. This course covers topics ranging from server capacity planning and placement to active directory topology design. The typical viewer would be anyone involved in designing network solutions or working in a consulting role.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSE Windows Server 2012 - 70-413",
      "productionEnd": "2014-10-15T04:00:00Z",
      "productionStart": null,
      "subtitle": "Designing and Implementing a Server Infrastructure",
      "url": "mcse-windows-server-2012"
    },
    {
      "courseLength": 98108,
      "description": "The Implementing an Advanced Server Infrastructure exam is the second of two exams required to obtain the Microsoft Certified Solutions Expert (MCSE) certification and shows one knows how to manage and maintain a server infrastructure and implement a data center according to Microsoft’s best practices. This exam moves into significantly more complex topics and configurations than those covered in the previous examinations. The topics covered range from high availability to identity and access solutions. The typical viewer would be anyone operating as a senior systems administrator in a large or enterprise level business and also focuses on.",
      "descriptionMD": "",
      "hidden": false,
      "name": "MCSE Windows Server 2012 - 70-414",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2014-10-27T04:00:00Z",
      "subtitle": "Implementing an Advanced Server Infrastructure",
      "url": "mcse-windows-server-2013"
    },
    {
      "courseLength": 81508,
      "description": "This course describes how to monitor and operate a cloud with Microsoft System Center 2012 R2. It focuses on how to manage and administer a cloud environment, and it describes how you can monitor key infrastructure elements and applications that run within a cloud. This course will help you to acquire the skills required to deploy and configure System Center 2012 R2 for Cloud and Datacenter monitoring. In addition, how to use System Center Virtual Machine Manager, Service Manager, and Operations Manager to coordinate end-to-end service monitoring, and fabric and application monitoring is covered. If you are new to operating a private cloud, or have been managing one and want to update your skills, then this course will show you how.",
      "descriptionMD": "This course describes how to monitor and operate a cloud with Microsoft System Center 2012 R2. It focuses on how to manage and administer a cloud environment, and it describes how you can monitor key infrastructure elements and applications that run within a cloud. This course will help you to acquire the skills required to deploy and configure System Center 2012 R2 for Cloud and Datacenter monitoring. In addition, how to use System Center Virtual Machine Manager, Service Manager, and Operations Manager to coordinate end-to-end service monitoring, and fabric and application monitoring is covered. If you are new to operating a private cloud, or have been managing one and want to update your skills, then this course will show you how.",
      "hidden": false,
      "name": "MCSE Private Cloud - 70-246",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2016-11-28T05:00:00Z",
      "subtitle": "Monitoring and Operating a Private Cloud",
      "url": "mcse-private-cloud-70246"
    },
    {
      "courseLength": 71888,
      "description": "This course describes how to configure and deploy a cloud with Microsoft System Center 2012 R2. It focuses on how to manage and administer a cloud environment, and it describes how you can configure and deploy the  cloud fabric. This course will help you to acquire the skills required to deploy and configure System Center 2012 R2 for Cloud and Datacenter hosting and management. In addition, how to use System Center Virtual Machine Manager, Service Manager, and Operations Manager to coordinate fabric monitoring is covered. If you are new to operating a private cloud, or have been managing one and want to update your skills, then this course will show you how.",
      "descriptionMD": "This course describes how to configure and deploy a cloud with Microsoft System Center 2012 R2. It focuses on how to manage and administer a cloud environment, and it describes how you can configure and deploy the  cloud fabric. This course will help you to acquire the skills required to deploy and configure System Center 2012 R2 for Cloud and Datacenter hosting and management. In addition, how to use System Center Virtual Machine Manager, Service Manager, and Operations Manager to coordinate fabric monitoring is covered. If you are new to operating a private cloud, or have been managing one and want to update your skills, then this course will show you how.",
      "hidden": false,
      "name": "MCSE Private Cloud - 70-247",
      "productionEnd": "2017-05-12T04:00:00Z",
      "productionStart": "2017-05-01T04:00:00Z",
      "subtitle": "Configuring and Deploying a Private Cloud",
      "url": "mcse-private-cloud-70247"
    }
  ],
  "tagname": "MCSE",
  "url": "mcse"
}
