{
  "contentFull": "Explore a wide range of networking skills with ITProTV. Start with the basics like configuring a home router and move into network mapping and trouble shooting.",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 48339,
      "description": "This series explores the practical application of DNS, the Domain Naming System.  We demonstrate using DNS records to support websites, mail servers, and other services.  Other topics addressed include DNS security, replication, and popular server software including BIND and Microsoft Windows DNS.",
      "descriptionMD": "",
      "hidden": false,
      "name": "DNS",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2016-11-07T05:00:00Z",
      "subtitle": "Maintaining the Domain Name System",
      "url": "dns"
    },
    {
      "courseLength": 7236,
      "description": "GNS3 is a free graphical network simulator capable of emulating a number of network devices. This makes it possible for anyone to quickly and easily spin up network hardware for testing and educational purposes without the heavy expense of physical hardware. Supported devices include Cisco routers and firewalls, Juniper routers, and frame-relay switches. ",
      "descriptionMD": "",
      "hidden": false,
      "name": "GNS3",
      "productionEnd": "2014-12-31T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Router emulation software",
      "url": "gns3"
    },
    {
      "courseLength": 2621,
      "description": "In this series Daniel and Wes take a look at how to setup a wireless router in your home network. They talk about some of the considerations when it comes to implementing a wireless network like what standards, utilities, access point placement as well as interference and vendor documentation. They take you through the basic configurations to get your home router up and running.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Home Router Configuration",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Home Router Setup",
      "url": "home-router-configuration"
    },
    {
      "courseLength": 7031,
      "description": "Every technician faces time when the network is not running up to par. We will take a look at different utilities and techniques to identify network  issues like routing delays, DNS issues, DHCP failures and end-to-end communications. We demonstrate some of the utilities that can be used to not only identify but resolve issues that arise on the network.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Network Troubleshooting",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Command Line Tools for Diagnosing Network Issues",
      "url": "network-troubleshooting"
    },
    {
      "courseLength": 25597,
      "description": "In this series we will be covering the use of network mapper utility aptly called Nmap. This series aims to give the viewer a firm grasp of the concepts and applications inherent to Nmap, such as Host Discovery, Port Scanning, Service/OS/Version Detection, and the Nmap Scripting Engine(NSE) for the purposes of security and general network administration.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Nmap",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Network Mapper, a Security Scanner",
      "url": "nmap"
    }
  ],
  "tagname": "Networking Skills",
  "url": "networking-skills"
}
