{
	"id": "56435411aea7150700a3edd4",
	"tagname": "Operations/Project Mgr",
	"contentFull": "",
	"contentShort": "",
	"url": "project-manager",
	"courses": [
		{
			"id": "54c2920ae108051570000016",
			"name": "ITIL",
			"subtitle": "Foundation",
			"description": "The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
			"descriptionMD": "",
			"courseLength": 38627,
			"hidden": false,
			"url": "itil",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2015-03-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000028",
			"name": "Project Management Professional",
			"subtitle": "Project Management Certification",
			"description": "*** Updated to reflect changes to the exam effective Jan 2016 *** The Project Management Professional (PMP) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams.",
			"descriptionMD": "Updated to reflect changes to the exam effective Jan 2016. The Project Management Professional (PMP\u0026reg; ) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM\u0026reg;) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams. PMP\u0026reg; and CAPM\u0026reg; are registered trademarks of the Project Management Institute.",
			"courseLength": 118500,
			"hidden": false,
			"url": "project-management-professional",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2016-02-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55a905f7fd2c330700ddeb47",
			"name": "Microsoft Project 2013 - 74-343",
			"subtitle": "Managing Projects with Microsoft Project 2013",
			"description": "Microsoft Project 2013 is the latest offering by Microsoft into the software realm of PMIS (Project Management Information Systems).  This type of tool is used to help a project manager consolidate the number of tools they may use (e.g.  Calendar systems, email, contacts and some budgeting software and reporting software) into a single software tool for initiating, planning, executing, monitoring and controlling and even closing a project.  Within a single tool, a project manager can manage a project’s triple constraints:  Cost, Scope and Time.  This series covers every exam objective to help a viewer to prepare for the Microsoft exam 74-343 —Managing Projects with Microsoft Project 2013.",
			"descriptionMD": "",
			"courseLength": 34814,
			"hidden": false,
			"url": "microsoft-project-2013",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56428ca1f36b7107002ef28f",
			"name": "Lean Six Sigma - Yellow Belt",
			"subtitle": "Yellow Belt",
			"description": "Those looking to complete the Lean Six Sigma Yellow Belt certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive the certification. The certification is not just for IT professionals, but can be used in any industry and is best suited for those who want to increase their critical thinking skills. Viewers will hear an overview of what Lean Six Sigma (LSS) is, why it is important, how it applies to IT professionals, how it interfaces with other process improvement methodologies, and etc. Learn more about Dr. Terra Stern and Lean Six Sigma by visiting her site www.SSDGlobal.net.",
			"descriptionMD": "",
			"courseLength": 25320,
			"hidden": false,
			"url": "lean-six-sigma2",
			"productionStart": "2015-11-01T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56cc79ed163a7407004685d6",
			"name": "Project+",
			"subtitle": "Project Management",
			"description": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional.",
			"descriptionMD": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"courseLength": 79105,
			"hidden": false,
			"url": "project",
			"productionStart": "2016-12-13T18:53:32.104Z",
			"productionEnd": "2016-12-13T18:53:32.104Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57b330baa0f12c070082067e",
			"name": "Accredited ITIL Foundation",
			"subtitle": "Foundation",
			"description": "** Look for our partner PassionIT Group's information in the Episode Files section of the first episode for curriculum, exam offers Codes for offers are available to members and in the download in the second episode** The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
			"descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com). The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
			"courseLength": 21847,
			"hidden": false,
			"url": "itil-foundation-2016",
			"productionStart": "2017-01-13T18:05:17.298Z",
			"productionEnd": "2017-01-13T18:05:17.298Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5841cfb547a84a0b00ca08fe",
			"name": "Accredited ITIL Intermediate - RCV",
			"subtitle": "Release Control and Validation",
			"description": "The ITIL:Release, Control, \u0026 Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release \u0026 deploy the required service management lifecycle for an organization.",
			"descriptionMD": "The ITIL:Release, Control, \u0026 Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release \u0026 deploy the required service management lifecycle for an organization. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 29485,
			"hidden": false,
			"url": "itil-intermediate",
			"productionStart": "2017-01-23T14:04:08.114Z",
			"productionEnd": "2017-01-23T14:04:08.114Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "584eb5cbd78a9b0b00171627",
			"name": "Lean Six Sigma - Green Belt",
			"subtitle": "Green Belt",
			"description": "The Lean Six Sigma Greenbelt Certification offers many options when it comes to getting certified. This series covers everything you need to know from beginning to end. Cherokee Boose introduces Dr. Terra Vanzant Stern to explain the process and project ideology in detail.",
			"descriptionMD": "",
			"courseLength": 37210,
			"hidden": false,
			"url": "lean-six-sigma3",
			"productionStart": "2016-12-16T15:43:34.407Z",
			"productionEnd": "2016-12-16T15:43:34.407Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5853fb990a9ee11500e4018b",
			"name": "Lean Agile Project Management",
			"subtitle": "Project Management",
			"description": "The Lean and Agile Project Management Certification is a brand new certification to convey a knowledge from a combination of prexisting industry standards. Dr. Terra Vanzant Stern and Cherokee Boose will walk you through this series to cover everything you need to know from beginning to end. You will also be able to access supplemental materials including the ebook from SSDGlobal.net (the same site where you can take the certification exam).  Don't delay because if you are able to certify within a few months from the exam release date you will obtain a lifetime certification not required to obtain Continued Education Credits.",
			"descriptionMD": "The Lean and Agile Project Management Certification is a brand new certification to convey a knowledge from a combination of prexisting industry standards. Dr. Terra Vanzant Stern and Cherokee Boose will walk you through this series to cover everything you need to know from beginning to end. You will also be able to access supplemental materials including the ebook from SSDGlobal.net (the same site where you can take the certification exam).  Don't delay because if you are able to certify within a few months from the exam release date you will obtain a lifetime certification not required to obtain Continued Education Credits.",
			"courseLength": 13985,
			"hidden": false,
			"url": "lean-agile-project-management",
			"productionStart": "2016-12-29T16:23:59.7Z",
			"productionEnd": "2016-12-29T16:23:59.7Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58860d2626e3e51500130144",
			"name": "Accredited ITIL Intermediate - OSA",
			"subtitle": "Operational Support and Analysis",
			"description": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs.",
			"descriptionMD": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 19397,
			"hidden": false,
			"url": "accredited-itil-intermediate-OSA",
			"productionStart": "2017-01-23T14:04:56.388Z",
			"productionEnd": "2017-01-23T14:04:56.388Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58b436375588670b004f35f4",
			"name": "Accredited ITIL Intermediate - SOA",
			"subtitle": "Service Offerings and Agreements",
			"description": "The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA.",
			"descriptionMD": "The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 28397,
			"hidden": false,
			"url": "accredited-itil-intermediate-soa",
			"productionStart": "2017-04-25T04:00:00Z",
			"productionEnd": "2017-04-28T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5911bc99954a010b000529d3",
			"name": "Accredited ITIL Intermediate - PPO",
			"subtitle": "Planning, Protection and Optimization",
			"description": "The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced.",
			"descriptionMD": "The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 25100,
			"hidden": false,
			"url": "itil-pro-planning-protectionoptimization",
			"productionStart": "2017-05-09T04:00:00Z",
			"productionEnd": "2017-05-19T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5936a98df664bd0b0029d1dd",
			"name": "Accredited ITIL Expert - MALC",
			"subtitle": "Managing Across the Lifecycle",
			"description": "The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value.",
			"descriptionMD": "The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 32674,
			"hidden": false,
			"url": "accredited-itil-expert-malc",
			"productionStart": "2017-06-06T04:00:00Z",
			"productionEnd": "2017-06-13T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "593e967d02d9190b0096f411",
			"name": "Accredited ITIL Intermediate - Service Operation",
			"subtitle": "Service Operation",
			"description": "The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them.",
			"descriptionMD": "The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 48432,
			"hidden": false,
			"url": "accredited-itil-intermediate-service-operation",
			"productionStart": "2017-06-12T04:00:00Z",
			"productionEnd": "2017-06-16T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5943d3d71a04600b0050b6f8",
			"name": "Accredited ITIL Intermediate - CSI",
			"subtitle": "Continual Service Improvement",
			"description": "The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors.",
			"descriptionMD": "The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 35010,
			"hidden": false,
			"url": "accredited-itil-intermediate-csi",
			"productionStart": "2017-06-16T04:00:00Z",
			"productionEnd": "2017-06-27T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59552196702fe50b00a0781a",
			"name": "Accredited ITIL Intermediate - Service Strategy",
			"subtitle": "Service Strategy",
			"description": "The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program.",
			"descriptionMD": "The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 44307,
			"hidden": false,
			"url": "accredited-itil-intermediate-service-strategy",
			"productionStart": "2017-06-28T04:00:00Z",
			"productionEnd": "2017-06-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "596cbbbb9770510b004183b4",
			"name": "Accredited ITIL Intermediate - Service Design",
			"subtitle": "Service Design",
			"description": "Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
			"descriptionMD": "Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 58619,
			"hidden": false,
			"url": "accredited-itil-intermediate-service-design",
			"productionStart": "2017-07-19T04:00:00Z",
			"productionEnd": "2017-07-20T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "596dfc30981a690b008415db",
			"name": "Accredited ITIL Intermediate - Service Transition",
			"subtitle": "Service Transition",
			"description": "In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset \u0026 Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
			"descriptionMD": "In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset \u0026 Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"courseLength": 45685,
			"hidden": false,
			"url": "accredited-itil-intermediate-service-transition",
			"productionStart": "2017-07-17T04:00:00Z",
			"productionEnd": "2017-07-19T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5983652e3d51450b0097514b",
			"name": "Accredited ITIL - Practitioner",
			"subtitle": "ITIL Practitioner",
			"description": "ITIL Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
			"descriptionMD": "ITIL Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
			"courseLength": 18136,
			"hidden": false,
			"url": "itil-practitioner",
			"productionStart": "2017-08-02T04:00:00Z",
			"productionEnd": "2017-08-02T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59a075b693c3030b00cb482c",
			"name": "ISO/IEC 20000:2011",
			"subtitle": "Information technology - Service management",
			"description": "ISO/IEC 20000:2011 is the International Standard for IT service management. In this accredited show we explore the requirements for an organization to achieve the ISO/IEC 20000 certification. This show is designed as a 1st step for managers and internal auditors who are considering gaining accreditation for their organization and as an overview for IT staff who’s organization is working towards accreditation. This show will also prepare individuals for the ISO/IEC 20000 examination.",
			"descriptionMD": "ISO/IEC 20000:2011 is the International Standard for IT service management. In this accredited show we explore the requirements for an organization to achieve the ISO/IEC 20000 certification. This show is designed as a 1st step for managers and internal auditors who are considering gaining accreditation for their organization and as an overview for IT staff who’s organization is working towards accreditation. This show will also prepare individuals for the ISO/IEC 20000 examination.",
			"courseLength": 29023,
			"hidden": false,
			"url": "isoiec-200002011",
			"productionStart": "2017-08-23T04:00:00Z",
			"productionEnd": "2017-08-25T04:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}