{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 470,
      "description": "You’ve heard the terms “service management” and “project management”, but do you really understand what they are? In this episode Jo briefly explains the concepts to Justin and they explore the difference between the two.",
      "descriptionMD": "You’ve heard the terms “service management” and “project management”, but do you really understand what they are? In this episode Jo briefly explains the concepts to Justin and they explore the difference between the two.",
      "hidden": false,
      "name": "Project Management VS Service Management",
      "productionEnd": "2018-03-09T05:00:00Z",
      "productionStart": "2018-03-09T05:00:00Z",
      "subtitle": "Project Management VS Service Management",
      "url": "project-management-vs-service-management"
    },
    {
      "courseLength": 21847,
      "description": "** Look for our partner PassionIT Group's information in the Episode Files section of the first episode for curriculum, exam offers Codes for offers are available to members and in the download in the second episode** The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com). The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
      "hidden": false,
      "name": "Accredited ITIL Foundation",
      "productionEnd": "2017-01-13T18:05:17.298Z",
      "productionStart": "2017-01-13T18:05:17.298Z",
      "subtitle": "Foundation",
      "url": "itil-foundation-2016"
    },
    {
      "courseLength": 18136,
      "description": "ITIL Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  Practitioner is a show (and qualification) developed for those IT managers and leaders who are seeking guidance on the implementation of an ITIL based framework and ITIL based processes. It is also directed at managers and leaders who are seeing to make improvements to their current ITIL based structure. In this show we cover topics ranging identifying areas for improvement and ensuring stakeholder engagement through to Organization Change Management; managing the “people” affected by and involved in transformational change. If you’re looking for a starting point to transformational change, then this is the show for you.",
      "hidden": false,
      "name": "Accredited ITIL - Practitioner",
      "productionEnd": "2017-08-02T04:00:00Z",
      "productionStart": "2017-08-02T04:00:00Z",
      "subtitle": "ITIL Practitioner",
      "url": "itil-practitioner"
    },
    {
      "courseLength": 35010,
      "description": "The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Continual Service Improvement module focuses on how organizations and individuals can strategically review the products and services they have produced following the strategy, design, transition and operation stages of the IT Service Lifecycle and offers guidance on how this process should be organized and executed. It also includes guidance on the tools and technology that can be used to support CSI activities as well as how to evaluate risks and critical success factors. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - CSI",
      "productionEnd": "2017-06-27T04:00:00Z",
      "productionStart": "2017-06-16T04:00:00Z",
      "subtitle": "Continual Service Improvement",
      "url": "accredited-itil-intermediate-csi"
    },
    {
      "courseLength": 19397,
      "description": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - OSA",
      "productionEnd": "2017-01-23T14:04:56.388Z",
      "productionStart": "2017-01-23T14:04:56.388Z",
      "subtitle": "Operational Support and Analysis",
      "url": "accredited-itil-intermediate-OSA"
    },
    {
      "courseLength": 25100,
      "description": "The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Planning, Protection and Optimization (PPO) module focuses on the practical application of PPO practices to enable capacity, availability, IT service continuity, information security and demand management. It is designed to develop organizations’ and individuals’ understanding of the ITIL Service Design processes and help ensure that new and updated services, service management systems and tools, technology architecture, processes and measurement systems, methods and metrics are designed to meet user needs and will require little further change once introduced. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - PPO",
      "productionEnd": "2017-05-19T04:00:00Z",
      "productionStart": "2017-05-09T04:00:00Z",
      "subtitle": "Planning, Protection and Optimization",
      "url": "itil-pro-planning-protectionoptimization"
    },
    {
      "courseLength": 29485,
      "description": "The ITIL:Release, Control, & Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release & deploy the required service management lifecycle for an organization.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The ITIL:Release, Control, & Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release & deploy the required service management lifecycle for an organization. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - RCV",
      "productionEnd": "2017-01-23T14:04:08.114Z",
      "productionStart": "2017-01-23T14:04:08.114Z",
      "subtitle": "Release Control and Validation",
      "url": "itil-intermediate"
    },
    {
      "courseLength": 58619,
      "description": "Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** Our Service Design show takes the ideas for new services born in Service Strategy and turns these into a defined blueprint for the development of the services. We look at the operational aspects to designing an IT service, such as Service Level Management, managing suppliers, and planning for service availability and resilience. All of our planning cumulates into a Design Package which we then handover to the Service Transition lifecycle phase. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Design",
      "productionEnd": "2017-07-20T04:00:00Z",
      "productionStart": "2017-07-19T04:00:00Z",
      "subtitle": "Service Design",
      "url": "accredited-itil-intermediate-service-design"
    },
    {
      "courseLength": 48432,
      "description": "The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Operation intermediate module focuses on the principles, processes, operational activities and functions that enable organizations and individuals to successfully manage how their products and services perform. The SO module focuses on the coordination and execution of activities that enable the ongoing management and operation of the products or services developed or implemented during the service strategy, design and transition phases of the IT Service Lifecycle as well as any technology and support resources that are used to deliver them. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Operation",
      "productionEnd": "2017-06-16T04:00:00Z",
      "productionStart": "2017-06-12T04:00:00Z",
      "subtitle": "Service Operation",
      "url": "accredited-itil-intermediate-service-operation"
    },
    {
      "courseLength": 44307,
      "description": "The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Strategy module focuses on the importance of the strategic aspect of services within the IT service lifecycle. It provides the specific knowledge and techniques to help you demonstrate that you understand the risks and success factors and have the skills to develop and progress strategy within an organization or program. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Strategy",
      "productionEnd": "2017-06-30T04:00:00Z",
      "productionStart": "2017-06-28T04:00:00Z",
      "subtitle": "Service Strategy",
      "url": "accredited-itil-intermediate-service-strategy"
    },
    {
      "courseLength": 45685,
      "description": "In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset & Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too!",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** In these episodes we look at the transition of an IT service from a design plan to a live service. We examine closely processes such as Change Management and Release and Deployment Management and we also look at what services are made of in Service Asset & Configuration Management. We look at the concept of early life support and also the value of knowledge in enabling decision making. Like all ITIL shows we also look at critical success factors and key performance indicators and we do some exam prep too! For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - Service Transition",
      "productionEnd": "2017-07-19T04:00:00Z",
      "productionStart": "2017-07-17T04:00:00Z",
      "subtitle": "Service Transition",
      "url": "accredited-itil-intermediate-service-transition"
    },
    {
      "courseLength": 28397,
      "description": "The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The Service Offerings and Agreement series will focus on processes in the Service Strategy and Service Design stages of the ITIL Service Lifecycle.\n \nIt is a Capability Module that prepares for you an examination that earns you 4 credits toward your ITIL Expert credential. Tune in now as Cherokee and Terry Decker you learn ITIL SOA. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Intermediate - SOA",
      "productionEnd": "2017-04-28T04:00:00Z",
      "productionStart": "2017-04-25T04:00:00Z",
      "subtitle": "Service Offerings and Agreements",
      "url": "accredited-itil-intermediate-soa"
    },
    {
      "courseLength": 32674,
      "description": "The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value.",
      "descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode** The intent of the Managing across the Lifecycle (MALC) qualification is to give candidates the skills to support an organization’s service delivery by bridging the service lifecycle stages. The qualification demonstrates that candidates have learned the value of one combined service management practice as opposed to separate subject areas. ITIL processes and practices, as learned from the lifecycle and capability streams of the intermediate certificates, are put into a context of delivering this value. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
      "hidden": false,
      "name": "Accredited ITIL Expert - MALC",
      "productionEnd": "2017-06-13T23:00:00Z",
      "productionStart": "2017-06-06T04:00:00Z",
      "subtitle": "Managing Across the Lifecycle",
      "url": "accredited-itil-expert-malc"
    },
    {
      "courseLength": 2804,
      "description": "ITIL Master is the most prestigious of the ITIL qualifications. In this show Jo outlines the requirements, format, and timescale of the qualification to prepare you for the work ahead.",
      "descriptionMD": "ITIL Master is the most prestigious of the ITIL qualifications. In this show Jo outlines the requirements, format, and timescale of the qualification to prepare you for the work ahead.",
      "hidden": false,
      "name": "How To Become an ITIL Master",
      "productionEnd": "2017-08-25T04:00:00Z",
      "productionStart": "2017-08-25T04:00:00Z",
      "subtitle": "The most prestigious of the ITIL qualifications",
      "url": "itil-master"
    },
    {
      "courseLength": 29023,
      "description": "ISO/IEC 20000:2011 is the International Standard for IT service management. In this accredited show we explore the requirements for an organization to achieve the ISO/IEC 20000 certification. This show is designed as a 1st step for managers and internal auditors who are considering gaining accreditation for their organization and as an overview for IT staff who’s organization is working towards accreditation. This show will also prepare individuals for the ISO/IEC 20000 examination.",
      "descriptionMD": "ISO/IEC 20000:2011 is the International Standard for IT service management. In this accredited show we explore the requirements for an organization to achieve the ISO/IEC 20000 certification. This show is designed as a 1st step for managers and internal auditors who are considering gaining accreditation for their organization and as an overview for IT staff who’s organization is working towards accreditation. This show will also prepare individuals for the ISO/IEC 20000 examination.",
      "hidden": false,
      "name": "Accredited ISO/IEC 20000:2011",
      "productionEnd": "2017-08-25T04:00:00Z",
      "productionStart": "2017-08-23T04:00:00Z",
      "subtitle": "Information technology - Service management",
      "url": "isoiec-200002011"
    },
    {
      "courseLength": 66892,
      "description": "Service Integration and Management (SIAM) is a management methodology for environments where services are sourced from multiple service providers and not just a single service provider. \n\nIn this series we explore the SIAM Eco-system including the business case for SIAM, the benefits of the methodology, the processes involved, and the challenges to implementing and maintaining the eco-system.\n\nThis series also prepares you for the EXIN SIAM Foundation exam.",
      "descriptionMD": "Service Integration and Management (SIAM) is a management methodology for environments where services are sourced from multiple service providers and not just a single service provider. \n\nIn this series we explore the SIAM Eco-system including the business case for SIAM, the benefits of the methodology, the processes involved, and the challenges to implementing and maintaining the eco-system.\n\nThis series also prepares you for the EXIN SIAM Foundation exam.",
      "hidden": false,
      "name": "Accredited SIAM Foundation",
      "productionEnd": "2018-03-28T04:00:00Z",
      "productionStart": "2018-03-19T04:00:00Z",
      "subtitle": "SIAM Foundation",
      "url": "siam-foundation"
    },
    {
      "courseLength": 150053,
      "description": "The PMP® (Project Management Professional) certification from the PMI® (Project Management Institute), updated to the 6th edition of the PMBoK® (Project Management Body of Knowledge) released in 2018. The Project Management Institute a leading certification for individuals working in the project management environment and in the 6th edition of the PMBoK sees the consideration of both Agile and waterfall approaches to project management. The PMP® certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are  well versed in the various tools and techniques used by successful project managers. The qualification is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Don’t despair if you don’t have five years experience as our series will also prepare you for the Certified Associate of Project Management (CAPM®) certification which is available for those just embarking on a career in project management.  PMP® and CAPM® are registered trademarks of the Project Management Institute.",
      "descriptionMD": "The PMP® (Project Management Professional) certification from the PMI® (Project Management Institute), updated to the 6th edition of the PMBoK® (Project Management Body of Knowledge) released in 2018. The Project Management Institute a leading certification for individuals working in the project management environment and in the 6th edition of the PMBoK sees the consideration of both Agile and waterfall approaches to project management. The PMP® certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are  well versed in the various tools and techniques used by successful project managers. The qualification is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Don’t despair if you don’t have five years experience as our series will also prepare you for the Certified Associate of Project Management (CAPM®) certification which is available for those just embarking on a career in project management.  PMP® and CAPM® are registered trademarks of the Project Management Institute.",
      "hidden": false,
      "name": "Project Management Professional 6 (2018)",
      "productionEnd": "2018-06-13T04:00:00Z",
      "productionStart": "2018-06-11T04:00:00Z",
      "subtitle": "PMP",
      "url": "project-management-professional-6-2018"
    },
    {
      "courseLength": 18880,
      "description": "Organisational Change Management is the approach to managing people in a project management environment. \n\nIn this series Jo Peacock investigates the relevance of OCM in the project environment, approaches to OCM, and impacts of under-performing OCM. \n\nThis series will also contribute toward preparation for the PMI certification.",
      "descriptionMD": "Organisational Change Management is the approach to managing people in a project management environment. \n\nIn this series Jo Peacock investigates the relevance of OCM in the project environment, approaches to OCM, and impacts of under-performing OCM. \n\nThis series will also contribute toward preparation for the PMI certification.",
      "hidden": false,
      "name": "PMI: Organizational Change Management",
      "productionEnd": "2018-05-04T04:00:00Z",
      "productionStart": "2018-04-30T04:00:00Z",
      "subtitle": "Implementing tranformational projects",
      "url": "pmi-organizational-change-mangement"
    },
    {
      "courseLength": 50587,
      "description": "In this series we explore the concepts of Prince2® 2017 project management and prepare for the Axelos Prince2® 2017 Foundation examination accredited by PeopleCert.\n\nWe start with a downloadable introduction to the series.",
      "descriptionMD": "In this series we explore the concepts of Prince2® 2017 project management and prepare for the Axelos Prince2® 2017 Foundation examination accredited by PeopleCert.\n\nWe start with a downloadable introduction to the series.",
      "hidden": false,
      "name": "Prince2 2017 Foundation",
      "productionEnd": "2018-05-22T04:00:00Z",
      "productionStart": "2018-05-14T04:00:00Z",
      "subtitle": "Introductory certification to Prince2 2017 project managment",
      "url": "prince2-2017-foundation"
    },
    {
      "courseLength": 25320,
      "description": "Those looking to complete the Lean Six Sigma Yellow Belt certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive the certification. The certification is not just for IT professionals, but can be used in any industry and is best suited for those who want to increase their critical thinking skills. Viewers will hear an overview of what Lean Six Sigma (LSS) is, why it is important, how it applies to IT professionals, how it interfaces with other process improvement methodologies, and etc. Learn more about Dr. Terra Stern and Lean Six Sigma by visiting her site www.SSDGlobal.net.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Lean Six Sigma - Yellow Belt",
      "productionEnd": "2015-11-15T05:00:00Z",
      "productionStart": "2015-11-01T04:00:00Z",
      "subtitle": "Yellow Belt",
      "url": "lean-six-sigma2"
    },
    {
      "courseLength": 37210,
      "description": "The Lean Six Sigma Greenbelt Certification offers many options when it comes to getting certified. This series covers everything you need to know from beginning to end. Cherokee Boose introduces Dr. Terra Vanzant Stern to explain the process and project ideology in detail.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Lean Six Sigma - Green Belt",
      "productionEnd": "2016-12-16T15:43:34.407Z",
      "productionStart": "2016-12-16T15:43:34.407Z",
      "subtitle": "Green Belt",
      "url": "lean-six-sigma3"
    },
    {
      "courseLength": 13985,
      "description": "The Lean and Agile Project Management Certification is a brand new certification to convey a knowledge from a combination of prexisting industry standards. Dr. Terra Vanzant Stern and Cherokee Boose will walk you through this series to cover everything you need to know from beginning to end. You will also be able to access supplemental materials including the ebook from SSDGlobal.net (the same site where you can take the certification exam).  Don't delay because if you are able to certify within a few months from the exam release date you will obtain a lifetime certification not required to obtain Continued Education Credits.",
      "descriptionMD": "The Lean and Agile Project Management Certification is a brand new certification to convey a knowledge from a combination of prexisting industry standards. Dr. Terra Vanzant Stern and Cherokee Boose will walk you through this series to cover everything you need to know from beginning to end. You will also be able to access supplemental materials including the ebook from SSDGlobal.net (the same site where you can take the certification exam).  Don't delay because if you are able to certify within a few months from the exam release date you will obtain a lifetime certification not required to obtain Continued Education Credits.",
      "hidden": false,
      "name": "Lean Agile Project Management",
      "productionEnd": "2016-12-29T16:23:59.7Z",
      "productionStart": "2016-12-29T16:23:59.7Z",
      "subtitle": "Project Management",
      "url": "lean-agile-project-management"
    },
    {
      "courseLength": 39724,
      "description": "In this series we explore the concepts of Agile project management and prepare for the Agile Foundation examination accredited by BCS.\n\nWe start with a downloadable introduction to the services which outlines the contents of the syllabus.",
      "descriptionMD": "In this series we explore the concepts of Agile project management and prepare for the Agile Foundation examination accredited by BCS.\n\nWe start with a downloadable introduction to the services which outlines the contents of the syllabus.",
      "hidden": false,
      "name": "Agile Project Management Concepts",
      "productionEnd": "2018-02-13T05:00:00Z",
      "productionStart": "2018-02-12T05:00:00Z",
      "subtitle": "Agile Foundation",
      "url": "agile-foundation"
    },
    {
      "courseLength": 16905,
      "description": "In this series Jo and Cherokee look at the specific responsibilities and common activities of the Product Owner role in an Agile project.\n\nCheck out our overview for full content details.",
      "descriptionMD": "In this series Jo and Cherokee look at the specific responsibilities and common activities of the Product Owner role in an Agile project.\n\nCheck out our overview for full content details.",
      "hidden": false,
      "name": "Agile Roles - Product Owner",
      "productionEnd": "2018-03-09T05:00:00Z",
      "productionStart": "2018-03-07T05:00:00Z",
      "subtitle": "Agile Project Management",
      "url": "agile-roles-product-owner"
    },
    {
      "courseLength": 11778,
      "description": "In this series we explore the concepts of Agile project management testing, the techniques, and the roles and responsibilities associated with Agile testing. Throughout the episodes we recap over Agile basics and journey through testing quadrants, categories, and timing.  \nAll accompanying course materials are downloadable and also provide suggestions for testing environments.",
      "descriptionMD": "In this series we explore the concepts of Agile project management testing, the techniques, and the roles and responsibilities associated with Agile testing. Throughout the episodes we recap over Agile basics and journey through testing quadrants, categories, and timing.  \nAll accompanying course materials are downloadable and also provide suggestions for testing environments.",
      "hidden": false,
      "name": "Agile Testing",
      "productionEnd": "2018-03-07T05:00:00Z",
      "productionStart": "2018-03-05T05:00:00Z",
      "subtitle": "Agile Project Management",
      "url": "agile-testing"
    },
    {
      "courseLength": 34814,
      "description": "Microsoft Project 2013 is the latest offering by Microsoft into the software realm of PMIS (Project Management Information Systems).  This type of tool is used to help a project manager consolidate the number of tools they may use (e.g.  Calendar systems, email, contacts and some budgeting software and reporting software) into a single software tool for initiating, planning, executing, monitoring and controlling and even closing a project.  Within a single tool, a project manager can manage a project’s triple constraints:  Cost, Scope and Time.  This series covers every exam objective to help a viewer to prepare for the Microsoft exam 74-343 —Managing Projects with Microsoft Project 2013.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Microsoft Project 2013 - 74-343",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Managing Projects with Microsoft Project 2013",
      "url": "microsoft-project-2013"
    }
  ],
  "tagname": "Operations/Project Mgr",
  "url": "project-manager"
}
