{
  "contentFull": "",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 39508,
      "description": "This series is for anyone wanting a better understanding of the common malware types and related concepts needed to make informed decisions on which antivirus is right for their environment. We look at the consumer class antivirus software, some of the major components inside it and demonstrate some of the common antivirus software one might encounter in a home network or small home business. We will also venture into antivirus software that scales to large businesses via enterprise-class software. This series will help a technician or newcomer understand why they might need anti-malware and antivirus solutions and the difference between consumer class and enterprise class antivirus software.",
      "descriptionMD": "",
      "hidden": false,
      "name": "AntiVirus / AntiMalware",
      "productionEnd": "2015-11-30T05:00:00Z",
      "productionStart": "2015-11-15T05:00:00Z",
      "subtitle": "Detection and solutions",
      "url": "antivirus-antimalware"
    },
    {
      "courseLength": 44115,
      "description": "These episodes are designed to demystify the world of cryptography. One will hear about the different aspects of cryptography, associated terminology, different types of cryptography, applications to it and other topics ranging from the history of cryptography, to high-level concepts like ciphers and key exchanges. Discover practical applications of cryptography and how it is applied to various areas in the field of security.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Cryptography",
      "productionEnd": "2015-05-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "An in-depth look into cryptography concepts",
      "url": "cryptography"
    },
    {
      "courseLength": 56748,
      "description": "Created by Logical Operations, the CyberSec First Responder certification, which is DoD Directive 8570 compliant, will prepare security professionals to become the first responders in their organization. You will learn how to defend against cyber-attacks, analyze threats, design secure computing and network environments, proactively defend networks, and respond/investigate to cybersecurity incidents.",
      "descriptionMD": "Created by [Logical Operations](http://logicaloperations.com/itprotv-cfr/), the CyberSec First Responder certification, which is DoD Directive 8570 compliant, will prepare security professionals to become the first responders in their organization. You will learn how to defend against cyber-attacks, analyze threats, design secure computing and network environments, proactively defend networks, and respond/investigate to cybersecurity incidents.",
      "hidden": false,
      "name": "CyberSec First Responder",
      "productionEnd": "2017-01-13T16:40:40.473Z",
      "productionStart": "2017-01-13T16:40:40.473Z",
      "subtitle": "Logical Operations",
      "url": "cybersecurityresponder"
    },
    {
      "courseLength": 40917,
      "description": "CyberPatriot is an amazing free program. It is a  National Youth Cyber Education Program with emphasis on the national competition. In this course you will be introduced to the program, competition and basic skills needed to compete. This course should be used as a supplement to tools provided by your Coach, Technical Mentor, and resources covered in these videos. There are a great deal resources available to prepare you. Please take advantage of them.",
      "descriptionMD": "CyberPatriot is an amazing free program. It is a  National Youth Cyber Education Program with emphasis on the national competition. In this course you will be introduced to the program, competition and basic skills needed to compete. This course should be used as a supplement to tools provided by your Coach, Technical Mentor, and resources covered in these videos. There are a great deal resources available to prepare you. Please take advantage of them.For registration and more information please visit [their website.](https://www.uscyberpatriot.org/)",
      "hidden": false,
      "name": "CyberPatriot",
      "productionEnd": "2016-11-20T00:00:00Z",
      "productionStart": "2016-11-14T05:00:00Z",
      "subtitle": "National Youth Cyber Education Program",
      "url": "cyberpatriot"
    },
    {
      "courseLength": 107180,
      "description": "Digital Forensic Investigator guides you through the process of performing a forensic investigation and is for someone who is going to be doing corporate or criminal investigations that may include collecting, preserving and analyzing evidence and getting it ready to be presented in court. Viewers will learn the steps involved in performing an investigation, from securing the crime scene, to collecting and processing the evidence, and reporting the findings and hear about some of the certifications one can achieve to prove their knowledge in this area, which is important knowledge for all IT security personnel, giving you the knowledge needed to respond properly in the event of a security incident.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Digital Forensic Investigator",
      "productionEnd": "2015-05-15T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Information retrieval and protection",
      "url": "digital-forensic-investigator"
    },
    {
      "courseLength": 3745,
      "description": "Malware is ever present in today’s computing systems whether home, office or enterprise and its important to be prepared. We will explore the world of malware elimination and take a look at various technologies to help quarantine, remediation and eliminate with common techniques.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Eliminating Malware",
      "productionEnd": "2016-03-18T04:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "Tools and Techniques for Malware Removal/Prevention",
      "url": "eliminating-malware"
    },
    {
      "courseLength": 2666,
      "description": "This video series examines using encrypted email communications. Many email servers store and transmit emails in a non-secure manner. This series covers how to use OpenPGP to encrypt email prior to sending it which provides for end-to-end encryption. This is a critical component in guaranteeing the confidentiality of any email communication.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Email Encryption",
      "productionEnd": "2014-12-31T05:00:00Z",
      "productionStart": "1970-01-01T00:00:00Z",
      "subtitle": "with OpenPGP",
      "url": "email-encryption"
    },
    {
      "courseLength": 11071,
      "description": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "descriptionMD": "This is a non-technical course designed for every end user.  Our experts explain very common security topics that are critical to be aware of in today’s work environment, but explains in the “end-users” non-technical language, so everyone can understand.  Many stories are told as examples for easier understanding.  One might think this is super easy and doesn’t go deep on topics, but you would be wrong, this course is a perfect fit for everyone to understand and prevent security risk.  This course is also a living course, which means we will continue to add episodes as new security topics, subject, stories appear, so continue to check back and see what new items have shown up.  Enjoy",
      "hidden": false,
      "name": "End User Security Awareness",
      "productionEnd": "1970-01-01T00:00:00Z",
      "productionStart": "2017-04-24T04:00:00Z",
      "subtitle": "Best Security Practices for the End User",
      "url": "user-security-awareness"
    },
    {
      "courseLength": 30670,
      "description": "In April of 2016, the European Commission published a data protection package to reform, modernize and harmonize European data protection law. The cornerstone of the package is the General Data Protection Regulation (GDPR) which will replace the 1995 Data Protection Directive and, in the UK, the Data Protection Act 1998. This overview highlights the key themes of the General Data Protection Regulation (GDPR) to help organizations understand the new legal framework in the EU. It is for those who have day-to-day responsibility for data protection.",
      "descriptionMD": "In April of 2016, the European Commission published a data protection package to reform, modernize and harmonize European data protection law. The cornerstone of the package is the General Data Protection Regulation (GDPR) which will replace the 1995 Data Protection Directive and, in the UK, the Data Protection Act 1998. This overview highlights the key themes of the General Data Protection Regulation (GDPR) to help organizations understand the new legal framework in the EU. It is for those who have day-to-day responsibility for data protection.",
      "hidden": false,
      "name": "General Data Protection Regulation (GDPR)",
      "productionEnd": "2017-11-03T04:00:00Z",
      "productionStart": "2017-11-01T04:00:00Z",
      "subtitle": "EU regulation on protecting personal data",
      "url": "data-protection-regulation-gdpr"
    },
    {
      "courseLength": 50073,
      "description": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
      "descriptionMD": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
      "hidden": false,
      "name": "Kali Linux (2017)",
      "productionEnd": "2017-06-30T04:00:00Z",
      "productionStart": "2017-06-20T04:00:00Z",
      "subtitle": "Configuration of Kali Linux",
      "url": "kali-linux-2017"
    },
    {
      "courseLength": 43041,
      "description": "Metasploit is a popular penetration testing software, which is represented as a suite of tools, which can go through the whole penetration testing process. Whether using Windows or Linux, Metasploit can be a powerful tool to test network security and is positioned as something that network administrators, penetration testers and even developers could use, which can make it a valuable addition to one’s security toolkit.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Metasploit",
      "productionEnd": "2015-07-10T04:00:00Z",
      "productionStart": "2015-07-06T04:00:00Z",
      "subtitle": "Configuration of Metasploit",
      "url": "metasploit"
    },
    {
      "courseLength": 12079,
      "description": "This series examines the challenges companies face while supporting a bring your own device (BYOD) model. Each episode explores a potential mobile vulnerability and then explores methods to mitigate attacks exploiting that vulnerability. The series uses a hands-on approach actually demonstrating how each compromise works to help better inform systems administrators as to how these compromises occur.",
      "descriptionMD": "This series examines the challenges companies face while supporting a bring your own device (BYOD) model. Each episode explores a potential mobile vulnerability and then explores methods to mitigate attacks exploiting that vulnerability. The series uses a hands-on approach actually demonstrating how each compromise works to help better inform systems administrators as to how these compromises occur.",
      "hidden": false,
      "name": "Mobile Security",
      "productionEnd": "2017-04-07T04:00:00Z",
      "productionStart": "2017-03-29T04:00:00Z",
      "subtitle": "Mobile device risks and mitigation",
      "url": "mobile-security"
    },
    {
      "courseLength": 33546,
      "description": "In this series, Daniel and Mike discuss, explain, and demonstrate some of the common tools and techniques used by Penetrations Testers during a security audit. Watch as they explore topics like hacking platforms and test environments, creating BIND/REVERSE shells, discovering and exploiting Buffer Overflows, Cross Site Scripting attacks, Local and Remote File Inclusion attacks, SQL-Injection, Password attacks, Privilege Escalation, and Port Redirection.",
      "descriptionMD": "In this series, Daniel and Mike discuss, explain, and demonstrate some of the common tools and techniques used by Penetrations Testers during a security audit. Watch as they explore topics like hacking platforms and test environments, creating BIND/REVERSE shells, discovering and exploiting Buffer Overflows, Cross Site Scripting attacks, Local and Remote File Inclusion attacks, SQL-Injection, Password attacks, Privilege Escalation, and Port Redirection.",
      "hidden": false,
      "name": "Penetration Testing",
      "productionEnd": "2017-01-30T05:00:00Z",
      "productionStart": "2017-01-30T05:00:00Z",
      "subtitle": "Tools and techniques for verifying security integrity",
      "url": "penetration-testing"
    },
    {
      "courseLength": 13297,
      "description": "Virtualization plays a big role in putting pen testing tools into practice. One will hear from this course how a professional pen tester sets up a lab in a safe environment, so one can test things like Kali Linux and Metasploit. One will also see demonstrations of several reconnaissance tools, like Ghost Phisher, Sparta and BeEF as well as hear discussions on footprinting.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Pentesting Tools",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "Tools for the Pentester",
      "url": "pentesting-tools"
    },
    {
      "courseLength": 37514,
      "description": "pfSense is a popular open source firewall solution that has many of the same features as some of the enterprise security appliances offered by many of the leading security appliance vendors.  It’s full feature set is provided free of charge.  This series was designed to introduce to our viewers the pfSense solution, demonstrate many of its features and provide some of the most essential configuration guidance to someone desiring to get pfSense working in their environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "pfSense",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "pfSense Build 2.2.2",
      "url": "pfsense"
    },
    {
      "courseLength": 43370,
      "description": "The pfSense show is presented to help users to become familiar and proficient at deploying the free network firewall.  This free solution provides the features found in most commercial firewalls and even some features not found in some of them.  It is completely scalable only limited by the hardware you provide.  To make for easier management and configuration, a full featured and intuitive web-based configurator is integrated to support all features.  You’ll see that it’s relatively easy to get it functional.  The show also shows how to implement firewall filters, nat rules, network services, VPNs and additional packages.",
      "descriptionMD": "",
      "hidden": false,
      "name": "pfSense (2016)",
      "productionEnd": "2016-12-16T21:38:31.986Z",
      "productionStart": "2016-12-16T21:38:31.986Z",
      "subtitle": "pfSense build 2.3.2",
      "url": "pfsense-2016"
    },
    {
      "courseLength": 62194,
      "description": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
      "descriptionMD": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
      "hidden": false,
      "name": "Practical IT Security",
      "productionEnd": "2017-11-16T05:00:00Z",
      "productionStart": "2017-11-14T05:00:00Z",
      "subtitle": "Hands-On answers to security questions",
      "url": "practicalsecurity"
    },
    {
      "courseLength": 17914,
      "description": "In this series, Mike explores several tools that are commonly used for Penetration Testing. He shows how the tools work, and explore their functionality. He also demonstrates how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
      "descriptionMD": "In this series, Mike explores several tools that are commonly used for Penetration Testing. He shows how the tools work, and explore their functionality. He also demonstrates how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
      "hidden": false,
      "name": "Security Tech Skills (2017)",
      "productionEnd": "2017-07-05T04:00:00Z",
      "productionStart": "2017-06-19T04:00:00Z",
      "subtitle": "Commonly used penetration tools",
      "url": "security-tech-skills-2017"
    },
    {
      "courseLength": 28647,
      "description": "In this series, Daniel and Tom take you through the \"DNA\" of Social Engineering. They will look into the history of Social Engineering to see where it began and how it has evolved. They will also discuss the tactics, concepts, and tools used by Social Engineers to elicit information from their targets. They also dive into the psychological component of both the attackers as well as the targets and point to documented examples for illustrative purposes.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Social Engineering",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "The art of hacking humans",
      "url": "social-engineering"
    },
    {
      "courseLength": 1997,
      "description": "The Working with SSH show aims to remove the intimidation of using the Secure Shell protocol on your network. SSH allows for encrypting network communications to protect from eavesdropping and man-in-the-middle attacks. This series demonstrates how to configure and use SSH to securely manage your systems.",
      "descriptionMD": "",
      "hidden": false,
      "name": "Working with SSH",
      "productionEnd": null,
      "productionStart": null,
      "subtitle": "SSH Tools and Tips",
      "url": "ssh"
    }
  ],
  "tagname": "Security Skills",
  "url": "security-skills"
}
