{
	"id": "55df17e29b5b2d0700065db6",
	"tagname": "Sys Admin",
	"contentFull": "",
	"contentShort": "",
	"url": "systems-admin",
	"courses": [
		{
			"id": "54c2920ae10805157000000e",
			"name": "Citrix XenServer 6.2",
			"subtitle": "Open-Source Virtualization",
			"description": "Citrix XenServer is the free virtualization software from Citrix. It is a commercially backed implementation of the open source Xen virtualization platform. The low cost of entry makes XenServer an attractive option for small and medium businesses looking for advanced hypervisor functions (clustering, live migration, centralized management) without the large price tag associated with competing products. ",
			"descriptionMD": "",
			"courseLength": 17407,
			"hidden": false,
			"url": "citrix-xenserver",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2014-07-10T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000015",
			"name": "Certified Support Professional 10.10",
			"subtitle": "OS X Support Essentials 10.10",
			"description": "Those looking to complete the Apple Certified Support Professional (ACSP) certification will find in this course an overview of the process involved in achieving the certification and details about the exam required to pass in order to receive the certification. The certification is designed for technicians working in business environments supporting Apple computers and confirms one understands OS X's core functionality. Viewers will learn in this course tactics like basic installation and configuration of OS X Yosemite, managing user accounts, file systems used by Mac OS, enforcing policy across a network, data management, applications and processes, network configurations, and system management and security.",
			"descriptionMD": "",
			"courseLength": 78188,
			"hidden": false,
			"url": "certified-support-professional",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-02-28T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000017",
			"name": "MCSA Windows 7 - 70-680",
			"subtitle": "Windows 7, Configuring",
			"description": "Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate (MCSA) is one of the first steps for those seeking to start a technical career. The MCSA: Windows 7 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 62889,
			"hidden": false,
			"url": "mcsa-windows-7",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-05-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000018",
			"name": "MCSA Windows 8.1 - 70-687",
			"subtitle": "Configuring Windows 8.1",
			"description": "Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows 8 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 125374,
			"hidden": false,
			"url": "mcsa-windows-8",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2014-11-30T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000019",
			"name": "MCSA Windows 8.1 - 70-688",
			"subtitle": "Supporting Windows 8.1",
			"description": "MCSA Windows 8 (70-688) Over 80% of computers run Microsoft Operating systems [reference]. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows 8 covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops in a corporate or enterprise environment. Most people know how to use Windows in a home environment. However, there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives in to those and gives the learner a whole new toolbox for ensuring their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 76976,
			"hidden": false,
			"url": "mcsa-windows-9",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000001d",
			"name": "MCSA Windows Server 2012 - 70-411",
			"subtitle": "Administering Windows Server 2012",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-411 Administering Windows Server 2012 exam covers administering Windows services, keeping them operational, advanced functionality and other areas that will help in your pursuit of the MCSA and also help in an after pursuit of the MCSE certification.",
			"descriptionMD": "",
			"courseLength": 80394,
			"hidden": false,
			"url": "mcsa-windows-server-2013",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-09-01T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000001e",
			"name": "MCSA Windows Server 2012 - 70-412",
			"subtitle": "Configuring Advanced Windows Server 2012 Services",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-412 Configuring Advanced Windows Server 2012 Services exam covers advanced configurations, Active Directory Federated Services and other areas that will help in your pursuit of the MCSA and also help in an after pursuit of the MCSE certification.",
			"descriptionMD": "",
			"courseLength": 72852,
			"hidden": false,
			"url": "mcsa-windows-server-2014",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2014-07-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000001f",
			"name": "MCSE Windows Server 2012 - 70-413",
			"subtitle": "Designing and Implementing a Server Infrastructure",
			"description": "The Designing and Implementing a Server Infrastructure exam is the first of two exams required to obtain the Microsoft Certified Solutions Expert (MCSE) certification. This exam departs from the traditional pattern of \"how\" to perform tasks and instead focuses on \"why\" these things are done and “why” one would want to make certain decisions like use IPsec instead of PPTP or have four active directory domain controllers instead of one. This course covers topics ranging from server capacity planning and placement to active directory topology design. The typical viewer would be anyone involved in designing network solutions or working in a consulting role.",
			"descriptionMD": "",
			"courseLength": 57612,
			"hidden": false,
			"url": "mcse-windows-server-2012",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-10-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000020",
			"name": "MCSE Windows Server 2012 - 70-414",
			"subtitle": "Implementing an Advanced Server Infrastructure",
			"description": "The Implementing an Advanced Server Infrastructure exam is the second of two exams required to obtain the Microsoft Certified Solutions Expert (MCSE) certification and shows one knows how to manage and maintain a server infrastructure and implement a data center according to Microsoft’s best practices. This exam moves into significantly more complex topics and configurations than those covered in the previous examinations. The topics covered range from high availability to identity and access solutions. The typical viewer would be anyone operating as a senior systems administrator in a large or enterprise level business and also focuses on.",
			"descriptionMD": "",
			"courseLength": 98108,
			"hidden": false,
			"url": "mcse-windows-server-2013",
			"productionStart": "2014-10-27T04:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000021",
			"name": "Microsoft SQL Server 2012 - 70-462",
			"subtitle": "Administering Microsoft SQL Server 2012 Databases",
			"description": "The Administering Microsoft SQL Server 2012 Databases exam is designed to be the entry point for Systems Administrators into the world of databases. The course focuses on areas that are required knowledge for anyone responsible for the creation and maintenance of Windows servers running Microsoft SQL 2012. The topics covered range from installing SQL Server to backing up and restoring databases.",
			"descriptionMD": "",
			"courseLength": 52740,
			"hidden": false,
			"url": "microsoft-sql-server-2012",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-09-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002b",
			"name": "Microsoft Hyper-V",
			"subtitle": "Microsoft Virtualization",
			"description": "Hyper-V is the advanced virtualization platform created by Microsoft. It is a fully featured Type 1 hypervisor capable of supporting environments ranging from small businesses with a single server to massive datacenters containing thousands of servers. This skills series covers installing, managing and maintaining Hyper-V. ",
			"descriptionMD": "",
			"courseLength": 11162,
			"hidden": false,
			"url": "microsoft-hyperv",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-06-06T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002e",
			"name": "Google Apps for Work",
			"subtitle": "Certified Administrator",
			"description": "The Google Apps for Work Certified Administrator certification is designed to cover the day-to-day skills required to manage Google Apps in a business environment. Testers are expected to be proficient in managing the cloud-based software suite via the centrally managed web-based portal. Topics covered include user and identity management, access control, data storage management and many others. The typical viewer would be anyone responsible for the deployment and maintenance of Google Apps for Work. ",
			"descriptionMD": "",
			"courseLength": 21807,
			"hidden": false,
			"url": "google-apps",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2015-01-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002f",
			"name": "Amazon Web Services",
			"subtitle": "Web Services",
			"description": "Amazon Web Services (AWS) is a collection of cloud-based services offered by Amazon.com, which provides access to hosted resources. The services range from hosted virtual servers and storage to DNS and Database hosting. AWS gives the chance for private companies to take advantage of the investment in infrastructure that Amazon has made including massive generators, their five different internet service providers and data centers. This series of videos is designed to introduce the viewer to some of the AWS products and demonstrate the basic skills required to deploy and maintain them.",
			"descriptionMD": "",
			"courseLength": 23544,
			"hidden": false,
			"url": "amazon-web-services",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-10-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000030",
			"name": "PowerShell",
			"subtitle": "for Administrators",
			"description": "The Microsoft PowerShell is a secondary command line interface found in most Microsoft operating systems. The purpose of the PowerShell is to provide a much more feature rich scripting and automation environment than was previously possible in the base command shell. This series introduces the viewer to the PowerShell and its basic functions. It then moves in to specific areas like managing DNS, DHCP and Active Directory along with their typical commands. ",
			"descriptionMD": "",
			"courseLength": 45533,
			"hidden": false,
			"url": "powershell",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "550195b0947d9007002fe547",
			"name": "Certified Technical Coordinator 10.10",
			"subtitle": "OS X Server Essentials 10.10",
			"description": "The Apple Certified Technical Coordinator certification is designed for anyone responsible for managing Apple computers and devices in a business environment. The exam is made up of content from the Support Essentials ACSP course, as well as content from the Server Essentials course which is covered in this show. Technologies covered include topics like network deployment, policy management, troubleshooting and using Open Directory for centralized user management.",
			"descriptionMD": "",
			"courseLength": 68118,
			"hidden": false,
			"url": "certified-technical-coordinator",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-05-01T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "558b13458a7ab80700be8cb8",
			"name": "Supporting Windows 7",
			"subtitle": "Configuring and maintaining Windows 7",
			"description": "Windows 7 is still a viable option out in the IT world and is one of the most commonly used desktop operating systems today. This series covers routine administrative tasks that any Desktop Support Technician or Help Desk Technician would be expected to handle on a regular basis including installation and deployment, managing and maintaining, and operational issues one may encounter supporting Windows 7 as an enterprise level technician.",
			"descriptionMD": "",
			"courseLength": 48447,
			"hidden": false,
			"url": "supporting-windows-7",
			"productionStart": "2015-09-12T04:00:00Z",
			"productionEnd": "2015-09-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5595a25086d76e1f00e0689e",
			"name": "Cisco ASA Firewalls",
			"subtitle": "Configuration of Cisco ASA Firewalls",
			"description": "The Cisco ASA (Adaptive Security Appliance) is one of the most implemented security solutions found in enterprise networks.  Cisco offers an entire series of firewalls that range from small office solutions to very large enterprise solutions. It is because of its commonality that in many businesses an IT Professional would do well to be familiar with the product and some of the most essential configurations.  This series is designed to help an IT Professional to see how to configure many of the features in the ASA through the GUI interface, the ASDM.  This will provide an introduction to the appliance and guidance on some of most used features for any environment.",
			"descriptionMD": "",
			"courseLength": 13020,
			"hidden": false,
			"url": "cisco-asa-firewalls",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-07-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55a905f7fd2c330700ddeb47",
			"name": "Microsoft Project 2013 - 74-343",
			"subtitle": "Managing Projects with Microsoft Project 2013",
			"description": "Microsoft Project 2013 is the latest offering by Microsoft into the software realm of PMIS (Project Management Information Systems).  This type of tool is used to help a project manager consolidate the number of tools they may use (e.g.  Calendar systems, email, contacts and some budgeting software and reporting software) into a single software tool for initiating, planning, executing, monitoring and controlling and even closing a project.  Within a single tool, a project manager can manage a project’s triple constraints:  Cost, Scope and Time.  This series covers every exam objective to help a viewer to prepare for the Microsoft exam 74-343 —Managing Projects with Microsoft Project 2013.",
			"descriptionMD": "",
			"courseLength": 34814,
			"hidden": false,
			"url": "microsoft-project-2013",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55a921b928fd48070099b84e",
			"name": "MCSA Windows Server 2012 - 70-410",
			"subtitle": "Installing and Configuring Windows Server 2012",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-410 Installing and Configuring Windows Server 2012 exam covers topics like how to install Windows server 2012, how to add roles to it so that your server can perform customized functions and other areas that will help the viewer to ensure their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 80864,
			"hidden": false,
			"url": "mcsa-windows-server-2012-reshoot",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-07-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55ce291add40b20700997999",
			"name": "Microsoft Exchange 2013 - 70-341",
			"subtitle": "Core Solutions of Microsoft Exchange Server 2013",
			"description": "Microsoft Exchange 2013 is one of the most popular commercially supported email and collaboration platforms in the world. This course helps systems administrators to quickly come up to speed on deploying and supporting each of the various services provided in Exchange. In addition to the real world skills, this course also covers each of the exam objectives required for the Microsoft 70-341 exam which counts toward the MCP and MCSE certifications.",
			"descriptionMD": "",
			"courseLength": 50639,
			"hidden": false,
			"url": "microsoft-exchange-2013",
			"productionStart": "2015-08-10T04:00:00Z",
			"productionEnd": "2015-08-21T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55f7159c723da20700adb4d9",
			"name": "MCSA Windows 10 - 70-697",
			"subtitle": "Configuring Windows Devices",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The 70-697 Configuring Windows Devices exam covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows desktops and other devices in a corporate or enterprise environment. Most people know how to use Windows in a home environment, but there are many features under the hood that are designed for environments with a large quantity of computers. The MCSA dives into those and gives the viewer a whole new toolbox for ensuring their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 75789,
			"hidden": false,
			"url": "mcsa-windows-10",
			"productionStart": "2015-10-15T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "560b381721416f07000ba342",
			"name": "MTA - Server Fundamentals - 98-365",
			"subtitle": "Windows Server Administration Fundamentals",
			"description": "Microsoft Technology Associate (MTA) is an introductory Microsoft certification for individuals considering a career in technology. The Windows Server Administration Fundamentals exam is designed to provide an assessment of knowledge of fundamental server administration concepts. It covers a wide range of topics, such as Windows Server, Windows-based networking, Active Directory, and system recovery. Upon completing the 98-365 exam, you will earn a Microsoft Technology Associate certification, which helps prove your knowledge of fundamental technology concepts. It can also serve as a stepping stone to the Microsoft Certified Technology Specialist exams.",
			"descriptionMD": "",
			"courseLength": 46164,
			"hidden": false,
			"url": "mta-server1",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5627d10e20e07507008aec79",
			"name": "MTA - Security Fundamentals - 98-367",
			"subtitle": "Security Fundamentals",
			"description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on basic terminology, and concepts like CIA Triad, which is a set of core security principles that can provide as the foundation for security. To gain an MTA certification, you must pass only one MTA exam.",
			"descriptionMD": "",
			"courseLength": 29646,
			"hidden": false,
			"url": "mta2",
			"productionStart": "2015-10-15T04:00:00Z",
			"productionEnd": "2015-10-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5642b60dad23fd1700592302",
			"name": "Working with Active Directory",
			"subtitle": "Deploy and maintain Active Directory",
			"description": "Active Directory Domain Services (AD DS) allows you to create a scalable, secure, and manageable infrastructure for user and resource management, and you can provide support for directory-enabled applications. In these episodes, you will learn how to deploy and maintain Active Directory in both traditional networks and cloud-based solutions.",
			"descriptionMD": "",
			"courseLength": 34024,
			"hidden": false,
			"url": "active-directory",
			"productionStart": "2015-11-01T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56438f96dac69e0700ec480f",
			"name": "Bash and Scripting",
			"subtitle": "CLI",
			"description": "Unix and Unix-like operating systems(Linux/BSD), known for their speed and reliability, are becoming an ever increasing presence in many data centers and server closets. That being the case, systems administrators that are new to the command-line driven nature of these systems will need to get up to speed on how to interact with the CLI shell environment found as the default on the majority of those systems. In this series, we introduce you to that shell environment known as the Bourne Again Shell or bash, for short. The series starts with an introduction to the bash environment, showing and explaining to you how to navigate through the system using text-based commands. This includes file system navigation, setting file permissions, manipulating output, etc. Then, building upon that foundation, we show you how to automate repetitive tasks by creating customized scripts. All the main bash scripting abilities are covered; from basic repetitive command execution, to more complex functionality like arithmetic, arrays, conditional statements(if-then/elif/case-esac), program loops(for/while/until), and functions/libraries.",
			"descriptionMD": "",
			"courseLength": 42335,
			"hidden": false,
			"url": "bash-scripting",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-13T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5644a12c6cd4790f0025e593",
			"name": "Working with Group Policy",
			"subtitle": "Group Policy",
			"description": "Group Policy is an infrastructure that allows you to implement specific configurations for users and computers in a centralized manner. In these episodes, you will learn about configuring and maintaining a Group Policy infrastructure. You will also learn how to specify managed configurations for users and computers through Group Policy settings and Group Policy Preferences. Group Policy will allow you to provide the standardized functionality, security, and management control that your organization needs.",
			"descriptionMD": "",
			"courseLength": 31670,
			"hidden": false,
			"url": "policy",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "565df30ce202990700355461",
			"name": "Azure Virtual Machine",
			"subtitle": "Azure VM",
			"description": "The Microsoft Azure Virtual Machine course covers the foundational knowledge you need to implement an Azure Virtual Machine. The course is geared toward system administrators, who currently have systems in Azure or support local servers and want to transition over to Azure. One should expect to learn how to deploy virtual machines into Windows Azure, different configurations of those servers and how to manage them, the process of how to back up and restore a server and other features in Azure that can be used to supplement a virtual machine.",
			"descriptionMD": "",
			"courseLength": 33247,
			"hidden": false,
			"url": "azure-virtual-machine",
			"productionStart": "2015-12-01T05:00:00Z",
			"productionEnd": "2015-12-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5665b11e641a91070021c937",
			"name": "Azure SQL",
			"subtitle": "Relational Database-as-a-Service",
			"description": "This show explores the foundational concepts and workings of Azure SQL. We start by defining why you might decide to implement a hosted database in Azure SQL vs an on-premise solution; detailing some of the benefits of moving to Azure SQL. We then describe some of the more advanced benefits of using Azure SQL like using Resource Groups, Geo-Restore, Point-In-Time Restore, and Self-Service Restore. Finally they take a look at the performance tiers as well as Database Throughput Units or DTUs.",
			"descriptionMD": "",
			"courseLength": 37763,
			"hidden": false,
			"url": "azure-sql",
			"productionStart": "2016-01-15T05:00:00Z",
			"productionEnd": "2016-01-31T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5665b1c3315ef10700283633",
			"name": "Virtualization Technologies",
			"subtitle": "Fundamentals of Virtualization",
			"description": "Virtualization technology is key for everyone working professionally in the IT field. Familiarity with some of the most used Virtualization tools would be valuable to the IT professional. This show reviews basic virtualization technology common to all virtualization tools. Then it takes each of the mentioned tools and dives into getting it started.",
			"descriptionMD": "",
			"courseLength": 42996,
			"hidden": false,
			"url": "virtualization",
			"productionStart": "2015-12-01T05:00:00Z",
			"productionEnd": "2015-12-18T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5692af3afc644b0700102bd2",
			"name": "System Center 2012 Configuration Manager - 70-243",
			"subtitle": "SCCM",
			"description": "A member of the Microsoft System Center suite of management solutions, System Center 2012 R2 Configuration Manager increases IT productivity and efficiency by reducing manual tasks and letting you focus on high-value projects, maximize hardware and software investments, and empower end-user productivity by providing the right software at the right time. Configuration Manager helps you deliver more effective IT services by enabling secure and scalable software deployment, compliance settings management, and comprehensive asset management of servers, desktops, laptops, and mobile devices. In addition, Configuration Manager can integrate with Windows Server Update Services (WSUS), Network Access Protection (NAP), Certificate Services, Exchange Server and Exchange Online, Group Policy, the DNS Server role, Windows Automated Installation Kit (Windows AIK) and the User State Migration Tool (USMT), Windows Deployment Services (WDS), and Remote Desktop and Remote Assistance.",
			"descriptionMD": "",
			"courseLength": 74115,
			"hidden": false,
			"url": "system-center-configuration-manager",
			"productionStart": "2016-01-05T05:00:00Z",
			"productionEnd": "2016-01-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5693d7b5fc644b0700102cf3",
			"name": "Microsoft Office 365 - 70-346",
			"subtitle": "Managing Office 365 Identities and Requirements",
			"description": "Office 365 is a cloud based productivity suite for individuals, companies and even government agencies.  It is designed to deliver software as service to any and every user regardless of location. The Office 365 solution is designed to relieve the technical challenge of software management and delivery, regardless of location from the local IT personnel.  This allows the IT professional to focus in implementing, deploying and operating Office 365 services and administrating supporting technologies, like email, collaboration and storage.  If you’re an IT professional who takes part in evaluating, planning, deploying, and operating the Office 365 services, including its dependencies, requirements, and supporting technologies this series will demonstrate and help you to see what is involved in setting up Office 365 for your organization.",
			"descriptionMD": "",
			"courseLength": 55781,
			"hidden": false,
			"url": "microsoft-office-365",
			"productionStart": "2016-01-05T05:00:00Z",
			"productionEnd": "2016-01-31T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56ba0ae4b01608070008949c",
			"name": "Active Directory in Azure",
			"subtitle": "Cloud based directory and identity management",
			"description": "In this series, we will show you how to extend an on-premises Active Directory to Microsoft Azure. Extending Active Directory in Azure can be used for disaster recovery and supporting branch offices, to name a few. We will start at the beginning, by setting up our on-premises network, including Active Directory, DNS, and Routing and Remote Access. We will use the RRAS server as our VPN endpoint, which we will use to establish a site-to-site VPN tunnel to Azure. Then we will create our virtual network in Azure, including defining subnets, creating a gateway, and provisioning public IP addresses. Then we will create our Azure resources, including a virtual domain controller, storage accounts, and availability sets. Then we will verify that Active Directory is replicating properly. We will demonstrate using three different methods, with the classic portal, with the new portal and with Azure PowerShell.",
			"descriptionMD": "",
			"courseLength": 33681,
			"hidden": false,
			"url": "active-directory-azure",
			"productionStart": "2016-02-15T05:00:00Z",
			"productionEnd": "2016-02-28T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56cc79ed163a7407004685d6",
			"name": "Project+",
			"subtitle": "Project Management",
			"description": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional.",
			"descriptionMD": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"courseLength": 79105,
			"hidden": false,
			"url": "project",
			"productionStart": "2016-12-13T18:53:32.104Z",
			"productionEnd": "2016-12-13T18:53:32.104Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56dde40115c69d0700240cba",
			"name": "Python Programming",
			"subtitle": "Programming Language",
			"description": "In this series, Daniel and Justin walk you through an in-depth primer on the Python programming language. Whether you have some other programming experience or you are completely new to coding, you will be given the tools necessary to get started writing programs with Python. They cover topics like printing output to the screen, assigning and utilizing variables, getting input from the user, decision making, iteration/loops, creating lists, dictionaries, and tuples, using and creating functions, slicing, and more. If you're looking for an easy programming language to get started, or you want to add another language to your repertoire, Python is a great choice.",
			"descriptionMD": "",
			"courseLength": 22748,
			"hidden": false,
			"url": "python-programming",
			"productionStart": "2016-03-05T05:00:00Z",
			"productionEnd": "2016-03-06T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56def7ef0fd6cb0700495b52",
			"name": "MCSA Windows Server 2016 - 70-TBA",
			"subtitle": "Installing and Configuring Windows Server 2012",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA covers topics that will help the learner ensure their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 88843,
			"hidden": true,
			"url": "mcsa-windows-server-2016",
			"productionStart": "2016-02-29T05:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56f5441d0ea86607008b9146",
			"name": "Certified Support Professional 10.11",
			"subtitle": "OS X Support Essentials 10.11",
			"description": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of OS X's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users  with essential OS X capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports OS X users, manages networks, or provides technical support for the Mac.",
			"descriptionMD": "",
			"courseLength": 72604,
			"hidden": false,
			"url": "certified-support-professional-1011",
			"productionStart": "2016-03-28T04:00:00Z",
			"productionEnd": "2016-04-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "570405ae87a6b40f0002a378",
			"name": "VMware Certified Associate 6 VCA6-DCV",
			"subtitle": "Data Center Virtualization",
			"description": "The VCA6 show dives into data center virtualization fundamentals and featuring vSphere 6 as the solution.  It helps the candidate of the VCA6-DCV certification by discussing and demonstrating VMWare’s data center virtualization technology.  The demonstrations and the discussion in each episode go into to identifying the technical requirements for managing the VMWare vSphere 6 environment.  The segments focus on data center challenges and understanding what VMWare products and solutions can be used to meet those requirements.",
			"descriptionMD": "",
			"courseLength": 30111,
			"hidden": false,
			"url": "vmware-certified-associate-6-vca6dcv",
			"productionStart": "2016-04-04T04:00:00Z",
			"productionEnd": "2016-04-20T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "570e505f898a2907007d7824",
			"name": "SharePoint 2016 - 70-339",
			"subtitle": "Planning and Administering SharePoint 2016",
			"description": "This series of videos will provide you with the knowledge and skills to plan and administer a Microsoft SharePoint 2016 environment. You will learn how to deploy, administer, and troubleshoot your SharePoint environment. These videos also provide guidelines, best practices, and considerations that help you optimize your SharePoint deployment.\n\nThis is the first in a sequence of two courses for IT professionals and is aligned with the SharePoint 2016 IT Pro certification.",
			"descriptionMD": "",
			"courseLength": 41339,
			"hidden": false,
			"url": "sharepoint-2016",
			"productionStart": "2016-04-11T04:00:00Z",
			"productionEnd": "2016-04-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "571d6f8ba123530700fe4773",
			"name": "Microsoft Desktop Optimization Pack",
			"subtitle": "MDOP",
			"description": "Technicians and administrators alike need tools to diagnose computer problems, centrally manage encryption and recovery keys, provide consistency in user settings, provide application co-existence and more. These are some of the topics that we will tackle in our series on MDOP.",
			"descriptionMD": "",
			"courseLength": 21188,
			"hidden": false,
			"url": "microsoft-desktop-optimization-pack",
			"productionStart": "2016-04-15T04:00:00Z",
			"productionEnd": "2016-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "571d7468f327610700925278",
			"name": "Microsoft SQL Server 2014 - 70-461",
			"subtitle": "Querying Microsoft SQL Server 2014",
			"description": "The Querying Microsoft SQL Server 2014 show is for those who are seeking to validate their skills and knowledge in writing Transact SQL queries.  The show helps the certification candidate by describing, discussing and demonstrating SQL query writing skills in multiple areas. The episodes will cover the advanced SELECT statements, grouping sets, aggregates, SET operators, basic T-SQL programming and Performance Improvement.  The show focuses heavily on demonstrating the syntax and logic of writing the queries.  This particular exam is intended for candidates that have two or more years of experience in writing queries with Microsoft SQL Server",
			"descriptionMD": "",
			"courseLength": 69315,
			"hidden": false,
			"url": "microsoft-sql-server-2014-70461",
			"productionStart": "2016-04-25T04:00:00Z",
			"productionEnd": "2016-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "571e22479b7fde07007557cb",
			"name": "Certified Technical Coordinator 10.11",
			"subtitle": "OS X Server Essentials 10.11",
			"description": "The Apple Certified Technical Coordinator certification is designed for anyone responsible for managing Apple computers and devices in a business environment. The exam is made up of content from the Support Essentials ACSP course, as well as content from the Server Essentials course which is covered in this show. Technologies covered include topics like network deployment, policy management, troubleshooting and using Open Directory for centralized user management.",
			"descriptionMD": "",
			"courseLength": 61807,
			"hidden": false,
			"url": "os-server-essentials-1011",
			"productionStart": "2016-04-25T04:00:00Z",
			"productionEnd": "2016-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5745ab181f7d870700314a96",
			"name": "VMware Certified Professional 6  VCP6-DCV",
			"subtitle": "Data Center Virtualization",
			"description": "The VMware Certified Professional certification is the most highly recognized certification dealing specifically with virtualization technologies. VMware vSphere is the leading virtualization technology available today and is in use at most large organizations. The VMware Certified Professional 6 – Data Center Virtualization (VCP6-DCV) certification is tailored towards IT System Administrators who are looking to deploy and maintain VMware vSphere and its associated products (ESXi, vCenter, VDP, VMware Converter, etc) in their environment.",
			"descriptionMD": "",
			"courseLength": 91954,
			"hidden": false,
			"url": "vmware-certified-professional-6-vcp6dcv",
			"productionStart": "2016-05-23T04:00:00Z",
			"productionEnd": "2015-06-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "574dea94c5c35507007b87d7",
			"name": "MCSA Windows Server 2016 - 70-TBA",
			"subtitle": "Administering Windows Server 2012",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA covers topics that will help the learner ensure their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 20468,
			"hidden": true,
			"url": "mcsa-windows-server-2017",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57574735b3c25b07007c406b",
			"name": "Advanced SharePoint 2016 - 70-339",
			"subtitle": "Advanced Technologies of SharePoint 2016",
			"description": "This series of videos covers the knowledge and skills needed to plan, configure, and manage the advanced features in a SharePoint 2016 environment, including implementing high availability, disaster recovery, service application architecture, and Microsoft Business Connectivity Services. It also covers social computing features, productivity, and collaboration platforms and features, as well as business intelligence solutions, Enterprise Content Management, web content management infrastructure.\n\nThis is the second in a sequence of two courses for IT Professionals and is aligned with the SharePoint 2016 IT Pro certification.",
			"descriptionMD": "",
			"courseLength": 32731,
			"hidden": false,
			"url": "advanced-sharepoint",
			"productionStart": "2016-06-27T04:00:00Z",
			"productionEnd": "2016-07-02T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57699a2bc7635f070083b8bc",
			"name": "Social Engineering",
			"subtitle": "The art of hacking humans",
			"description": "In this series, Daniel and Tom take you through the \"DNA\" of Social Engineering. They will look into the history of Social Engineering to see where it began and how it has evolved. They will also discuss the tactics, concepts, and tools used by Social Engineers to elicit information from their targets. They also dive into the psychological component of both the attackers as well as the targets and point to documented examples for illustrative purposes.",
			"descriptionMD": "",
			"courseLength": 28647,
			"hidden": false,
			"url": "social-engineering",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "577d5da4b8bdb1070007e983",
			"name": "MCSA Windows 10 - 70-698",
			"subtitle": "Installing and Configuring Windows 10",
			"description": "In this series we will dive into the second exam that is required for a viewer to achieve an MCSA in Windows 10. The topics will range from installation of Windows 10, post-installation configurations, applying images, various deployment tools as well as monitoring and servicing Windows 10 and more. Exam candidates are encouraged to watch both Windows 10 series for the MCSA exams.",
			"descriptionMD": "",
			"courseLength": 58185,
			"hidden": false,
			"url": "mcsa-windows-10-70698",
			"productionStart": "2016-07-01T04:00:00Z",
			"productionEnd": "2016-07-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "577e6cbc86cf39070078b458",
			"name": "Microsoft SQL Server 2014 - 70-462",
			"subtitle": "Administering Microsoft SQL Server 2014",
			"description": "Unhide this only when complete. Hide the old one when this one goes live.",
			"descriptionMD": "",
			"courseLength": 46459,
			"hidden": true,
			"url": "microsoft-sql-server-2014-70462",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "578e8e44e3197a07007112bb",
			"name": "HTML, CSS and Bootstrap",
			"subtitle": "Responsive Web Design",
			"description": "This course introduces basic concepts for building web pages using HTML which gives structure to the content such as defining paragraphs and images and CSS which defines the appearance of the content such as colors and fonts. It also introduces bootstrap which is a collection of tools and templates for use with HTML and CSS.",
			"descriptionMD": "",
			"courseLength": 12036,
			"hidden": false,
			"url": "html-css-bootstrap",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57b2244064e4070700871556",
			"name": "MCSA Windows Server 2016 - 70-740",
			"subtitle": "Installation, Storage, and Compute with Windows Server 2016",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server covers topics that are “must know” for anyone responsible for deploying, maintaining and supporting Windows servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA covers topics that will help the learner ensure their computing environment is functional and stable.",
			"descriptionMD": "",
			"courseLength": 69811,
			"hidden": false,
			"url": "mcsa-windows-server-2016-70740",
			"productionStart": "2016-08-08T23:00:00Z",
			"productionEnd": "2016-08-09T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5829ce253d3e5e0b00af1b8b",
			"name": "Red Hat Enterprise Linux",
			"subtitle": "World's leading enterprise Linux platform",
			"description": "This series covers implementing and managing Red Hat Enterprise Linux (RHEL) v7.  RHEL v7 is the leading commercial Linux server software used by corporations around the world.  Topics covered by this series include installation, configuration, troubleshooting, and backup and recovery.  The goal of this series is to prepare any systems administrator to be able to support RHEL v7 in a production environment.",
			"descriptionMD": "",
			"courseLength": 59624,
			"hidden": false,
			"url": "red-hat-linux",
			"productionStart": "2016-11-14T05:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58860bf426e3e5150013013b",
			"name": "Salesforce Administrator",
			"subtitle": "Salesforce Administrator Certification",
			"description": "The Salesforce Certified Administrator credential is designed for those who have experience as a Salesforce Administrator. Candidates should possess broad knowledge of Salesforce applications, regularly configure and manage Salesforce, and continuously look for ways their companies can get even more from additional features and capabilities.\n\nHere are some examples of the concepts you should understand to pass the exam:\n\nManage users, data, and security\nMaintain and customize Sales Cloud and Service Cloud applications\nBuild reports, dashboards, and workflows",
			"descriptionMD": "The Salesforce Certified Administrator credential is designed for those who have experience as a Salesforce Administrator. Candidates should possess broad knowledge of Salesforce applications, regularly configure and manage Salesforce, and continuously look for ways their companies can get even more from additional features and capabilities.\n\nHere are some examples of the concepts you should understand to pass the exam:\n\nManage users, data, and security\nMaintain and customize Sales Cloud and Service Cloud applications\nBuild reports, dashboards, and workflows",
			"courseLength": 22132,
			"hidden": false,
			"url": "salesforce-administrator",
			"productionStart": "2017-01-26T20:53:04.707Z",
			"productionEnd": "2017-01-26T20:53:04.707Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58a4559aeb4d7c0b0060f5e2",
			"name": "Citrix XenServer 7.0",
			"subtitle": "Open-source virtualization",
			"description": "Citrix XenServer 7.0 is the free virtualization software from Citrix. It is a commercially backed implementation of the open source Xen virtualization platform. The low cost of entry makes XenServer an attractive option for small and medium businesses looking for advanced hypervisor functions (clustering, live migration, centralized management) without the large price tag associated with competing products. This latest version is designed to integrate better with Windows and provide a feature rich virtualization solution to compete with VMWare and Microsoft's Hyper-V market share.",
			"descriptionMD": "Citrix XenServer 7.0 is the free virtualization software from Citrix. It is a commercially backed implementation of the open source Xen virtualization platform. The low cost of entry makes XenServer an attractive option for small and medium businesses looking for advanced hypervisor functions (clustering, live migration, centralized management) without the large price tag associated with competing products. This latest version is designed to integrate better with Windows and provide a feature rich virtualization solution to compete with VMWare and Microsoft's Hyper-V market share.",
			"courseLength": 20907,
			"hidden": false,
			"url": "citrix-xenserver-70",
			"productionStart": "2017-02-15T05:00:00Z",
			"productionEnd": "2017-02-22T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "591f53ca66f7510b00e3d25a",
			"name": "Windows Server 101",
			"subtitle": "Introduction to Windows Server",
			"description": "The Windows Server 101 show is meant for those who have little to no experience in managing and maintaining Windows Server.  It fills in the gap for the desktop support technician who wants some basic and practical Window Server Skills, for the IT professional who may work in other areas and want learn more about Windows Server Administration as well as for the A+ and Network+ certified who need the learn just some Window Server Management and Maintenance before they dive into the MCSA to MCSE certification tracks. The goal is introduction and immediate skill development to manage Windows Server.   This is not for the professional who already has years of experience.",
			"descriptionMD": "The Windows Server 101 show is meant for those who have little to no experience in managing and maintaining Windows Server.  It fills in the gap for the desktop support technician who wants some basic and practical Window Server Skills, for the IT professional who may work in other areas and want learn more about Windows Server Administration as well as for the A+ and Network+ certified who need the learn just some Window Server Management and Maintenance before they dive into the MCSA to MCSE certification tracks. The goal is introduction and immediate skill development to manage Windows Server.   This is not for the professional who already has years of experience.",
			"courseLength": 70060,
			"hidden": false,
			"url": "server-101",
			"productionStart": "2017-05-22T04:00:00Z",
			"productionEnd": "2017-06-21T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "593fe0fc7efd530b0008337a",
			"name": "Becoming a Linux Power User",
			"subtitle": "Becoming a Linux Power User",
			"description": "Becoming a Linux Power User is a technical skills course designed to elevate viewers to \"Power User\" status. Linux provides a very robust and powerful platform that enables users to achieve great things. Unfortunately, most users only scratch the surface of what Linux is capable of. This series explores some of the more powerful functions hidden away behind the graphical user interface. Topics cover using terminals and shells, managing processes and files, and writing simple shell scripts.",
			"descriptionMD": "Becoming a Linux Power User is a technical skills course designed to elevate viewers to \"Power User\" status. Linux provides a very robust and powerful platform that enables users to acheive great things. Unfortunately, most users only scratch the surface of what Linux is capable of. This series explores some of the more powerful functions hidden away behind the graphical user interface. Topics cover using terminals and shells, managing processes and files, and writing simple shell scripts.",
			"courseLength": 31310,
			"hidden": false,
			"url": "becominglinux-power-user",
			"productionStart": "2017-06-13T04:00:00Z",
			"productionEnd": "2017-06-23T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "594bd1ad57c7470b005373bb",
			"name": "Becoming a Linux System Admin",
			"subtitle": "Becoming a Linux System Admin",
			"description": "The Becoming a Linux System Administrator covers managing Linux systems in a business environment. Topics covered include installing Linux, managing software and using centralized user directories among others. The primary goal of the course is to highlight the differences in managing Linux machines in a business environment versus stand-alone or home systems.",
			"descriptionMD": "The *Becoming a Linux System Administrator* covers managing Linux systems in a business environment. Topics covered include installing Linux, managing software and using centralized user directories among others. The primary goal of the course is to highlight the differences in managing Linux machines in a business environment versus stand-alone or home systems.",
			"courseLength": 39214,
			"hidden": false,
			"url": "becominglinux-admin",
			"productionStart": "2017-06-22T04:00:00Z",
			"productionEnd": "2017-06-22T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "594bd67157c7470b00537400",
			"name": "MCSA Windows Server 2012 - 70-412 (2017)",
			"subtitle": "Configuring Advanced Windows Server 2012 Services",
			"description": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-412 Configuring Advanced Windows Server 2012 Services exam covers advanced configurations, Active Directory Federated Services and other areas that will help in your pursuit of the MCSA and also help in an after pursuit of the MCSE certification.",
			"descriptionMD": "Over 80% of computers run Microsoft Operating systems. As a result, the Microsoft Certified Solutions Associate is one of the first steps for those seeking to start a technical career. The MCSA: Windows Server 2012 is designed to be a mid-tier certification for someone who has been working in the field for several years and has had exposure to large and enterprise size deployments of Microsoft Windows and covers topics that are a “must know” for anyone responsible for deploying, maintaining and supporting Windows Server 2012 servers in a corporate or enterprise environment. Server systems often form a critical piece of the day-to-day operations for any business. The MCSA 70-412 Configuring Advanced Windows Server 2012 Services exam covers advanced configurations, Active Directory Federated Services and other areas that will help in your pursuit of the MCSA and also help in an after pursuit of the MCSE certification.",
			"courseLength": 116375,
			"hidden": false,
			"url": "mcsa-windows-server-2012-70412-2017",
			"productionStart": "2017-06-22T04:00:00Z",
			"productionEnd": "2017-10-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59661f91c479120b001fb646",
			"name": "Becoming a Linux Server Admin",
			"subtitle": "Becoming a Linux Server Admin",
			"description": "The Becoming a Linux Server Administrator covers managing Linux servers in a business environment. Topics covered include installing Linux as a server, managing networking and troubleshooting the OS. Other episodes demonstrate how to configure a web server, a file server, and other common servers. The primary goal of the course is to help system administrators learn to deploy and support the Linux operating system as a server platform.",
			"descriptionMD": "The *Becoming a Linux Server Administrator* covers managing Linux servers in a business environment. Topics covered include installing Linux as a server, managing networking and troubleshooting the OS. Other episodes demonstrate how to configure a web server, a file server, and other common servers. The primary goal of the course is to help system administrators learn to deploy and support the Linux operating system as a server platform.",
			"courseLength": 43784,
			"hidden": false,
			"url": "becominglinux-server-admin",
			"productionStart": "2017-07-17T04:00:00Z",
			"productionEnd": "2017-07-25T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59a03b8693c3030b00cb42a5",
			"name": "Linux in the Cloud",
			"subtitle": "Configuring Linux in a cloud environment",
			"description": "The Linux in the Cloud series focuses on implementing the Linux operating system in a virtualized environment. Companies are relying less and less on dedicated hardware and are instead turning to shared hardware to optimize resource utilization and increase deployment flexibility. The hosts demonstrate virtualizing Linux using technologies like KVM and Docker as well as public cloud deployments using Amazon EC2 and Microsoft Azure.",
			"descriptionMD": "The *Linux in the Cloud series* focuses on implementing the Linux operating system in a virtualized environment. Companies are relying less and less on dedicated hardware and are instead turning to shared hardware to optimize resource utilization and increase deployment flexibility. The hosts demonstrate virtualizing Linux using technologies like KVM and Docker as well as public cloud deployments using Amazon EC2 and Microsoft Azure.",
			"courseLength": 19139,
			"hidden": false,
			"url": "linuxthe-cloud",
			"productionStart": "2017-08-25T04:00:00Z",
			"productionEnd": "2017-08-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59dce618185c960c00e0f215",
			"name": "PowerShell Basics",
			"subtitle": "for Administrators",
			"description": "Built on the .NET Framework, Windows PowerShell is a task-based command-line shell and scripting language. In this series, you will learn how to get started using PowerShell, mastering the basic skills, in preparation for more advanced topics.",
			"descriptionMD": "Built on the .NET Framework, Windows PowerShell is a task-based command-line shell and scripting language. In this series, you will learn how to get started using PowerShell, mastering the basic skills, in preparation for more advanced topics.",
			"courseLength": 28200,
			"hidden": false,
			"url": "powershell-2017",
			"productionStart": "2017-10-09T04:00:00Z",
			"productionEnd": "2017-10-16T23:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}