{
  "contentFull": "VMware certification is the most highly recognized certification dealing specifically with virtualization technologies. Get current and engaging VMware training with ITProTV.",
  "contentShort": "",
  "courses": [
    {
      "courseLength": 91954,
      "description": "The VMware Certified Professional certification is the most highly recognized certification dealing specifically with virtualization technologies. VMware vSphere is the leading virtualization technology available today and is in use at most large organizations. The VMware Certified Professional 6 – Data Center Virtualization (VCP6-DCV) certification is tailored towards IT System Administrators who are looking to deploy and maintain VMware vSphere and its associated products (ESXi, vCenter, VDP, VMware Converter, etc) in their environment.",
      "descriptionMD": "",
      "hidden": false,
      "name": "VMware Certified Professional 6  VCP6-DCV",
      "productionEnd": "2015-06-15T04:00:00Z",
      "productionStart": "2016-05-23T04:00:00Z",
      "subtitle": "Data Center Virtualization",
      "url": "vmware-certified-professional-6-vcp6dcv"
    },
    {
      "courseLength": 30111,
      "description": "The VCA6 show dives into data center virtualization fundamentals and featuring vSphere 6 as the solution.  It helps the candidate of the VCA6-DCV certification by discussing and demonstrating VMWare’s data center virtualization technology.  The demonstrations and the discussion in each episode go into to identifying the technical requirements for managing the VMWare vSphere 6 environment.  The segments focus on data center challenges and understanding what VMWare products and solutions can be used to meet those requirements.",
      "descriptionMD": "",
      "hidden": false,
      "name": "VMware Certified Associate 6 VCA6-DCV",
      "productionEnd": "2016-04-20T04:00:00Z",
      "productionStart": "2016-04-04T04:00:00Z",
      "subtitle": "Data Center Virtualization",
      "url": "vmware-certified-associate-6-vca6dcv"
    }
  ],
  "tagname": "VMWare",
  "url": "vmware"
}
