{
	"id": "55df18c4bcd0710700b4f463",
	"tagname": "CCNA",
	"contentFull": "",
	"contentShort": "",
	"url": "ccna",
	"courses": [
		{
			"id": "54c2920ae108051570000023",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "September 24, 2016 is the last day for this exam. CCNA Overview The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"length": 71087,
			"hidden": false,
			"url": "ccna-routing-switching",
			"productionStart": "2016-08-01T04:00:00Z",
			"productionEnd": "2016-09-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000024",
			"name": "CCNA Security 640-554",
			"subtitle": "Cisco Certified Network Associate Security",
			"description": "Those looking to complete the Cisco Certified Network Associate (CCNA) Security certification will find in this course an overview of the process in achieving the certification and details about the Implementing Cisco IOS Network Security (IINS) exam required to pass in order to receive the certification. CCNA Security addresses how to properly secure Cisco devices and security on Cisco routers and switches and is designed not just for IT professionals, but also for any kind of network administrator that supports Cisco equipment. The exam objectives cover a wide range of topics including common security threats, iOS ACLs, Cisco firewall technologies and others, which can provide foundational knowledge for achieving further related certifications like the CCNP.",
			"descriptionMD": "",
			"length": 60986,
			"hidden": false,
			"url": "ccna-security",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5745ed56c9441f0700b44117",
			"name": "Accelerated CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "This Accelerated Cisco CCNA Routing + Switching show helps candidate review their exam readiness for 200-105 exam.  It’s a fast paced and hard hitting review of every exam objective for latest CCNA 200-105 exam. The accelerated pace is helpful for those that are ready for the exam and give an in-depth review of each objective you may encounter for CCNA R+S.\nThe episodes can be used as part of building a candidate's knowledge and skills in LAN switching technologies such as trunking, VLAN trunking protocol and dealing with Switching loops along with troubleshooting. IPv4 and IPv6 routing technologies in RIPng, EIGRP and OSPF are also discussed and configured helping the candidate to understand and troubleshoot configuration and routing issues. WAN technologies, infrastructure services, and infrastructure maintenance technologies are also described and configured to help the CCNA candidate not only for the exam but also for business and production use.",
			"descriptionMD": "",
			"length": 33069,
			"hidden": false,
			"url": "ccna-routing-switching2",
			"productionStart": "2016-05-23T04:00:00Z",
			"productionEnd": "2016-05-26T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57a493bc1f2a8d07003b199e",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"length": 70965,
			"hidden": false,
			"url": "ccna-routing-switching4",
			"productionStart": "2016-08-04T04:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}