{
	"id": "560d75da3908500700ea6aa0",
	"tagname": "CISSP",
	"contentFull": "",
	"contentShort": "",
	"url": "cissp",
	"courses": [
		{
			"id": "54c2920ae108051570000027",
			"name": "Certified Information Systems Security Professional",
			"subtitle": "CISSP",
			"description": "The Certified Information Systems Security Professional (CISSP) certification is the gold standard in the IT Security field. Security professionals that have achieved their CISSP designation are regarded as some of the most talented and knowledgeable people in their field. The certification is demonstrates that the holder has been working in IT Security for over five years and has a broad range of knowledge in ten domains related to creating, supporting and maintaining a secure IT infrastructure.",
			"descriptionMD": "",
			"length": 96478,
			"hidden": false,
			"url": "certified-information-systems-security-professional",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5671c5a1a5f5110700f8f666",
			"name": "Certified Information Systems Security Professional (UPDATED 2016)",
			"subtitle": "CISSP",
			"description": "The Certified Information Systems Security Professional (CISSP) certification is the gold standard in the IT Security field. Security professionals that have achieved their CISSP designation are regarded as some of the most talented and knowledgeable people in their field. The certification demonstrates that the holder has been working in IT Security for over five years, has a broad range of knowledge in ten domains related to creating, supporting and maintaining a secure IT infrastructure and can implement things like risk management and risk identification.",
			"descriptionMD": "",
			"length": 99645,
			"hidden": false,
			"url": "certified-information-systems-security-professional-reshoot",
			"productionStart": "2015-12-15T05:00:00Z",
			"productionEnd": "2016-01-15T05:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}