{
	"id": "58b02fa0fe7cbf0b0070fdbe",
	"tagname": "ITIL Master Level",
	"contentFull": "",
	"contentShort": "",
	"url": "itil-master",
	"courses": [
		{
			"id": "57b330baa0f12c070082067e",
			"name": "Accredited ITIL Foundation",
			"subtitle": "Foundation",
			"description": "** Look for our partner PassionIT Group's information in the Episode Files section of the first episode for curriculum, exam offers Codes for offers are available to members and in the download in the second episode** The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
			"descriptionMD": "** Look for our partner PassionIT Group's information [HERE](https://itprotv-notes-bucket.s3.amazonaws.com/ITIL_OVERVIEW.zip)  Codes for offers are available to members and in the download in the second episode**  For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com). The Information Technology Infrastructure Library (ITIL) was created to help businesses manage their IT operations more efficiently and reliably. The ITIL framework provides a collection of practices that businesses can choose to adopt that focus on aligning IT operations with the goals of the business. These practices range from creating new service offerings to day-to-day operations and managing incidents. Many organizations choose to follow ITIL because it prevents them from having to \"reinvent the wheel\" when it comes to IT processes and operations. The ITIL Foundations certification is designed to introduce the candidate to the general processes in ITIL and how they can be used to benefit an organization.",
			"length": 21847,
			"hidden": false,
			"url": "itil-foundation-2016",
			"productionStart": "2017-01-13T18:05:17.298Z",
			"productionEnd": "2017-01-13T18:05:17.298Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5841cfb547a84a0b00ca08fe",
			"name": "Accredited ITIL Intermediate - RCV",
			"subtitle": "Release Control and Validation",
			"description": "The ITIL:Release, Control, \u0026 Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release \u0026 deploy the required service management lifecycle for an organization.",
			"descriptionMD": "The ITIL:Release, Control, \u0026 Validation show centers around the 7 processes within the ITIL Service Transition Publication.  ITIL RCV is based on practically apply the RCV processes that enable successful planning, testing and implementation of service management that brings business values to an organization.  The goal of the show is to provide framework for managing transitional changes, validating service management and helping organizations release \u0026 deploy the required service management lifecycle for an organization. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"length": 29485,
			"hidden": false,
			"url": "itil-intermediate",
			"productionStart": "2017-01-23T14:04:08.114Z",
			"productionEnd": "2017-01-23T14:04:08.114Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58860d2626e3e51500130144",
			"name": "Accredited ITIL Intermediate - OSA",
			"subtitle": "Operational Support and Analysis",
			"description": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs.",
			"descriptionMD": "The Operational Support and Analysis (OSA) module is one of the certifications in the ITIL® Service Capability work stream. The module focuses on the practical application of OSA practices in order to enable event, incident, request, problem, access, technical, IT operations and application management. The OSA course can teach organizations and individuals how to manage the everyday operation of IT services and gain a better understanding of how to implement the ITIL processes that will enable them to deliver and support services to customers. It also covers issues relating to the people, relationships, procedures and infrastructure technology required to ensure that the organization or programs can provide the high quality and cost effective IT services that are required to meet organizational needs. For course completion certificates to be submitted for exams, please [contact PassionIT Group](mailto:info@passionitgroup.com).",
			"length": 19397,
			"hidden": false,
			"url": "accredited-itil-intermediate-OSA",
			"productionStart": "2017-01-23T14:04:56.388Z",
			"productionEnd": "2017-01-23T14:04:56.388Z",
			"episodes": null,
			"topics": null
		}
	]
}