{
	"id": "563a1b616380400700733366",
	"tagname": "MTA",
	"contentFull": "",
	"contentShort": "",
	"url": "mta",
	"courses": [
		{
			"id": "55f7130840b40607007d2391",
			"name": "MTA - Mobility and Devices Fundamentals - 98-368",
			"subtitle": "Mobility and Devices Fundamentals",
			"description": "The Microsoft Technology Associate (MTA) is designed to be an entry point into the world of Microsoft certifications, validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-368: MTA Mobility and Devices Fundamentals Exam. One will also focus on desktops, laptops, tablets, cell phones and other devices typically used by an end user because when one first transitions over to IT, one will typically be starting in a role as help desk or desktop support and will need to identify and resolve the issues of such devices. To gain an MTA certification, you must pass only one MTA exam.",
			"descriptionMD": "",
			"length": 29311,
			"hidden": false,
			"url": "mta-mobility-devices-fundamentals",
			"productionStart": "2015-09-08T04:00:00Z",
			"productionEnd": "2015-09-18T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "560b381721416f07000ba342",
			"name": "MTA - Server Fundamentals - 98-365",
			"subtitle": "Windows Server Administration Fundamentals",
			"description": "Microsoft Technology Associate (MTA) is an introductory Microsoft certification for individuals considering a career in technology. The Windows Server Administration Fundamentals exam is designed to provide an assessment of knowledge of fundamental server administration concepts. It covers a wide range of topics, such as Windows Server, Windows-based networking, Active Directory, and system recovery. Upon completing the 98-365 exam, you will earn a Microsoft Technology Associate certification, which helps prove your knowledge of fundamental technology concepts. It can also serve as a stepping stone to the Microsoft Certified Technology Specialist exams.",
			"descriptionMD": "",
			"length": 46164,
			"hidden": false,
			"url": "mta-server1",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "561538df0051eb0700b1f471",
			"name": "MTA - Networking Fundamentals - 98-366",
			"subtitle": "Networking Fundamentals",
			"description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on the knowledge required for the 98-366: MTA Networking Fundamentals Exam.  This exam tests your knowledge about networking basics and the configuration of network settings and also covers the basic hardware one will find as network technicians in the field, terminology one is likely to encounter, and about the OSI model and different internet protocols which are foundational to all of networking. To gain an MTA certification, you must pass only one MTA exam.",
			"descriptionMD": "",
			"length": 29251,
			"hidden": false,
			"url": "mta1",
			"productionStart": "2015-09-05T04:00:00Z",
			"productionEnd": "2015-09-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5627d10e20e07507008aec79",
			"name": "MTA - Security Fundamentals - 98-367",
			"subtitle": "Security Fundamentals",
			"description": "The Microsoft Technology Associate (MTA) validates building-block technology concepts and helps students explore, discover and pursue successful careers in Information Technology (IT) in an exciting and rewarding way! As the first step in the Microsoft Technology Certification Series, this new, entry-level certification provides students with confidence, credibility, and differentiation while focusing on basic terminology, and concepts like CIA Triad, which is a set of core security principles that can provide as the foundation for security. To gain an MTA certification, you must pass only one MTA exam.",
			"descriptionMD": "",
			"length": 29646,
			"hidden": false,
			"url": "mta2",
			"productionStart": "2015-10-15T04:00:00Z",
			"productionEnd": "2015-10-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56955a1b8c4e170700ed0a9e",
			"name": "MTA - Cloud Fundamentals - 98-369",
			"subtitle": "Cloud Fundamentals",
			"description": "The Microsoft Technology Associate (MTA) Cloud Fundamentals course is for anyone looking to learn foundational cloud computing knowledge as well as basic skills inside of Office 365 and Microsoft Intune. This is a great course for someone wanting to learn basic Office 365, Exchange Online, SharePoint Online and Skype for Business tasks. Content wise, one will hear about the different technologies one would use when it comes to utilizing the cloud, securing the data in the cloud, and even connect different services to things like the Office 365 interface as well as focus on the knowledge required for the 98-369: MTA Cloud Fundamental Exam. To gain an MTA certification, you must pass only one MTA exam.",
			"descriptionMD": "",
			"length": 37499,
			"hidden": false,
			"url": "mta-cloud-fundamentals-98369",
			"productionStart": "2016-01-05T05:00:00Z",
			"productionEnd": "2016-01-15T05:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}