{
	"id": "55df17eb9b5b2d0700065db7",
	"tagname": "Network Admin",
	"contentFull": "",
	"contentShort": "",
	"url": "network-admin",
	"courses": [
		{
			"id": "54c2920ae108051570000022",
			"name": "CCENT",
			"subtitle": "Cisco Certified Entry Networking Technician",
			"description": "August 20, 2016  is the last day for this exam. Those looking to complete the Cisco Certified Entry Networking Technician (CCENT) certification will find in this course an overview of the process in achieving the certification and details about the exam required to pass in order to receive it. The CCENT involves networking fundamentals, basic security, wireless concepts and other topics and is designed for entry level IT professionals getting ready for help desk and support type positions. Some of the exam objectives include Operation of IP Data Networks, LAN Switching Technologies, IP Addressing, Network Device Security, troubleshooting and others which provide good foundational knowledge for achieving further related certifications.",
			"descriptionMD": "",
			"length": 63799,
			"hidden": false,
			"url": "ccent",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000023",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "September 24, 2016 is the last day for this exam. CCNA Overview The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"length": 71087,
			"hidden": false,
			"url": "ccna-routing-switching",
			"productionStart": "2016-08-01T04:00:00Z",
			"productionEnd": "2016-09-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000024",
			"name": "CCNA Security 640-554",
			"subtitle": "Cisco Certified Network Associate Security",
			"description": "Those looking to complete the Cisco Certified Network Associate (CCNA) Security certification will find in this course an overview of the process in achieving the certification and details about the Implementing Cisco IOS Network Security (IINS) exam required to pass in order to receive the certification. CCNA Security addresses how to properly secure Cisco devices and security on Cisco routers and switches and is designed not just for IT professionals, but also for any kind of network administrator that supports Cisco equipment. The exam objectives cover a wide range of topics including common security threats, iOS ACLs, Cisco firewall technologies and others, which can provide foundational knowledge for achieving further related certifications like the CCNP.",
			"descriptionMD": "",
			"length": 60986,
			"hidden": false,
			"url": "ccna-security",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000025",
			"name": "CCNP Routing and Switching - ROUTE",
			"subtitle": "Implementing Cisco IP Routing",
			"description": "Those looking to complete the Cisco Certified Network Professional (CCNP) Routing and Switching certification will find in this course an overview of the process in achieving the certification and details about the 300-101 Route exam for implementing Cisco IP routing, which is one of three exams required to pass in order to receive the certification. The exam focuses on Cisco router implementation in medium and large environments and the exam objectives cover a wide range of topics including Layer 3 technologies, Infrastructure services and security, and others, which can also benefit those continuing to pursue the CCIE certification.",
			"descriptionMD": "",
			"length": 130340,
			"hidden": false,
			"url": "ccnp-routing-switching",
			"productionStart": "2015-08-24T04:00:00Z",
			"productionEnd": "2015-09-04T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002a",
			"name": "Network+",
			"subtitle": "",
			"description": "This exam has been retired. The Network+ certification was introduced by CompTIA in 1999. It was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining the Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) to provide the learner with a broad, vendor neutral perspective on the topics required to work in the field",
			"descriptionMD": "",
			"length": 150803,
			"hidden": false,
			"url": "network",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002c",
			"name": "Wireshark",
			"subtitle": "Network protocol analyzer",
			"description": "Wireshark is a free and open source network packet sniffer and protocol analyzer. It is an invaluable tool for any network administrator who needs detailed visibility into the traffic on their network. It utilizes a packet capture utility or sniffer, which watches any traffic/communication that crosses the network adapter and writes it to a file and then the protocol analyzer interprets the raw data obtained by the sniffer and turns it into readable data. It also provides in-depth tools for isolating faults and troubleshooting failures.",
			"descriptionMD": "",
			"length": 7461,
			"hidden": false,
			"url": "wireshark",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae10805157000002d",
			"name": "GNS3",
			"subtitle": "Router emulation software",
			"description": "GNS3 is a free graphical network simulator capable of emulating a number of network devices. This makes it possible for anyone to quickly and easily spin up network hardware for testing and educational purposes without the heavy expense of physical hardware. Supported devices include Cisco routers and firewalls, Juniper routers, and frame-relay switches. ",
			"descriptionMD": "",
			"length": 7236,
			"hidden": false,
			"url": "gns3",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-12-31T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5509d06cf31db207006d59c4",
			"name": "Network+",
			"subtitle": "Vendor-neutral Networking",
			"description": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.",
			"descriptionMD": "The _Network+ certification_ was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.  __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 269509,
			"hidden": false,
			"url": "network1",
			"productionStart": "2016-12-13T18:51:47.697Z",
			"productionEnd": "2016-12-13T18:51:47.697Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55797e2af4fdcf070096c5a4",
			"name": "pfSense",
			"subtitle": "pfSense Build 2.2.2",
			"description": "pfSense is a popular open source firewall solution that has many of the same features as some of the enterprise security appliances offered by many of the leading security appliance vendors.  It’s full feature set is provided free of charge.  This series was designed to introduce to our viewers the pfSense solution, demonstrate many of its features and provide some of the most essential configuration guidance to someone desiring to get pfSense working in their environment.",
			"descriptionMD": "",
			"length": 37514,
			"hidden": false,
			"url": "pfsense",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5595a25086d76e1f00e0689e",
			"name": "Cisco ASA Firewalls",
			"subtitle": "Configuration of Cisco ASA Firewalls",
			"description": "The Cisco ASA (Adaptive Security Appliance) is one of the most implemented security solutions found in enterprise networks.  Cisco offers an entire series of firewalls that range from small office solutions to very large enterprise solutions. It is because of its commonality that in many businesses an IT Professional would do well to be familiar with the product and some of the most essential configurations.  This series is designed to help an IT Professional to see how to configure many of the features in the ASA through the GUI interface, the ASDM.  This will provide an introduction to the appliance and guidance on some of most used features for any environment.",
			"descriptionMD": "",
			"length": 13020,
			"hidden": false,
			"url": "cisco-asa-firewalls",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-07-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55a905f7fd2c330700ddeb47",
			"name": "Microsoft Project 2013 - 74-343",
			"subtitle": "Managing Projects with Microsoft Project 2013",
			"description": "Microsoft Project 2013 is the latest offering by Microsoft into the software realm of PMIS (Project Management Information Systems).  This type of tool is used to help a project manager consolidate the number of tools they may use (e.g.  Calendar systems, email, contacts and some budgeting software and reporting software) into a single software tool for initiating, planning, executing, monitoring and controlling and even closing a project.  Within a single tool, a project manager can manage a project’s triple constraints:  Cost, Scope and Time.  This series covers every exam objective to help a viewer to prepare for the Microsoft exam 74-343 —Managing Projects with Microsoft Project 2013.",
			"descriptionMD": "",
			"length": 34814,
			"hidden": false,
			"url": "microsoft-project-2013",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "560b3bd20e55600700ee2943",
			"name": "CCNP Routing and Switching - SWITCH",
			"subtitle": "Implementing Cisco IP Switched Networks",
			"description": "The Implementing Cisco IP Switched Networks exam is the second of three exams required to obtain the Cisco Certified Network Professional certification. This exam focuses on Cisco switch implementation in medium and large environment. The topics covered range from HSRP, STP, VTP to Etherchannel and how and why we use them.. The typical viewer would be anyone responsible for the maintenance and implementation of Cisco Switches in a large or enterprise organization. This SWITCH  emphasizes planning, configuring, and verifying the implementation of complex enterprise switching solutions that use the Cisco Enterprise Campus Architecture.",
			"descriptionMD": "",
			"length": 43691,
			"hidden": false,
			"url": "ccnp-routing-switching1",
			"productionStart": "2015-09-28T04:00:00Z",
			"productionEnd": "2015-10-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "562a2d0fc3ef850700eae4f6",
			"name": "CCNP Routing and Switching - TSHOOT",
			"subtitle": "Troubleshooting and Maintaining Cisco IP Networks",
			"description": "Troubleshooting and Maintaining Cisco IP Networks exam is one of three exams required to obtain the Cisco Certified Network Professional - Routing and Switching certification. This exam focuses on troubleshooting Layer 2 and Layer 3 devices, planning regular maintenance, and troubleshooting methodology  in complex medium and large environments. The topics include Systematic Troubleshooting Principles, Layer 2 and Layer 3 technology, Infrastructure Services and Security, and VPN technologies. The typical viewer would be anyone responsible for the maintenance and implementation and administration of Cisco Layer 2 and Layer 3 technologies in complex organizations.",
			"descriptionMD": "",
			"length": 68243,
			"hidden": false,
			"url": "ccnp-routing-switching2",
			"productionStart": "2015-10-19T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56438f96dac69e0700ec480f",
			"name": "Bash and Scripting",
			"subtitle": "CLI",
			"description": "Unix and Unix-like operating systems(Linux/BSD), known for their speed and reliability, are becoming an ever increasing presence in many data centers and server closets. That being the case, systems administrators that are new to the command-line driven nature of these systems will need to get up to speed on how to interact with the CLI shell environment found as the default on the majority of those systems. In this series, we introduce you to that shell environment known as the Bourne Again Shell or bash, for short. The series starts with an introduction to the bash environment, showing and explaining to you how to navigate through the system using text-based commands. This includes file system navigation, setting file permissions, manipulating output, etc. Then, building upon that foundation, we show you how to automate repetitive tasks by creating customized scripts. All the main bash scripting abilities are covered; from basic repetitive command execution, to more complex functionality like arithmetic, arrays, conditional statements(if-then/elif/case-esac), program loops(for/while/until), and functions/libraries.",
			"descriptionMD": "",
			"length": 42335,
			"hidden": false,
			"url": "bash-scripting",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-13T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5644e9fe597c030700e7ace5",
			"name": "FirePOWER with Advanced FireSIGHT Administration",
			"subtitle": "SSFIPS",
			"description": "FirePOWER is the power of the next generation IPS/ firewall that runs on one’s managed devices and defense center and FireSIGHT is a passive technology that scans a network and gathers information about users, hosts and applications. Viewers will learn about Cisco FirePOWER (formerly SourceFIRE) and how it can be employed to secure a network. Upon completion of this series, you will be able to identify the various features of Cisco FirePOWER, the FireSIGHT Management Center and FirePOWER AMP. You will also be able to configure FireSIGHT policies to enforce your company's security policy to all traffic on your network.",
			"descriptionMD": "",
			"length": 28216,
			"hidden": false,
			"url": "firepower-advanced-firesight-administration",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-13T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5655ce94db802307006ff10e",
			"name": "AWS Certified SysOps Administrator",
			"subtitle": "ACSA",
			"description": "The Amazon Web Services Certified SysOps Administrator (ACSA) certification is designed for professionals responsible for supporting deployments running in the AWS cloud. Topics covered include managing cloud based database instances, implementing security in the cloud and supporting virtual servers. The ACSA is an associate level certification intended as a starting point for technicians seeking AWS certification.",
			"descriptionMD": "",
			"length": 47849,
			"hidden": false,
			"url": "aws-certified-sysops-administrator",
			"productionStart": "2015-11-15T05:00:00Z",
			"productionEnd": "2015-12-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56b8a5a3c58e8f0700331d38",
			"name": "Anonabox Implementation",
			"subtitle": "Configuring the Anonabox Pro",
			"description": "",
			"descriptionMD": "",
			"length": 6673,
			"hidden": true,
			"url": "anonabox-implementation",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56ba1040fd50ac0700868ccd",
			"name": "Cloud+",
			"subtitle": "Vendor-neutral cloud management",
			"description": "The CompTIA Cloud+ Certification is designed for IT professionals tasked with supporting private and public cloud infrastructures that have at least a few years of experience in IT networking. More and more companies are deploying cloud services in addition to, or in place of, traditional server infrastructure. The Cloud+ certification covers all the underlying hardware technologies, software, and logistics of deploying the technology, is designed to provide a well-rounded foundational knowledge of cloud and virtualization technologies and works to certify and validate one’s knowledge in the area of cloud computing.",
			"descriptionMD": "The CompTIA Cloud+ Certification is designed for IT professionals tasked with supporting private and public cloud infrastructures that have at least a few years of experience in IT networking. More and more companies are deploying cloud services in addition to, or in place of, traditional server infrastructure. The Cloud+ certification covers all the underlying hardware technologies, software, and logistics of deploying the technology, is designed to provide a well-rounded foundational knowledge of cloud and virtualization technologies and works to certify and validate one’s knowledge in the area of cloud computing. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 70352,
			"hidden": false,
			"url": "cloud",
			"productionStart": "2016-12-13T18:53:13.939Z",
			"productionEnd": "2016-12-13T18:53:13.939Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56cc79ed163a7407004685d6",
			"name": "Project+",
			"subtitle": "Project Management",
			"description": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional.",
			"descriptionMD": "The CompTIA Project+ show is a series that discusses, shows and examines different project management skills needed to successfully manage projects.  The series is designed for the person needing to gain the core knowledge and skills to manage, lead, direct or even be part of small to medium scale projects.  It is also based on the PK0-003 exam objectives, covering each domain and objective for the CompTIA Project+ candidate.  The goal is therefore twofold:  to provide knowledge for the professional certification candidate as well as to provide practical knowledge and skills for the project participant and project management professional. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 79105,
			"hidden": false,
			"url": "project",
			"productionStart": "2016-12-13T18:53:32.104Z",
			"productionEnd": "2016-12-13T18:53:32.104Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56f5441d0ea86607008b9146",
			"name": "Certified Support Professional 10.11",
			"subtitle": "OS X Support Essentials 10.11",
			"description": "Apple Certified Support Professional (ACSP) certification confirms the candidate's understanding of OS X's core functionality as well as having the ability to configure key services, perform basic troubleshooting, and support multiple users  with essential OS X capabilities. Candidates for this course may be in a role of help desk professional, technical coordinator, or power user who supports OS X users, manages networks, or provides technical support for the Mac.",
			"descriptionMD": "",
			"length": 72604,
			"hidden": false,
			"url": "certified-support-professional-1011",
			"productionStart": "2016-03-28T04:00:00Z",
			"productionEnd": "2016-04-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56fc18caca158407009a5898",
			"name": "Network Troubleshooting",
			"subtitle": "Command Line Tools for Diagnosing Network Issues",
			"description": "Every technician faces time when the network is not running up to par. We will take a look at different utilities and techniques to identify network  issues like routing delays, DNS issues, DHCP failures and end-to-end communications. We demonstrate some of the utilities that can be used to not only identify but resolve issues that arise on the network.",
			"descriptionMD": "",
			"length": 7031,
			"hidden": false,
			"url": "network-troubleshooting",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "571e22479b7fde07007557cb",
			"name": "Certified Technical Coordinator 10.11",
			"subtitle": "OS X Server Essentials 10.11",
			"description": "The Apple Certified Technical Coordinator certification is designed for anyone responsible for managing Apple computers and devices in a business environment. The exam is made up of content from the Support Essentials ACSP course, as well as content from the Server Essentials course which is covered in this show. Technologies covered include topics like network deployment, policy management, troubleshooting and using Open Directory for centralized user management.",
			"descriptionMD": "",
			"length": 61807,
			"hidden": false,
			"url": "os-server-essentials-1011",
			"productionStart": "2016-04-25T04:00:00Z",
			"productionEnd": "2016-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5733282475149f070003da6c",
			"name": "Nmap",
			"subtitle": "Network Mapper, a Security Scanner",
			"description": "In this series we will be covering the use of network mapper utility aptly called Nmap. This series aims to give the viewer a firm grasp of the concepts and applications inherent to Nmap, such as Host Discovery, Port Scanning, Service/OS/Version Detection, and the Nmap Scripting Engine(NSE) for the purposes of security and general network administration.",
			"descriptionMD": "",
			"length": 25597,
			"hidden": false,
			"url": "nmap",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "577d4c27b8bdb1070007e724",
			"name": "CCENT",
			"subtitle": "Cisco Certified Entry Networking Technician",
			"description": "The Cisco Certified Entry Networking Technician (CCENT) certification is targeted towards IT workers interested in becoming Network Administrators. The certification covers foundational networking topics required of anyone working with IPv4 and IPv6 networks. The series also covers configuring and maintaining Cisco routers and switches in small to medium sized networks. Topics covered in this series include routing protocols, VLANs, device security and more.",
			"descriptionMD": "",
			"length": 77640,
			"hidden": false,
			"url": "ccent2017",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2016-05-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57a493bc1f2a8d07003b199e",
			"name": "CCNA Routing and Switching",
			"subtitle": "Cisco Certified Network Associate",
			"description": "The Cisco Certified Network Associate (CCNA) is the most well known Cisco certification path. It takes the general networking theory from the CCENT certification and applies it in real world scenarios. It moves beyond configuring individual devices into more complex territory often requiring the configuration of numerous devices to create a robust and optimized network. While studying for this certification, you will revisit the routing and switching topics from the CCENT in more depth as you learn about and implement the advanced features of each technology.",
			"descriptionMD": "",
			"length": 70965,
			"hidden": false,
			"url": "ccna-routing-switching4",
			"productionStart": "2016-08-04T04:00:00Z",
			"productionEnd": "1970-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "584eb6b3d78a9b0b0017162e",
			"name": "pfSense (2016)",
			"subtitle": "pfSense build 2.3.2",
			"description": "The pfSense show is presented to help users to become familiar and proficient at deploying the free network firewall.  This free solution provides the features found in most commercial firewalls and even some features not found in some of them.  It is completely scalable only limited by the hardware you provide.  To make for easier management and configuration, a full featured and intuitive web-based configurator is integrated to support all features.  You’ll see that it’s relatively easy to get it functional.  The show also shows how to implement firewall filters, nat rules, network services, VPNs and additional packages.",
			"descriptionMD": "",
			"length": 43370,
			"hidden": false,
			"url": "pfsense-2016",
			"productionStart": "2016-12-16T21:38:31.986Z",
			"productionEnd": "2016-12-16T21:38:31.986Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "588613d026e3e51500130194",
			"name": "Network+ 2016",
			"subtitle": "Vendor-neutral networking",
			"description": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration.",
			"descriptionMD": "The Network+ certification was introduced by CompTIA in 1999 and was designed to do for Network Technicians what the A+ certification did for Computer Technicians. Obtaining Network+ certification shows that the holder possess the same knowledge and skills of someone who has worked for nine months as a Network Technician. The Network+ exam covers topics ranging from theory (terminology, topology and design) to hardware (routers, switches and cabling) and provides users with a broad, vendor neutral perspective on the topics required to work in the field of Network Administration. __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 137195,
			"hidden": false,
			"url": "network-2016",
			"productionStart": "2017-01-23T05:00:00Z",
			"productionEnd": "2017-04-13T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "58ada8a0b2328f0b009ed5fd",
			"name": "Wireshark 2.2.4",
			"subtitle": "Network protocol analyzer",
			"description": "Wireshark 2.2.4  is a free and open source network packet sniffer and protocol analyzer developed as a first response tool. It is the most widely-used network protocol analyzer.  I can be used to examine all network traffic because it’s a mini swiss army knife to network administrators who needs detailed visibility into the traffic on their network.  It displays the raw data obtained by the sniffer and turns it into readable and meaningful data so that the user will be able to spot issues as well as correct network problems.  It’s power lies in the ability to help an analyst find the proverbial “needle in a haystack” when the user is up to speed on what to look for and how to do it.  This show helps the network professional get started with Wireshark!",
			"descriptionMD": "Wireshark 2.2.4  is a free and open source network packet sniffer and protocol analyzer developed as a first response tool. It is the most widely-used network protocol analyzer.  I can be used to examine all network traffic because it’s a mini swiss army knife to network administrators who needs detailed visibility into the traffic on their network.  It displays the raw data obtained by the sniffer and turns it into readable and meaningful data so that the user will be able to spot issues as well as correct network problems.  It’s power lies in the ability to help an analyst find the proverbial “needle in a haystack” when the user is up to speed on what to look for and how to do it.  This show helps the network professional get started with Wireshark!",
			"length": 14206,
			"hidden": false,
			"url": "wireshark2",
			"productionStart": "2017-02-22T05:00:00Z",
			"productionEnd": "2017-02-25T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "598a07d7fcb6d30b00dbc257",
			"name": "OpenVPN in Linux",
			"subtitle": "Virtual Private Network in Linux",
			"description": "In this series, Daniel and Justin will take you from start to finish through setting up a Ubuntu based OpenVPN server in AWS and an Ubuntu client. They show you how to set the proper firewall configurations, install OpenVPN on the server, install Easy-RSA on the server, configure the Certificate Authority(CA), generate both server and client keys, configure the server.conf and client.ovpn files, and finally make a VPN connection. They also look at few problems/errors that you may encounter and explain the appropriate troubleshooting techniques to resolve them.",
			"descriptionMD": "In this series, Daniel and Justin will take you from start to finish through setting up a Ubuntu based OpenVPN server in AWS and an Ubuntu client. They show you how to set the proper firewall configurations, install OpenVPN on the server, install Easy-RSA on the server, configure the Certificate Authority(CA), generate both server and client keys, configure the server.conf and client.ovpn files, and finally make a VPN connection. They also look at few problems/errors that you may encounter and explain the appropriate troubleshooting techniques to resolve them.",
			"length": 6319,
			"hidden": false,
			"url": "openvpnlinux",
			"productionStart": "2017-08-07T04:00:00Z",
			"productionEnd": "2017-08-09T04:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}