{
	"id": "560d762f0e968e07003c95b8",
	"tagname": "PMP",
	"contentFull": "",
	"contentShort": "",
	"url": "pmp",
	"courses": [
		{
			"id": "54c2920ae108051570000028",
			"name": "Project Management Professional",
			"subtitle": "Project Management Certification",
			"description": "*** Updated to reflect changes to the exam effective Jan 2016 *** The Project Management Professional (PMP) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams.",
			"descriptionMD": "Updated to reflect changes to the exam effective Jan 2016. The Project Management Professional (PMP\u0026reg; ) certification from the Project Management Institute is the leading certification for individuals working as a project manager. The certification combines breadth of knowledge with extensive pre-requisites to ensure that candidates who successfully complete the exam are competent and well versed in the various tools and techniques used by successful project managers. The certificate is targeted at individuals with over five years of experience working as a project manager and seeking to validate their knowledge and experience through becoming certified. Individuals without five years of documented experience should consider the Certified Associate of Project Management (CAPM\u0026reg;) certification. At ITProTV, our project management show is designed to prepare the viewer for both exams. PMP\u0026reg; and CAPM\u0026reg; are registered trademarks of the Project Management Institute.",
			"length": 118500,
			"hidden": false,
			"url": "project-management-professional",
			"productionStart": "1970-01-01T00:00:00Z",
			"productionEnd": "2016-02-15T05:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}