{
	"id": "55df17f2d9cf8607009d2bce",
	"tagname": "Security Admin",
	"contentFull": "",
	"contentShort": "",
	"url": "security-admin",
	"courses": [
		{
			"id": "54c2920ae10805157000001a",
			"name": "Security+",
			"subtitle": "Vendor-neutral IT Security",
			"description": "CompTIA Security+ professionals help to implement, administer and maintain a secure computing environment for any organization. The certification is designed for those with a few years of experience in IT administration with a focus on security that want to help protect and secure their network. Viewers will hear about different topics and objectives discussed in this course including different areas of security, threats and vulnerabilities, cryptography, and other additional topics and will attain knowledge and skills to identify security issues, to mitigate and deter threats, to apply security controls and implement and maintain an organization’s security policies.",
			"descriptionMD": "_CompTIA Security+_ professionals help to implement, administer and maintain a secure computing environment for any organization. The certification is designed for those with a few years of experience in IT administration with a focus on security that want to help protect and secure their network. Viewers will hear about different topics and objectives discussed in this course including different areas of security, threats and vulnerabilities, cryptography, and other additional topics and will attain knowledge and skills to identify security issues, to mitigate and deter threats, to apply security controls and implement and maintain an organization’s security policies. __This course has been CAQC'd and qualifies for CEU credits. [Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 93507,
			"hidden": false,
			"url": "security",
			"productionStart": "2016-12-13T18:50:56.731Z",
			"productionEnd": "2016-12-13T18:50:56.731Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000026",
			"name": "Systems Security Certified Practitioner",
			"subtitle": "SSCP",
			"description": "The Systems Security Certified Practitioner (SSCP) certification is one of the leading certifications from (ISC)2. This is a certification for hands on practitioners with the responsibility of making sure IT security concerns are addressed in an enterprise environment and is designed for IT security professionals with one or more years of field experience who are seeking to advance their career by validating their knowledge and experience. If IT security is your preferred career path, then the SSCP is a great starting point for you.",
			"descriptionMD": "",
			"length": 76874,
			"hidden": false,
			"url": "systems-security-certified-practitioner",
			"productionStart": "2014-07-15T23:00:00Z",
			"productionEnd": "2014-08-15T23:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54c2920ae108051570000027",
			"name": "Certified Information Systems Security Professional",
			"subtitle": "CISSP",
			"description": "The Certified Information Systems Security Professional (CISSP) certification is the gold standard in the IT Security field. Security professionals that have achieved their CISSP designation are regarded as some of the most talented and knowledgeable people in their field. The certification is demonstrates that the holder has been working in IT Security for over five years and has a broad range of knowledge in ten domains related to creating, supporting and maintaining a secure IT infrastructure.",
			"descriptionMD": "",
			"length": 96478,
			"hidden": false,
			"url": "certified-information-systems-security-professional",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54cbee94cdda3005004f04db",
			"name": "CEH v8",
			"subtitle": "Certified Ethical Hacker",
			"description": "EC-Council's Certified Ethical Hacker (CEH) certification covers concepts and tools related to exploiting systems, networks, devices and operating platforms. It is designed to get an individual into the world of pen testing to learn techniques of how to test a network or infrastructure. This includes hacking concepts such as vulnerability assessment, network intrusion, reverse engineering, defacing websites, damaging network appliances, launching distributed denial-of-service attacks, massive worm propagation, breaking passwords, brute-forcing authentication systems, cracking encryption, exploiting systems, advance viruses, Trojans, and other malware. This certificate is targeted at site administrators, security professionals, auditors and anyone who is concerned about the integrity of the network infrastructure that has practical real world experience to support this type of equipment.",
			"descriptionMD": "",
			"length": 102258,
			"hidden": false,
			"url": "ceh",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-05-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "54fd95e1e974a00700572e58",
			"name": "Email Encryption",
			"subtitle": "with OpenPGP",
			"description": "This video series examines using encrypted email communications. Many email servers store and transmit emails in a non-secure manner. This series covers how to use OpenPGP to encrypt email prior to sending it which provides for end-to-end encryption. This is a critical component in guaranteeing the confidentiality of any email communication.",
			"descriptionMD": "",
			"length": 2666,
			"hidden": false,
			"url": "email-encryption",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2014-12-31T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55416830ff30370700f483fb",
			"name": "Digital Forensic Investigator",
			"subtitle": "Information retrieval and protection",
			"description": "Digital Forensic Investigator guides you through the process of performing a forensic investigation and is for someone who is going to be doing corporate or criminal investigations that may include collecting, preserving and analyzing evidence and getting it ready to be presented in court. Viewers will learn the steps involved in performing an investigation, from securing the crime scene, to collecting and processing the evidence, and reporting the findings and hear about some of the certifications one can achieve to prove their knowledge in this area, which is important knowledge for all IT security personnel, giving you the knowledge needed to respond properly in the event of a security incident.",
			"descriptionMD": "",
			"length": 107180,
			"hidden": false,
			"url": "digital-forensic-investigator",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "555262223b0252070003bb05",
			"name": "Cryptography",
			"subtitle": "An in-depth look into cryptography concepts",
			"description": "These episodes are designed to demystify the world of cryptography. One will hear about the different aspects of cryptography, associated terminology, different types of cryptography, applications to it and other topics ranging from the history of cryptography, to high-level concepts like ciphers and key exchanges. Discover practical applications of cryptography and how it is applied to various areas in the field of security.",
			"descriptionMD": "",
			"length": 44115,
			"hidden": false,
			"url": "cryptography",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "2015-05-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55797e2af4fdcf070096c5a4",
			"name": "pfSense",
			"subtitle": "pfSense Build 2.2.2",
			"description": "pfSense is a popular open source firewall solution that has many of the same features as some of the enterprise security appliances offered by many of the leading security appliance vendors.  It’s full feature set is provided free of charge.  This series was designed to introduce to our viewers the pfSense solution, demonstrate many of its features and provide some of the most essential configuration guidance to someone desiring to get pfSense working in their environment.",
			"descriptionMD": "",
			"length": 37514,
			"hidden": false,
			"url": "pfsense",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "558998baf4d57f07009f2727",
			"name": "Working with SSH",
			"subtitle": "SSH Tools and Tips",
			"description": "The Working with SSH show aims to remove the intimidation of using the Secure Shell protocol on your network. SSH allows for encrypting network communications to protect from eavesdropping and man-in-the-middle attacks. This series demonstrates how to configure and use SSH to securely manage your systems.",
			"descriptionMD": "",
			"length": 1997,
			"hidden": false,
			"url": "ssh",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5594287247725807004cd96c",
			"name": "Kali Linux",
			"subtitle": "Configuration of Kali Linux",
			"description": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
			"descriptionMD": "",
			"length": 51589,
			"hidden": false,
			"url": "kali-linux",
			"productionStart": "2015-06-29T04:00:00Z",
			"productionEnd": "2015-07-03T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "559d6ce0720f740700efb766",
			"name": "Metasploit",
			"subtitle": "Configuration of Metasploit",
			"description": "Metasploit is a popular penetration testing software, which is represented as a suite of tools, which can go through the whole penetration testing process. Whether using Windows or Linux, Metasploit can be a powerful tool to test network security and is positioned as something that network administrators, penetration testers and even developers could use, which can make it a valuable addition to one’s security toolkit.",
			"descriptionMD": "",
			"length": 43041,
			"hidden": false,
			"url": "metasploit",
			"productionStart": "2015-07-06T04:00:00Z",
			"productionEnd": "2015-07-10T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55bbe0350fa2380700bb5585",
			"name": "CompTIA Advanced Security Practitioner",
			"subtitle": "CASP",
			"description": "The CompTIA Advanced Security Practitioner (CASP) certification designates IT professionals with advanced-level security skills and knowledge. CASP covers the technical knowledge and skills required to conceptualize, design, and engineer secure solutions across complex enterprise environments. CASP is approved by U.S. Dept. of Defense to meet IA technical and management certification requirements.",
			"descriptionMD": "",
			"length": 95324,
			"hidden": false,
			"url": "comptia-advanced-security-practitioner",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55d328b10edbae070056bc7c",
			"name": "Pentesting Tools",
			"subtitle": "Tools for the Pentester",
			"description": "Virtualization plays a big role in putting pen testing tools into practice. One will hear from this course how a professional pen tester sets up a lab in a safe environment, so one can test things like Kali Linux and Metasploit. One will also see demonstrations of several reconnaissance tools, like Ghost Phisher, Sparta and BeEF as well as hear discussions on footprinting.",
			"descriptionMD": "",
			"length": 13297,
			"hidden": false,
			"url": "pentesting-tools",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55f2d875eedbfe0700a75fa7",
			"name": "Certified Cloud Security Professional",
			"subtitle": "CCSP",
			"description": "As powerful as cloud computing is for the organization, understanding its information security risks and mitigation strategies is critical. Legacy approaches are inadequate, and organizations need competent, experienced professionals equipped with the right cloud security knowledge and skills to be successful. They need CCSPs.",
			"descriptionMD": "",
			"length": 43246,
			"hidden": false,
			"url": "certified-cloud-security-professional",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "55f710efaf3e3707006f29f8",
			"name": "Security Tech Skills",
			"subtitle": "Commonly used penetration tools",
			"description": "In this series, Sean and Mike explore several tools that are commonly used for Penetration Testing. They show how the tools work, and explore their functionality. They also demonstrate how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
			"descriptionMD": "",
			"length": 39822,
			"hidden": false,
			"url": "security-tech-skills",
			"productionStart": "2015-09-14T04:00:00Z",
			"productionEnd": "2015-09-18T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56312e6ed6859e0700426929",
			"name": "Windows 10 Security",
			"subtitle": "Security in Windows 10",
			"description": "There are a lot of different technologies that can be used to keep data more secure in Windows 10 including NTFS permissions, which controls the level of access someone has and the kind of actions one can perform on different files. The topics that are covered range from data security, host security, application management to recovery of the operating system. This is designed for a broad range of individuals including help-desk technicians to the average end-user seeking to implement a more secure Windows 10 environment.",
			"descriptionMD": "",
			"length": 34434,
			"hidden": false,
			"url": "windows-10-security",
			"productionStart": "2015-11-01T04:00:00Z",
			"productionEnd": "2015-11-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5644e9fe597c030700e7ace5",
			"name": "FirePOWER with Advanced FireSIGHT Administration",
			"subtitle": "SSFIPS",
			"description": "FirePOWER is the power of the next generation IPS/ firewall that runs on one’s managed devices and defense center and FireSIGHT is a passive technology that scans a network and gathers information about users, hosts and applications. Viewers will learn about Cisco FirePOWER (formerly SourceFIRE) and how it can be employed to secure a network. Upon completion of this series, you will be able to identify the various features of Cisco FirePOWER, the FireSIGHT Management Center and FirePOWER AMP. You will also be able to configure FireSIGHT policies to enforce your company's security policy to all traffic on your network.",
			"descriptionMD": "",
			"length": 28216,
			"hidden": false,
			"url": "firepower-advanced-firesight-administration",
			"productionStart": "2015-11-09T05:00:00Z",
			"productionEnd": "2015-11-13T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56547ea648bd080700aa283d",
			"name": "AntiVirus / AntiMalware",
			"subtitle": "Detection and solutions",
			"description": "This series is for anyone wanting a better understanding of the common malware types and related concepts needed to make informed decisions on which antivirus is right for their environment. We look at the consumer class antivirus software, some of the major components inside it and demonstrate some of the common antivirus software one might encounter in a home network or small home business. We will also venture into antivirus software that scales to large businesses via enterprise-class software. This series will help a technician or newcomer understand why they might need anti-malware and antivirus solutions and the difference between consumer class and enterprise class antivirus software.",
			"descriptionMD": "",
			"length": 39508,
			"hidden": false,
			"url": "antivirus-antimalware",
			"productionStart": "2015-11-15T05:00:00Z",
			"productionEnd": "2015-11-30T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5671c5a1a5f5110700f8f666",
			"name": "Certified Information Systems Security Professional (UPDATED 2016)",
			"subtitle": "CISSP",
			"description": "The Certified Information Systems Security Professional (CISSP) certification is the gold standard in the IT Security field. Security professionals that have achieved their CISSP designation are regarded as some of the most talented and knowledgeable people in their field. The certification demonstrates that the holder has been working in IT Security for over five years, has a broad range of knowledge in ten domains related to creating, supporting and maintaining a secure IT infrastructure and can implement things like risk management and risk identification.",
			"descriptionMD": "",
			"length": 99645,
			"hidden": false,
			"url": "certified-information-systems-security-professional-reshoot",
			"productionStart": "2015-12-15T05:00:00Z",
			"productionEnd": "2016-01-15T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "56e97ade5bb9380700db7f28",
			"name": "CompTIA Advanced Security Practitioner (2016)",
			"subtitle": "CASP",
			"description": "Those looking to complete the CompTIA Advanced Security Practitioner (CASP) certification will find in this course an overview of the process in achieving the certification and a brief amount of details about the exam required to pass in order to receive the certification. The CASP covers the technical knowledge and skills required to conceptualize, design, and engineer secure solutions across complex enterprise environments. The certification is designed for advanced security professionals that have knowledge of Security+, have a few years of experience in the field, and will go on to learn more advanced skills and need to understand things like risk management and incident response and is also approved by U.S. Dept. of Defense to meet IA technical and management certification requirements.",
			"descriptionMD": "Those looking to complete the _CompTIA Advanced Security Practitioner (CASP) certification_ will find in this course an overview of the process in achieving the certification and a brief amount of details about the exam required to pass in order to receive the certification. The CASP covers the technical knowledge and skills required to conceptualize, design, and engineer secure solutions across complex enterprise environments. The certification is designed for advanced security professionals that have knowledge of Security+, have a few years of experience in the field, and will go on to learn more advanced skills and need to understand things like risk management and incident response and is also approved by U.S. Dept. of Defense to meet IA technical and management certification requirements. __[Click here](https://itpro.tv/comptia-partnership) to get an exam voucher discount.__",
			"length": 67409,
			"hidden": false,
			"url": "comptia-advanced-security-practitioner-2016",
			"productionStart": "2016-12-13T18:52:27.933Z",
			"productionEnd": "2016-12-13T18:52:27.933Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "570e4077e6a6a20700f12af9",
			"name": "Certified Cloud Security Professional (UPDATED 2016)",
			"subtitle": "CCSP",
			"description": "The Certified Cloud Security Professional (CCSP) is a credential that is going to be relevant especially for people who want to focus on the knowledge areas of architectural concepts and design requirements, cloud data security, cloud platform and infrastructure security, cloud application security, and compliance concerns in a traditional standard enterprise environment. As powerful as cloud computing is for the organization, understanding its information security risks and mitigation strategies are critical. Legacy approaches are inadequate, and organizations need competent, experienced professionals equipped with the right cloud security knowledge and skills to be successful. The CCSP certification is for IT professionals with a minimum of five years of cumulative IT experience with backgrounds and exposure to cloud related services.",
			"descriptionMD": "",
			"length": 81559,
			"hidden": false,
			"url": "certified-cloud-security-professional-2016",
			"productionStart": "2016-04-11T04:00:00Z",
			"productionEnd": "2016-04-15T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "571e213d1bd273070078c411",
			"name": "CISA",
			"subtitle": "Certified Information Systems Auditor",
			"description": "The Certified Information Systems Auditor (CISA) designation is a globally recognized certification for IS audit control, assurance and security professionals. Being CISA-certified showcases your audit experience, skills and knowledge, and demonstrates you are capable to assess vulnerabilities, report on compliance and institute controls within the enterprise. One should have a minimum of 5 years of experience and be able to demonstrate proficiency and understanding across the 5 domains areas, which include auditing information systems, protection of information assets and others.",
			"descriptionMD": "",
			"length": 39324,
			"hidden": false,
			"url": "cisa",
			"productionStart": "2017-01-13T16:00:15.547Z",
			"productionEnd": "2017-01-13T16:00:15.547Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5733282475149f070003da6c",
			"name": "Nmap",
			"subtitle": "Network Mapper, a Security Scanner",
			"description": "In this series we will be covering the use of network mapper utility aptly called Nmap. This series aims to give the viewer a firm grasp of the concepts and applications inherent to Nmap, such as Host Discovery, Port Scanning, Service/OS/Version Detection, and the Nmap Scripting Engine(NSE) for the purposes of security and general network administration.",
			"descriptionMD": "",
			"length": 25597,
			"hidden": false,
			"url": "nmap",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "576049e75f26ce0700591308",
			"name": "CEH v9",
			"subtitle": "Certified Ethical Hacker",
			"description": "EC-Council's Ethical Hacking and Countermeasures (CEH) covers concepts and tools related to exploiting systems, networks, devices and operating platforms. This includes hacking concepts such as vulnerability assessment, network intrusion, reverse engineering, defacing websites, damaging network appliances, launching distributed denial-of-service attacks, massive worm propagation, breaking passwords, brute-forcing authentication systems, cracking encryption, exploiting systems, advance viruses, Trojans, and other malware. This certificate is targeted at site administrators, security professionals, auditors and anyone who is concerned about the integrity of the network infrastructure.",
			"descriptionMD": "",
			"length": 121291,
			"hidden": false,
			"url": "ceh-v9",
			"productionStart": "2016-06-15T04:00:00Z",
			"productionEnd": "2016-08-31T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "57699a2bc7635f070083b8bc",
			"name": "Social Engineering",
			"subtitle": "The art of hacking humans",
			"description": "In this series, Daniel and Tom take you through the \"DNA\" of Social Engineering. They will look into the history of Social Engineering to see where it began and how it has evolved. They will also discuss the tactics, concepts, and tools used by Social Engineers to elicit information from their targets. They also dive into the psychological component of both the attackers as well as the targets and point to documented examples for illustrative purposes.",
			"descriptionMD": "",
			"length": 28647,
			"hidden": false,
			"url": "social-engineering",
			"productionStart": "0001-01-01T00:00:00Z",
			"productionEnd": "0001-01-01T00:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5873a1095733a60b003917a8",
			"name": "CyberSec First Responder",
			"subtitle": "Logical Operations",
			"description": "Created by Logical Operations, the CyberSec First Responder certification, which is DoD Directive 8570 compliant, will prepare security professionals to become the first responders in their organization. You will learn how to defend against cyber-attacks, analyze threats, design secure computing and network environments, proactively defend networks, and respond/investigate to cybersecurity incidents.",
			"descriptionMD": "Created by [Logical Operations](http://logicaloperations.com/itprotv-cfr/), the CyberSec First Responder certification, which is DoD Directive 8570 compliant, will prepare security professionals to become the first responders in their organization. You will learn how to defend against cyber-attacks, analyze threats, design secure computing and network environments, proactively defend networks, and respond/investigate to cybersecurity incidents.",
			"length": 56748,
			"hidden": false,
			"url": "cybersecurityresponder",
			"productionStart": "2017-01-13T16:40:40.473Z",
			"productionEnd": "2017-01-13T16:40:40.473Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "588f62d66c75670b004193b3",
			"name": "Penetration Testing",
			"subtitle": "Tools and techniques for verifying security integrity",
			"description": "In this series, Daniel and Mike discuss, explain, and demonstrate some of the common tools and techniques used by Penetrations Testers during a security audit. Watch as they explore topics like hacking platforms and test environments, creating BIND/REVERSE shells, discovering and exploiting Buffer Overflows, Cross Site Scripting attacks, Local and Remote File Inclusion attacks, SQL-Injection, Password attacks, Privilege Escalation, and Port Redirection.",
			"descriptionMD": "In this series, Daniel and Mike discuss, explain, and demonstrate some of the common tools and techniques used by Penetrations Testers during a security audit. Watch as they explore topics like hacking platforms and test environments, creating BIND/REVERSE shells, discovering and exploiting Buffer Overflows, Cross Site Scripting attacks, Local and Remote File Inclusion attacks, SQL-Injection, Password attacks, Privilege Escalation, and Port Redirection.",
			"length": 33546,
			"hidden": false,
			"url": "penetration-testing",
			"productionStart": "2017-01-30T05:00:00Z",
			"productionEnd": "2017-01-30T05:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "59480ea67e53c50b000096ad",
			"name": "Security Tech Skills (2017)",
			"subtitle": "Commonly used penetration tools",
			"description": "In this series, Mike explores several tools that are commonly used for Penetration Testing. He shows how the tools work, and explore their functionality. He also demonstrates how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
			"descriptionMD": "In this series, Mike explores several tools that are commonly used for Penetration Testing. He shows how the tools work, and explore their functionality. He also demonstrates how to create your own tools, like loading Kali Nethunter on a Nexus 7 and creating your own PwnPad.",
			"length": 17914,
			"hidden": false,
			"url": "security-tech-skills-2017",
			"productionStart": "2017-06-19T04:00:00Z",
			"productionEnd": "2017-07-05T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "595e95bdf7842c0b00109825",
			"name": "Kali Linux (2017)",
			"subtitle": "Configuration of Kali Linux",
			"description": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
			"descriptionMD": "Kali Linux is an advanced, versatile penetration testing platform and has dozens and dozens of tools complied into it, making it a very powerful, yet highly customizable platform. These episodes will teach you how to install Kali Linux, and how to use Kali Linux to test the security of a network. You will learn how to effectively perform a penetration test using the various tools found in Kali Linux.",
			"length": 50073,
			"hidden": false,
			"url": "kali-linux-2017",
			"productionStart": "2017-06-20T04:00:00Z",
			"productionEnd": "2017-06-30T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5991a739c92a740b00d15e67",
			"name": "Linux Security Techniques",
			"subtitle": "Security features found in modern Linux distributions",
			"description": "The Linux Security Techniques series introduces the viewers to the various security features found in modern Linux distributions. Topics covered include data encryption, auditing access, SELinux and firewall configuration among others. The series also lightly covers penetration testing to ensure that each security technique is implemented properly.",
			"descriptionMD": "The *Linux Security Techniques* series introduces the viewers to the various security features found in modern Linux distributions. Topics covered include data encryption, auditing access, SELinux and firewall configuration among others. The series also *lightly* covers penetration testing to ensure that each security technique is implemented properly.",
			"length": 38833,
			"hidden": false,
			"url": "linux-security-techniques",
			"productionStart": "2017-08-14T04:00:00Z",
			"productionEnd": "2017-08-22T04:00:00Z",
			"episodes": null,
			"topics": null
		},
		{
			"id": "5a0dbc3622b7590e0036fa49",
			"name": "Practical IT Security",
			"subtitle": "Hands-On answers to security questions",
			"description": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
			"descriptionMD": "The Practical IT Security series is designed to answer the \"HOW\" questions that we all have from time to time surrounding everyday IT security issues and concerns across a variety of topics. We explain the concepts, discuss the technologies, and then show you how to do it !!!, no fuss, no muss, just simple to follow guidance and answers for those things that you just have to get done.",
			"length": 62194,
			"hidden": false,
			"url": "practicalsecurity",
			"productionStart": "2017-11-14T05:00:00Z",
			"productionEnd": "2017-11-16T05:00:00Z",
			"episodes": null,
			"topics": null
		}
	]
}