{
	"certcategory": "CompTIA",
	"url": "comptia",
	"weight": 0,
	"resources": [
		{
			"title": "Getting Started with CompTIA A+",
			"description": "Are you looking to start your IT career? CompTIA A+ is the foundation to a career in IT. In this video, Don explains what CompTIA A+ covers, what is required to become certified, and exam objectives.",
			"url": "https://www.youtube.com/watch?v=3eOTamVhZkg&t"
		},
		{
			"title": "Getting Started with CompTIA Network+",
			"description": "If you're looking to be a Network Administer, someone who supports routers, switches, ethernet networks, wireless networks, or fiberoptic networks, CompTIA Network+ is the certification for you.",
			"url": "https://www.youtube.com/watch?v=3rdEIQYy-6E"
		},
		{
			"title": "Getting Started with CompTIA Security+",
			"description": "CompTIA Security+ is an intermediate IT certification that shows you have the relevant knowledge and skills to function as an IT security worker. This certification is designed for almost any IT professional.",
			"url": "https://www.youtube.com/watch?v=GEgY3Coe6CQ&t"
		},
		{
			"title": "CompTIA Interactive Roadmap",
			"description": "Deciding to work in the IT industry is an exceptionally good choice. Getting an IT certification can help you get started and get ahead in your career. The CompTIA IT Certification Roadmap can make navigating the world of certifications a little easier.​",
			"url": "https://certification.comptia.org/why-certify/roadmap"
		},
		{
			"title": "CompTIA PDF Roadmap",
			"description": "The PDF version of the CompTIA Roadmap, designed to make navigating the world of IT certifications a little easier.",
			"url": "https://certification.comptia.org/docs/default-source/downloadablefiles/it-certification-roadmap.pdf?sfvrsn=16"
		},
		{
			"title": "CompTIA Exam Objectives",
			"description": "Get a comprehensive overview of the topic areas tested in your certification exam. Use the exam objectives to make sure you're covering all test topics.",
			"url": "https://certification.comptia.org/training/exam-objectives"
		},
		{
			"title": "CompTIA Sample Questions",
			"description": "Are you ready to take your certification exam? Find out with a set of sample questions that cover multiple topics and will give you a good idea what kind of questions will appear on the test. These practice questions are available for all CompTIA IT certification exams.",
			"url": "https://certification.comptia.org/training/sample-questions"
		},
		{
			"title": "CompTIA Exam Prices",
			"description": "This is a list of all current CompTIA exam prices. Some of our exams are now available as In-Person exams for all exam takers, as well as Online Exams for exam takers in the United States. Get 10% off CompTIA exams - use coupon code ITPROTV.",
			"url": "https://certification.comptia.org/testing/exam-prices"
		}
	]
}
