{
  "contentFull": null,
  "contentShort": null,
  "tagcategoryname": "Category",
  "tags": [
    {
      "contentFull": "IT experts agree that best place to start your IT career is with CompTIA. CompTIA A+, CompTIA Network+, and CompTIA Security+ are the foundation for most IT careers. Add CompTIA Cybersecurity Analyst (CySA+) for additional security expertise. These vendor-neutral courses will launch you into any direction you want to take in IT.",
      "contentShort": null,
      "tagname": "CompTIA",
      "url": "comptia"
    },
    {
      "contentFull": "With courses in Microsoft Technology Associate (MTA), Microsoft Certified Solutions Associate (MCSA), Microsoft Certified Solutions Engineer (MCSE), SQL Server, Exchange and more, you’ll find what you need for a career in Microsoft with ITProTV. Microsoft is a global IT leader. Get the skills you need to be confident in the Microsoft environment.",
      "contentShort": null,
      "tagname": "Microsoft",
      "url": "microsoft"
    },
    {
      "contentFull": "Cisco is the worldwide leader in IT and so Cisco certifications are always in demand. Train with ITProTV to earn certifications like Cisco Certified Entry Networking Technician (CCENT), Cisco Certified Network Associate (CCNA) and Cisco Certified Network Professional (CCNP).",
      "contentShort": null,
      "tagname": "Cisco",
      "url": "cisco"
    },
    {
      "contentFull": "Access courses to expand your knowledge in the space that is most in demand today – security. Explore pen testing tools, cryptography, malware detection and more. End user security awareness training is also included.",
      "contentShort": null,
      "tagname": "Security Skills",
      "url": "security-skills"
    },
    {
      "contentFull": "Smartphones, cars, home appliances...the world runs on Linux. Get online Linux training and master this open-source technology with ITProTV - the fun and engaging way to learn.",
      "contentShort": null,
      "tagname": "Linux",
      "url": "linux"
    },
    {
      "contentFull": "Looking for security certs? Get started on your Systems Security Certified Practitioner\n(SSCP), Certified Information Systems Security Professional (CISSP) and Certified Cloud Security Professional (CSSP) right here. ITProTV is your partner is security training that’s current,",
      "contentShort": null,
      "tagname": "ISC2",
      "url": "isc2"
    },
    {
      "contentFull": "Looking for Certified Ethical Hacker (CEH), Computer Hacking Forensic Investigator (CHFI), Certified Incident Handler (ECIH) or Certified Encryption Specialist (ECEH)? Get the EC Council training you need from ITProTV. ITProTV is your partner is security training throughout your security career.",
      "contentShort": null,
      "tagname": "EC Council",
      "url": "ec-council"
    },
    {
      "contentFull": "Get the tools you need to effectively support the Apple environment. Learn about management, integrations and more with this comprehensive set of courses from ITProTV. Train to become an Apple Certified Support Professional (ACSP).",
      "contentShort": null,
      "tagname": "Apple",
      "url": "apple"
    },
    {
      "contentFull": "Get certified on Amazon Web Services (AWS). Learn how to manage this on-demand cloud computing platform popular with companies and governments. Train with ITProTV to become an AWS Certified Solutions Architect and a Certified SysOps Administrator (ACSA).",
      "contentShort": null,
      "tagname": "AWS",
      "url": "aws"
    },
    {
      "contentFull": "Align IT and business goals for successful outcomes with ITIL certification. ITProTV offers all levels of ITIL – foundation through expert and even master – in an engaging format. Pass rates with ITProTV training are best in the market: more than 98%.",
      "contentShort": null,
      "tagname": "ITIL",
      "url": "itil"
    },
    {
      "contentFull": "Agile project management skills are in demand – especially in high tech. With a focus on continuous improvement, scope flexibility, team input, and delivering essential quality products, Agile PMs excel. Learn all aspects of Agile, including scrum methodology, with ITProTV.",
      "contentShort": null,
      "tagname": "Agile",
      "url": "agile"
    },
    {
      "contentFull": "ITProTV offers training in Exin SIAM - Service Integration and Management -  a management methodology for environments where services are sourced from multiple service providers. Learn from the SIAM experts in an engaging format.",
      "contentShort": null,
      "tagname": "Exin",
      "url": "exin"
    },
    {
      "contentFull": "Project managers with the PMP certification earn 20% more than their non-certified counterparts. Train with ITProTV to learn the tools and techniques used by successful PMs around the globe.",
      "contentShort": null,
      "tagname": "PMI",
      "url": "pmi"
    },
    {
      "contentFull": "Hands-on security pros seek out GIAC certifications, and ITProTV has you covered. \nITProTV is your partner is security training that’s current, engaging, and effective.",
      "contentShort": null,
      "tagname": "GIAC",
      "url": "giac"
    },
    {
      "contentFull": "Looking for security certs? Get started on your Certified Information Systems Auditor (CISA) and Certified Information Systems Manager (CISM) right here. ITProTV is your partner is security training that’s current, engaging, and effective.",
      "contentShort": null,
      "tagname": "ISACA",
      "url": "isaca"
    },
    {
      "contentFull": "VMware certification is the most highly recognized certification dealing specifically with virtualization technologies. Get current and engaging VMware training with ITProTV.",
      "contentShort": null,
      "tagname": "VMWare",
      "url": "vmware"
    },
    {
      "contentFull": "Learn the processes that ensure the effective and efficient use of IT in enabling an organization to achieve its goals. ITProTV offers binge-worthy courses in Prince 2 and ISO/IEC.",
      "contentShort": null,
      "tagname": "IT Governance",
      "url": "it-governance"
    },
    {
      "contentFull": "Six Sigma is a disciplined, data-driven approach and methodology for eliminating defects in any process – from manufacturing to transactional and from product to service. Learn Lean Six Sigma Green and Yellow Belt the engaging way with ITProTV.",
      "contentShort": null,
      "tagname": "Six Sigma",
      "url": "six-sigma"
    },
    {
      "contentFull": "Explore the Bash environment and create practical scripts. Use a real-world scenario to amplify your understanding of scripts. Binge on automation training with the friendly faces of IT.",
      "contentShort": null,
      "tagname": "Automation",
      "url": "automation"
    },
    {
      "contentFull": "Explore a wide range of networking skills with ITProTV. Start with the basics like configuring a home router and move into network mapping and trouble shooting.",
      "contentShort": null,
      "tagname": "Networking Skills",
      "url": "networking-skills"
    },
    {
      "contentFull": "Need to get started with the basics? ITProTV has you covered. Build and maintain a PC.  Learn how to work with applications. Understand security awareness basics. It’s all here for beginners.",
      "contentShort": null,
      "tagname": "IT Foundation Skills",
      "url": "it-foundation-skills"
    },
    {
      "contentFull": "Everything is moving to the cloud. Get the training you need to be a cloud computing pro with ITProTV – the fun and engaging way to learn. Azure, AWS, and MCSE Private Cloud are all included in the ITProTV course library.",
      "contentShort": null,
      "tagname": "Cloud Technology Skills",
      "url": "cloud-technology-skills"
    },
    {
      "contentFull": "Spinning up virtual environments? Get the training you need on fundamentals, plus courses on Citrix and Linux with ITProTV.",
      "contentShort": null,
      "tagname": "Virtualization Skills",
      "url": "virtualization-skills"
    },
    {
      "contentFull": "Businesses around the world run on Microsoft Office. Get training on Word, Excel, Access, Powerpoint, Outlook, and more. Also included: Skype and end-user security awareness.",
      "contentShort": null,
      "tagname": "OfficeProTV",
      "url": "officeprotv"
    },
    {
      "contentFull": "Ready to launch your career in software development? Start here. There are tons of intro courses to sample and see where you fit in best. HTML5, Angular, Ruby, Python, and more. Get a taste of it all with DevProTV.",
      "contentShort": null,
      "tagname": "DevProTV",
      "url": "devprotv"
    },
    {
      "contentFull": "The standard for design professionals around the world, Adobe Creative Cloud is a set of applications and services used for graphic design, video editing, web development, photography editing and more. ITProTV has your Adobe training covered.",
      "contentShort": null,
      "tagname": "Adobe",
      "url": "adobe"
    },
    {
      "contentFull": "Career development, change and transition management, leading IT teams: these are just a few of the business leadership covered in Biz Pro training from ITProTV. Leaders and developing leaders can binge-watch the soft skills they need to advance.",
      "contentShort": null,
      "tagname": "BizProTV",
      "url": "bizprotv"
    }
  ],
  "url": "course-library",
  "weight": 0
}
